{
  "title": "NEVER NEVER",
  "description": "Best friends since they could walk. In love since the age of fourteen.\n \nComplete strangers since this morning.\n \nHe'll do anything to remember. She'll do anything to forget.",
  "author": "Tarryn Fisher",
  "genres": [
    "Romance",
    "Young Adult"
  ],
  "imageUrl": "https://novels77.com/uploads/truyen/never-never.jpg",
  "data": [
    {
      "text": "Page 1",
      "content": "Loading...\n\nA crash. Books fall to the speckled linoleum floor. They skid a few feet, whirling in circles, and stop near feet. My feet. I don’t recognize the black sandals, or the red toenails, but they move when I tell them to, so they must be mine. Right?\n\nA bell rings.\n\nShrill.\n\nI jump, my heart racing. My eyes move left to right as I scope out my environment, trying not to give myself away.\n\nWhat kind of bell was that?\n\nWhere am I?\n\nKids with backpacks walk briskly into the room, talking and laughing. A school bell. They slide into desks, their voices competing in volume. I see movement at my feet and jerk in surprise. Someone is bent over, gathering up books on the floor; a red-faced girl with glasses. Before she stands up, she looks at me with something like fear and then scurries off. People are laughing. When I look around I think they’re laughing at me, but it’s the girl with glasses they’re looking at.\n\n“Charlie!” Someone calls. “Didn’t you see that?” And then, “Charlie…what’s your problem…hello…?”\n\nMy heart is beating fast, so fast.\n\nWhere is this? Why can’t I remember?\n\n“Charlie!” someone hisses. I look around.\n\nWho is Charlie? Which one is Charlie?\n\nThere are so many kids; blond hair, ratty hair, brown hair, glasses, no glasses…\n\nA man walks in carrying a briefcase. He sets it on the desk.\n\nThe teacher. I am in a classroom, and that is the teacher. High school or college, I wonder.\n\nI stand up suddenly. I’m in the wrong place. Everyone is sitting, but I’m standing…walking.\n\n“Where are you going, miss Wynwood?” The teacher is looking at me over the rim of his glasses as he rifles through a pile of papers. He slaps them down hard on the desk and I jump. I must be miss Wynwood.\n\n“She has cramps!” Someone calls out. People snicker. I feel a chill creep up my back and crawl across the tops of my arms. They’re laughing at me, except I don’t know who these people are.\n\nI hear a girl’s voice say, “Shut up, Michael.”\n\n“I don’t know,” I say, hearing my voice for the first time. It’s too high. I clear my throat and try again. “I don’t know. I’m not supposed to be here.”\n\nThere is more laughing. I glance around at the posters on the wall, the faces of presidents animated with dates beneath them. History class? High school.\n\nThe man—the teacher—tilts his head to the side like I’ve said the dumbest thing. “And where else are you supposed to be on test day?”\n\n“I…I don’t know.”\n\n“Sit down,” he says. I don’t know where I’d go if I left. I turn around to go back. The girl with the glasses glances up at me as I pass her. She looks away almost as quickly.\n\nAs soon as I’m sitting, the teacher starts handing out papers. He walks between desks, his voice a flat drone as he tells us what percentage of our final grade the test will be. When he reaches my desk he pauses, a deep crease between his eyebrows. “I don’t know what you’re trying to pull.” He presses the tip of a fat pointer finger on my desk.\n\n“Whatever it is, I’m sick of it. One more stunt and I’m sending you to the principal’s office.” He slaps the test down in front of me and moves down the line.\n\nI don’t nod, I don’t do anything. I’m trying to decide what to do. Announce to the whole room that I have no idea who and where I am—or pull him aside and tell him quietly. He said no more stunts. My eyes move to the paper in front of me. People are already bent over their tests, pencils scratching.\n\nFOURTH PERIOD\n\nHISTORY\n\nMR. DULCOTT\n\nThere is a space for a name. I’m supposed to write my name, but I don’t know what my name is. Miss Wynwood, he called me.\n\nWhy don’t I recognize my own name?\n\nOr where I am?\n\nOr what I am?\n\nEvery head is bent over their papers except mine. So I sit and stare, straight ahead. Mr. Dulcott glares at me from his desk. The longer I sit, the redder his face becomes.\n\nTime passes and yet my world has stopped. Eventually, Mr. Dulcott stands up, his mouth open to say something to me when the bell rings. “Put your papers on my desk on the way out,” he says, his eyes still on my face. Everyone is filing out of the door. I stand up and follow them because I don’t know what else to do. I keep my eyes on the floor, but I can feel his rage. I don’t understand why he’s so angry with me. I am in a hallway now, lined on either side by blue lockers.\n\n“Charlie!” someone calls. “Charlie, wait up!” A second later, an arm loops through mine. I expect it to be the girl with the glasses; I don’t know why. It’s not. But, I know now that I am Charlie. Charlie Wynwood. “You forgot your bag,” she says, handing over a white backpack. I take it from her, wondering if there’s a wallet with a driver’s license inside. She keeps her arm looped through mine as we walk. She’s shorter than me, with long, dark hair and dewy brown eyes that take up half her face. She is startling and beautiful.\n\n“Why were you acting so weird in there?” she asks. “You knocked the shrimp’s books on the floor and then spaced out.”\n\nI can smell her perfume; it’s familiar and too sweet, like a million flowers competing for attention. I think of the girl with the glasses, the look on her face as she bent to scoop up her books. If I did that, why don’t I remember?\n\n“I-”\n\n“It’s lunch, why are you walking that way?” She pulls me down a different corridor, past more students. They all look at me…little glances. I wonder if they know me, and why I don’t know me. I don’t know why I don’t tell her, tell Mr. Dulcott, grab someone random and tell them that I don’t know who or where I am. By the time I’m seriously entertaining the idea, we’re through a set of double doors in the cafeteria. Noise and color; bodies that all have a unique smell, bright fluorescent lights that make everything look ugly. Oh, God. I clutch at my shirt.\n\nThe girl on my arm is babbling. Andrew this, Marcy that. She likes Andrew and hates Marcy. I don’t know who either of them is. She corrals me to the food line. We get salad and Diet Cokes. Then we are sliding our trays on a table. There are already people sitting there: four boys, two girls. I realize we are completing a group with even numbers. All the girls are matched with a guy. Everyone looks up at me expectantly, like I’m supposed to say something, do something. The only place left to sit is next to a guy with dark hair. I sit slowly, both hands flat on the table. His eyes dart toward me and then he bends over his tray of food. I can see the finest beads of sweat on his forehead, just below his hairline.\n\n“You two are so awkward sometimes,” says a new girl, blonde, across from me. She’s looking from me to the guy I’m sitting next to. He looks up from his macaroni and I realize he’s just moving things around on his plate. He hasn’t taken a bite, despite how busy he looks. He looks at me and I look at him, then we both look back at the blonde girl.\n\n“Did something happen that we should know about?” she asks.\n\n“No,” we say in unison.\n\nHe’s my boyfriend. I know by the way they’re treating us. He suddenly smiles at me with his brilliantly white teeth and reaches to put an arm around my shoulders.\n\nLoading..."
    },
    {
      "text": "Page 2",
      "content": "PROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\n\"Rũ sạch\" lá gan nhiễm độc do bia rượu bằng phương pháp đơn giản\n\n“We’re all good,” he says, squeezing my arm. I automatically stiffen, but when I see the six sets of eyes on my face, I lean in and play along. It’s frightening not knowing who you are – even more frightening thinking you’ll get it wrong. I’m scared now, really scared. It’s gone too far. If I say something now I’ll look…crazy. His affection seems to make everyone relax. Everyone except…him. They go back to talking, but all the words blend together: football, a party, more football. The guy sitting next to me laughs and joins in with their conversation, his arm never straying from my shoulders. They call him Silas. They call me Charlie. The dark-haired girl with the big eyes is Annika. I forget everyone else’s names in the noise.\n\nLunch is finally over and we all get up. I walk next to Silas, or rather he walks next to me. I have no idea where I’m going. Annika flanks my free side, winding her arms through mine and chatting about cheerleading practice. She’s making me feel claustrophobic. When we reach an annex in the hallway, I lean over and speak to her so only she can hear. “Can you walk me to my next class?” Her face becomes serious. She breaks away to say something to her boyfriend, and then our arms are looped again.\n\nI turn to Silas. “Annika is going to walk me to my next class.”\n\n“Okay,” he says. He looks relieved. “I’ll see you…later.” He heads off in the opposite direction.\n\nAnnika turns to me as soon as he’s out of sight. “Where’s he going?”\n\nI shrug. “To class.”\n\nShe shakes her head like she’s confused. “I don’t get you guys. One day you’re all over each other, the next you’re acting like you can’t stand to be in the same room. You really need to make a decision about him, Charlie.”\n\nShe stops outside a doorway.\n\n“This is me…” I say, to see if she’ll protest. She doesn’t.\n\n“Call me later,” she says. “I want to know about last night.”\n\nI nod. When she disappears into the sea of faces, I step into the classroom. I don’t know where to sit, so I wander to the back row and slide into a seat by the window. I’m early, so I open my backpack. There’s a wallet wedged between a couple of notebooks and a makeup bag. I pull it out and flip it open to reveal a driver’s license with a picture of a beaming, dark haired girl. Me.\n\nCHARLIZE MARGARET WYNWOOD.\n\n2417 HOLCOURT WAY,\n\nNEW ORLEANS, LA.\n\nI’m seventeen. My birthday is March twenty-first. I live in Louisiana. I study the picture in the top left corner and I don’t recognize the face. It’s my face, but I’ve never seen it. I’m…pretty. I only have twenty-eight dollars.\n\nThe seats are filling up. The one beside me stays empty, almost like everyone is too afraid to sit there. I’m in Spanish class. The teacher is pretty and young; her name is Mrs. Cardona. She doesn’t look at me like she hates me, like so many other people are looking at me. We start with tenses.\n\nI have no past.\n\nI have no past.\n\nFive minutes into class the door opens. Silas walks in, his eyes downcast. I think he’s here to tell me something, or to bring me something. I brace myself, ready to pretend, but Mrs. Cardona comments jokingly about his lateness. He takes the only available seat next to me and stares straight ahead. I stare at him. I don’t stop staring at him until finally, he turns his head to look at me. A line of sweat rolls down the side of his face.\n\nHis eyes are wide.\n\nWide...just like mine.\n\nThree hours.\n\nIt’s been almost three hours, and my mind is still in a haze.\n\nNo, not a haze. Not even a dense fog. It feels as if I’m wandering around in a pitch-black room, searching for the light switch.\n\n“You okay?” Charlie asks. I’ve been staring at her for several seconds, attempting to regain some semblance of familiarity from a face that should apparently be the most familiar to me.\n\nNothing.\n\nShe looks down at her desk and her thick, black hair falls between us like blinders. I want a better look at her. I need something to grab me, something familiar. I want to predict a birthmark or a freckle on her before I see it, because I need something recognizable. I’ll grasp at any piece of her that might convince me I’m not losing my mind.\n\nShe reaches her hand up, finally, and tucks her hair behind her ear. She looks up at me through two wide and completely unfamiliar eyes. The crease between her brows deepens and she begins biting at the pad of her thumb.\n\nShe’s worried about me. About us, maybe.\n\nUs.\n\nI want to ask her if she knows what might have happened to me, but I don’t want to scare her. How do I explain that I don’t know her? How do I explain this to anyone? I’ve spent the last three hours trying to act natural. At first I was convinced I must have used some kind of illegal substance that caused me to black out, but this is different from blacking out. This is different from being high or drunk, and I have no idea how I even know that. I don’t remember anything beyond three hours ago.\n\n“Hey.” Charlie reaches out like she’s going to touch me, then draws back. “Are you okay?”\n\nI grip the sleeve of my shirt and wipe the sheen of moisture off my forehead. When she glances back up at me, I see the concern still filling her eyes. I force my lips to form a smile.\n\n“I’m fine,” I mutter. “Long night.”\n\nAs soon as I say it, I cringe. I have no idea what kind of night I had, and if this girl sitting across from me really is my girlfriend, then a sentence like that probably isn’t very reassuring.\n\nI see a small twitch in her eye and she tilts her head. “Why was it a long night?”\n\nShit.\n\n“Silas.” The voice comes from the front of the room. I look up. “No talking,” the teacher says. She returns to her instruction, not too concerned with my reaction to being singled out. I glance back at Charlie, briefly, and then immediately stare down at my desk. My fingers trace over names carved into the wood. Charlie is still staring at me, but I don’t look at her. I flip my hand over, and I run two fingers over the callouses across the inside of my palm.\n\nDo I work? Mow lawns for a living?\n\nMaybe it’s from football. During lunch I decided to use my time to observe everyone around me, and I learned I have football practice this afternoon. I have no idea what time or where, but I’ve somehow made it through the last few hours without knowing when or where I’m supposed to be. I may not have any sort of recollection right now, but I’m learning that I’m very good at faking it. Too good, maybe.\n\nI flip my other hand over and find the same rough callouses on that palm.\n\nMaybe I live on a farm.\n\nNo. I don’t.\n\nI don’t know how I know, but even without being able to recall anything, I seem to have an immediate sense of what assumptions of mine are accurate and which are not. It could just be process of elimination, rather than intuition or memory. For example, I don’t feel like someone who lives on a farm would be wearing the clothes I have on. Nice clothes. Trendy? Looking down at my shoes, if someone asked me if I have rich parents, I’d tell them, “Yes, I do.” And I don’t know how, because I don’t remember my parents.\n\nI don’t know where I live, who I live with, or if I look more like my mother or my father.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 3",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI don’t even know what I look like.\n\nI stand abruptly, shoving the desk a few loud inches forward in the process. Everyone in the class turns to face me other than Charlie, because she hasn’t stopped staring at me since I sat down. Her eyes aren’t inquisitive or kind.\n\nHer eyes are accusing.\n\nThe teacher glares at me, but doesn’t seem at all surprised by the loss of everyone’s attention to me. She just stands, complacent, waiting for me to announce my reason for the sudden disruption.\n\nI swallow. “Bathroom.” My lips are sticky. My mouth is dry. My mind is wrecked. I don’t wait for permission before I begin to head in that direction. I can feel everyone’s stares as I push through the door.\n\nI go right and make it to the end of the hall without finding a restroom. I backtrack and pass by my classroom door, continuing until I round the corner and find the restroom. I push open the door, hoping for solitude, but someone is standing at the urinal with his back to me. I turn to the sink, but don’t look into the mirror. I stare down at the sink, placing my hands on either side of it, gripping tightly. I inhale.\n\nIf I would just look at myself, my reflection could trigger a memory, or maybe just give me a small sense of recognition. Something. Anything.\n\nThe guy who was standing at the urinal seconds before is now standing next to me, leaning against a sink with his arms folded. When I glance over at him, he’s glaring at me. His hair is so blond, it’s almost white. His skin is so pale, it reminds me of a jellyfish. Translucent, almost.\n\nI can remember what jellyfish look like, but I have no idea what I’ll find when I look at myself in the mirror?\n\n“You look like shit, Nash,” he says with a smirk.\n\nNash?\n\nEveryone else has been calling me Silas. Nash must be my last name. I would check my wallet, but there isn’t one in my pocket. Just a wad of cash. A wallet is one of the first things I looked for after…well, after it happened.\n\n“Not feeling too hot,” I grumble in response.\n\nFor a few seconds, the guy doesn’t respond. He just continues to stare at me the same way Charlie was staring at me in class, but with less concern and way more contentment. The guy smirks and pushes off the sink. He stands up straight, but is still about an inch shy of reaching my height. He takes a step forward, and I gather by the look in his eye that he isn’t closing in on me out of concern for my health.\n\n“We still haven’t settled Friday night,” the guy says to me. “Is that why you’re here now?” His nostrils flare when he speaks and his hands drop to his sides, clenching and unclenching twice.\n\nI have a two-second silent debate with myself, aware that if I step away from him, it’ll make me look like a coward. However, I’m also aware that if I step forward, I’ll be challenging him to something I don’t want to deal with right now. He obviously has issues with me and whatever it was that I chose to do Friday night that pissed him off.\n\nI compromise by giving him no reaction whatsoever. Look unaffected.\n\nI lazily move my attention to the sink and turn one of the knobs until a stream of water begins to pour from the faucet. “Save it for the field,” I say. I immediately want to take back those words. I hadn’t considered he might not even play football. I assumed he did based on his size, but if he doesn’t, my comment will have not made a damn bit of sense. I hold my breath and wait for him to correct me, or call me out.\n\nNeither of those things happens.\n\nHe stares for a few more seconds, and then he shoulders past me, purposefully bumping me on his way out the door. I cup my hands under the stream of water and take a sip. I wipe my mouth with the back of my hand and glance up. At myself.\n\nAt Silas Nash.\n\nWhat the hell kind of name is that, anyway?\n\nI’m staring, emotionless, into a pair of unfamiliar, dark eyes. I feel as though I’m staring at two eyes I’ve never seen before, despite the fact that I’ve more than likely looked at these eyes on a daily basis since I was old enough to reach a mirror.\n\nI’m as familiar with this person in the reflection as I am with the girl who is—according to some guy named Andrew—the girl I’ve been “banging” for two years now.\n\nI’m as familiar with this person in the reflection as I am with every single aspect of my life right now.\n\nWhich is not familiar at all.\n\n“Who are you?” I whisper to him.\n\nThe bathroom door begins to open slowly, and my eyes move from my reflection to the reflection of the door. A hand appears, gripping the door. I recognize the sleek, red polish on the tips of her fingers. The girl I’ve been “banging” for more than two years.\n\n“Silas?”\n\nI stand up straight and turn to face the door full-on as she peeks around it. When her eyes meet mine, it’s only for two seconds. She glances away, scanning the rest of the bathroom.\n\n“It’s just me,” I say. She nods and makes it the rest of the way through the door, albeit extremely hesitant. I wish I knew how to reassure her that everything is okay so she won’t grow suspicious. I also wish I remembered her, or anything about our relationship, because I want to tell her. I need to tell her. I need for someone else to know, so that I can ask questions.\n\nBut how does a guy tell his girlfriend he has no idea who she is? Who he, himself is?\n\nHe doesn’t tell her. He pretends, just like he’s been pretending with everyone else.\n\nOne hundred silent questions fill her eyes at once, and I immediately want to dodge them all. “I’m fine, Charlie.” I smile at her, because it feels like something I should do. “Just not feeling so hot. Go back to class.”\n\nShe doesn’t move.\n\nShe doesn’t smile.\n\nShe stays where she is, unaffected by my instruction. She reminds me of one of those animals on springs you’d ride on a playground. The kind you push, but they just bounce right back up. I feel like if someone were to shove her shoulders, she’d lean straight back, feet in place, and then bounce right back up again.\n\nI don’t remember what those things are called, but I do make a mental note that I somehow remember them. I’ve made a lot of mental notes in the last three hours.\n\nI’m a senior.\n\nMy name is Silas.\n\nNash might be my last name.\n\nMy girlfriend’s name is Charlie.\n\nI play football.\n\nI know what jellyfish look like.\n\nCharlie tilts her head and the corner of her mouth twitches slightly. Her lips part, and for a moment, all I hear are nervous breaths. When she finally forms words, I want to hide from them. I want to tell her to close her eyes and count to twenty until I’m too far away to hear her question.\n\n“What’s my last name, Silas?”\n\nHer voice is like smoke. Soft and wispy and then gone.\n\nI can’t tell if she’s extremely intuitive or if I’m doing a horrible job of covering up the fact that I know nothing. For a moment, I debate whether or not I should tell her. If I tell her and she believes me, she might be able to answer a lot of questions I have. But if I tell her and she doesn’t believe me…\n\n“Babe,” I say with a dismissive laugh. Do I call her babe? “What kind of question is that?”\n\nShe lifts the foot I was positive was stuck to the floor, and she takes a step forward. She takes another. She continues toward me until she’s about a foot away; close enough that I can smell her.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 4",
      "content": "PROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\n\"Rũ sạch\" lá gan nhiễm độc do bia rượu bằng phương pháp đơn giản\n\nLilies.\n\nShe smells like lilies, and I don’t know how I can possibly remember what lilies smell like, but somehow not remember the actual person standing in front of me who smells like them.\n\nHer eyes haven’t left mine, not even once.\n\n“Silas,” she says. “What’s my last name?”\n\nI work my jaw back and forth, and then turn around to face the sink again. I lean forward and grip it tightly with both hands. I slowly lift my eyes until they meet hers in the reflection.\n\n“Your last name?” My mouth is dry again and my words come out scratchy.\n\nShe waits.\n\nI look away from her and back at the eyes of the unfamiliar guy in the mirror. “I…I can’t remember.”\n\nShe disappears from the reflection, followed immediately by a loud smack. It reminds me of the sound the fish make at Pikes Place Market, when they toss and catch them in the wax paper.\n\nSmack!\n\nI spin around and she’s lying on the tile floor, eyes closed, arms splayed out. I immediately kneel down and lift her head, but as soon as I have her elevated several inches off the floor, her eyelids begin to flutter open.\n\n“Charlie?”\n\nShe sucks in a rush of air and sits up. She pulls herself out of my arms and shoves me away, almost as if she’s afraid of me. I keep my hands positioned near her in case she attempts to stand, but she doesn’t. She remains seated on the floor with her palms pressed into the tile.\n\n“You passed out,” I tell her.\n\nShe frowns at me. “I’m aware of that.”\n\nI don’t speak again. I should probably know what all her expressions mean, but I don’t. I don’t know if she’s scared or angry or…\n\n“I’m confused,” she says, shaking her head. “I…can you…” she pauses, and then makes an attempt to stand. I stand with her, but I can tell she doesn’t like this by the way she glares at my hands that are slightly lifted, waiting to catch her should she start to fall again.\n\nShe takes two steps away from me and crosses an arm over her chest. She brings her opposite hand up and begins chewing on the pad of her thumb again. She studies me quietly for a moment and then pulls her thumb from her mouth, making a fist. “You didn’t know we had class together after lunch.” Her words are spoken with a layer of accusation. “You don’t know my last name.”\n\nI shake my head, admitting to the two things I can’t deny.\n\n“What can you remember?” she asks.\n\nShe’s scared. Nervous. Suspicious. Our emotions are reflections of one another, and that’s when the clarity hits.\n\nShe may not feel familiar. I may not feel familiar. But our actions—our demeanor—they’re exactly the same.\n\n“What do I remember?” I repeat her question in an attempt to buy myself a few more seconds to allow my suspicions to gain footing.\n\nShe waits for my answer.\n\n“History,” I say, attempting to remember as far back as I can. “Books. I saw a girl drop her books.” I grab my neck again and squeeze.\n\n“Oh, God.” She takes a quick step toward me. “That’s…that’s the first thing I remember.”\n\nMy heart jumps to my throat.\n\nShe begins to shake her head. “I don’t like this. It doesn’t make sense.” She appears calm—calmer than I feel. Her voice is steady. The only fear I see is in the stretched whites of her eyes. I pull her to me without thinking, but I think it’s more for my own relief rather than to put her at ease. She doesn’t pull away, and for a second, I wonder if this is normal for us. I wonder if we’re in love.\n\nI tighten my hold until I feel her stiffen against me. “We need to figure this out,” she says, separating herself from me.\n\nMy first instinct is to tell her it’ll be okay, that I’ll figure it out. I’m flooded with an overwhelming need to protect her—only I have no idea how to do that when we’re both experiencing the same reality.\n\nThe bell rings, signaling the end of Spanish. Within seconds, the bathroom door will probably open. Lockers will be slamming shut. We’ll have to figure out what classes we’re supposed to be in next. I take her hand and pull her behind me as I push open the bathroom door.\n\n“Where are we going?” she asks.\n\nI look at her over my shoulder and shrug. “I have no idea. I just know I want to leave.”\n\nThis dude—this guy, Silas—he grabs my hand like he knows me and drags me behind him like I’m a little kid. And that’s what I feel like—a little kid in a big, big world. I don’t understand anything, and I most certainly don’t recognize anything. All I can think, as he pulls me through the understated halls of some anonymous high school, is that I fainted; keeled over like some damsel in distress. And on the boys’ bathroom floor. Filthy. I’m evaluating my priorities, wondering how my brain can fit germs into the equation when I clearly have a much larger problem, when we burst into the sunlight. I shield my eyes with my free hand as the Silas dude pulls keys from his backpack. He holds them above his head and makes a circle, clicking the alarm button on his key fob. From some far corner of the parking lot we hear the shriek of an alarm.\n\nWe run for it, our shoes slapping the concrete with urgency, as if someone is chasing us. And they might be. The car turns out to be an SUV. I know it’s impressive because it sits above the other cars, making them look small and insignificant. A Land Rover. Silas is either driving his dad’s car, or floating in his dad’s money. Maybe he doesn’t have a dad. He wouldn’t be able to tell me anyway. And how do I even know how much a car like this costs? I have memories of how things work: a car, the rules of the road, the presidents, but not of who I am.\n\nHe opens the door for me while looking over his shoulder toward the school, and I get the feeling I’m being pranked. He could be responsible for this. He could have given me something to cause me to lose my memory temporarily, and now he’s only pretending.\n\n“Is this for real?” I ask, suspended above the front seat. “You don’t know who you are?”\n\n“No,” he says. “I don’t.”\n\nI believe him. Kind of. I sink into my seat.\n\nHe searches my eyes for a moment longer before slamming my door and running around to the driver’s side. I feel rough. Like after a night of drinking. Do I drink? My license said I was only seventeen. I chew on my thumb as he climbs in and starts the engine by pressing a button.\n\n“How’d you know how to do that?” I ask.\n\n“Do what?”\n\n“Start the car without a key.”\n\n“I…I don’t know.”\n\nI watch his face as we pull out of the spot. He blinks a lot, glances at me more, runs a tongue over his bottom lip. When we’re at a stoplight, he finds the HOME button on the GPS and hits it. I’m impressed that he thought to do that.\n\n“Redirecting,” a woman’s voice says. I want to lose it, jump out of the moving car and run like a frightened deer. I am so afraid.\n\nHis home is large. There are no cars in the driveway as we linger on the curb, the engine purring quietly.\n\n“Are you sure this is you?” I ask.\n\nHe shrugs.\n\n“Doesn’t look like anyone is home,” he says. “Should we?”\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 5",
      "content": "PROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nCư dân mạng phát sốt với bản sao đồng hồ Omega giảm 90% 1 ngày\nWatchthuysichinhhang\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI nod. I shouldn’t be hungry, but I am. I want to go inside and have something to eat, maybe research our symptoms and see if we’ve come in contact with some brain-eating bacteria that’s stolen our memories. A house like this should have a couple of laptops lying around. Silas turns into the driveway and parks. We climb out timidly, looking around at the shrubs and trees like they’re going to come alive. He finds a key on his key ring that opens the front door. As I stand behind him and wait, I study him. In his clothes and hair he wears the cool look of a guy who doesn’t care, but he carries his shoulders like he cares too much. He also smells like the outside: grass, and pine, and rich black dirt. He’s about to turn the knob.\n\n“Wait!”\n\nHe turns around slowly, despite the urgency in my voice.\n\n“What if there’s someone in there?”\n\nHe grins, or maybe it’s a grimace. “Maybe they can tell us what the hell is happening…”\n\nThen we are inside. We stand immobile for a minute, looking around. I cower behind Silas like a wimp. It’s not cold but I’m shivering. Everything is heavy and impressive—the furniture, the air, my book bag, which hangs off my shoulder like dead weight. Silas moves forward. I grab onto the back of his shirt as we skirt through the foyer and into the family room. We move from room to room, stopping to examine the photos on the walls. Two smiling, sun-kissed parents with their arms around two smiling, dark-haired boys, the ocean in the background.\n\n“You have a little brother,” I say. “Did you know you have a little brother?”\n\nHe shakes his head, no. The smiling in the photos becomes more scarce as Silas and his mini-me brother get older. There is plenty of acne and braces, photos of parents who are trying too hard to be cheerful as they pull stiff-shouldered boys toward them. We move to the bedrooms…the bathrooms. We pick up books, read the labels on brown prescription bottles we find in medicine cabinets. His mother keeps dried flowers all over the house; pressed into the books on her nightstand, in her makeup drawer, and lined up on the shelves in their bedroom. I touch each one, whispering their names under my breath. I remember all the names of the flowers. For some reason, this makes me giggle. Silas stops short when he walks into his parents’ bathroom and finds me bent over laughing.\n\n“I’m sorry,” I say. “ I had a moment.”\n\n“What kind of moment?”\n\n“A moment where I realized that I’ve forgotten everything in the world about myself, but I know what a hyacinth is.”\n\nHe nods. “Yeah.” He looks down at his hands, creases forming on his forehead.\n\n“Do you think we should tell someone? Go to a hospital, maybe?”\n\n“Do you think they’d believe us?” I ask. We stare at each other then. And I hold back the urge once again to ask if I’m being pranked. This isn’t a prank. It’s too real.\n\nWe move to his father’s study next, scouring over papers and looking in drawers. There is nothing to tell us why we are like this, nothing out of the ordinary. I keep a close watch on him from the corner of my eye. If this is a prank, he’s a very good actor. Maybe this is an experiment, I think. I’m part of some psychological, government experiment and I’m going to wake up in a lab. Silas watches me too. I see his eyes darting over me, wondering…assessing. We don’t speak much. Just, Look at this. Or, Do you think this is something?\n\nWe are strangers and there are few words between us.\n\nSilas’s room is last. He clutches my hand as we enter and I let him because I’m starting to feel light-headed again. The first thing I see is a photo of us on his desk. I am wearing a costume—a too-short leopard print tutu and black angel wings that spread elegantly behind me. My eyes are lined with thick, glittery lashes. Silas is dressed in all white, with white angel wings. He looks handsome. Good vs. evil, I think. Is that the sort of life game we played? He glances at me and raises his eyebrows.\n\n“Poor costume choice,” I shrug. He cracks a smile and then we move to opposite sides of the room.\n\nI lift my eyes to walls where there are framed photos of people: a homeless man slouched against a wall, holding a blanket around himself; a woman sitting on a bench, crying into her hands. A gypsy, her hand clamped around her own neck as she looks into the camera lens with empty eyes. The photos are morbid. They make me want to turn away, feel ashamed. I don’t understand why anyone would want to take a photo of such morbidly sad things, never mind hang them on their walls to look at everyday.\n\nAnd then I turn and see the expensive camera perched on the desk. It’s in a place of honor, sitting atop a pile of glossy photography books. I look over to where Silas is also studying the photos. An artist. Is this his work? Is he trying to recognize it? No point in asking. I move on, look at his clothes, look in the drawers in the rich mahogany desk.\n\nI’m so tired. I make to sit down in the desk chair, but he’s suddenly animated, beckoning me over.\n\n“Look at this,” he says. I get up slowly and walk to his side. He’s staring down at his unmade bed. His eyes are bright and should I say…shocked? I follow them to his sheets. And then my blood runs cold.\n\n“Oh, my God.”\n\nI toss the comforter out of the way to get a better look at the mess at the foot of the bed. Smears of mud caked into the sheet. Dried. Pieces of it crack and roll away when I pull the sheet taut.\n\n“Is that…” Charlie stops speaking and pulls the corner of the top sheet from my hand, tossing it away to get a better look at the fitted sheet beneath it. “Is that blood?”\n\nI follow her eyes up the sheet, toward the head of the bed. Next to the pillow is a smeared ghost of a handprint. I immediately look down at my hands.\n\nNothing. No traces of blood or mud whatsoever.\n\nI kneel down beside the bed and place my right hand over the handprint left on the mattress. It’s a perfect match. Or imperfect, depending on how you look at it. I glance at Charlie and her eyes drift away, almost as if she doesn’t want to know whether or not the handprint belongs to me. The fact that it’s mine only adds to the questions. We have so many questions piled up at this point, it feels as though the pile is about to collapse and bury us in everything but answers.\n\n“It’s probably my own blood,” I say to her. Or maybe I say it to myself. I try to dismiss whatever thoughts I know are developing in her head. “I could have fallen outside last night.”\n\nI feel like I’m making excuses for someone who isn’t me. I feel like I’m making excuses for a friend of mine. This Silas guy. Someone who definitely isn’t me.\n\n“Where were you last night?”\n\nIt’s not a real question, just something we’re both thinking. I pull at the top sheet and comforter and spread them out over the bed to hide the mess. The evidence. The clues. Whatever it is, I just want to cover it up.\n\n“What does this mean?” she asks, turning to face me. She’s holding a sheet of paper. I walk to her and take it out of her hands. It looks like it’s been folded and unfolded so many times, there’s a small, worn hole forming in the very center of it. The sentence across the page reads, Never stop. Never forget.\n\nI drop the sheet of paper on the desk, wanting it out of my hands. The paper feels like evidence, too. I don’t want to touch it. “I don’t know what it means.”\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 6",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI need water. It’s the only thing I remember the taste of. Maybe because water has no taste.\n\n“Did you write it?” she demands.\n\n“How would I know?” I don’t like the tone in my voice. I sound aggravated. I don’t want her to think I’m aggravated with her.\n\nShe turns and walks swiftly to her backpack. She digs around inside and pulls out a pen, then walks back to me, shoving it in my hand. “Copy it.”\n\nShe’s bossy. I look down at the pen, rolling it between my fingers. I run my thumb across the embossed words printed down the side of it.\n\nWYNWOOD-NASH FINANCIAL GROUP.\n\n“See if your handwriting matches,” she says. She flips the page over to the blank side and pushes it toward me. I catch her eyes, fall into them a little. But then I’m angry.\n\nI hate that she thinks of this stuff first. I hold the pen in my right hand. It doesn’t feel comfortable. I switch the pen to my left hand and it fits better. I’m a leftie.\n\nI write the words from memory, and after she gets a good look at my handwriting, I flip the page back over.\n\nThe handwriting is different. Mine is sharp, concise. The other is loose and uncaring. She takes the pen and rewrites the words.\n\nIt’s a perfect match. We both stare quietly at the paper, unsure if it even means anything. It could mean nothing. It could mean everything. The dirt on my sheets could mean everything. The blood-smeared handprint could mean everything. The fact that we can remember basic things but not people could mean everything. The clothes I’m wearing, the color of her nail polish, the camera on my desk, the photos on the wall, the clock above the door, the half-empty glass of water on the desk. I’m turning, taking it all in. It could all mean everything.\n\nOr it could all mean absolutely nothing.\n\nI don’t know what to catalog in my mind and what to ignore. Maybe if I just fall asleep, I’ll wake up tomorrow and be completely normal again.\n\n“I’m hungry,” she says.\n\nShe’s watching me; strands of hair stand between me and a full view of her face. She’s beautiful, but in a shameful way. One I’m not sure I’m supposed to appreciate. Everything about her is captivating, like the aftermath of a storm. People aren’t supposed to get pleasure out of the destruction Mother Nature is capable of, but we want to stare anyway. Charlie is the devastation left in the wake of a tornado.\n\nHow do I know that?\n\nRight now she looks calculating, staring at me like this. I want to grab my camera and take a picture of her. Something twirls in my stomach like ribbons, and I’m not sure if it’s nerves or hunger or my reaction to the girl standing next to me.\n\n“Let’s go downstairs,” I tell her. I reach for her backpack and hand it to her. I grab the camera from the dresser. “We’ll eat while we search our things.”\n\nShe walks in front of me, pausing at every picture between my room and the bottom of the stairwell. With each picture we pass, she trails her finger over my face, and my face alone. I watch as she quietly tries to figure me out through the series of photographs. I want to tell her she’s wasting her time. Whoever is in those pictures, it isn’t me.\n\nAs soon as we reach the bottom of the stairs, our ears are assaulted by a short burst of a scream. Charlie comes to a sudden halt and I bump into the back of her. The scream belongs to a woman standing in the doorway of the kitchen.\n\nHer eyes are wide, darting from me to Charlie, back and forth.\n\nShe’s clutching her heart, exhaling with relief.\n\nShe’s not from any of the photographs. She’s plump and older, maybe in her sixties. She’s wearing an apron that reads, “I put the ‘hor’ in Hors d’oeuvres.”\n\nHer hair is pulled back, but she brushes away loose, grey strands as she blows out a calming breath. “Jesus, Silas! You scared me half to death!” She spins and heads into the kitchen. “You two better get back to school before your father finds out. I’m not lying for you.”\n\nCharlie is still frozen in front of me, so I place a hand against her lower back and nudge her forward. She glances at me over her shoulder. “Do you know…”\n\nI shake my head, cutting off her question. She’s about to ask me if I know the woman in the kitchen. The answer is no. I don’t know her, I don’t know Charlie, I don’t know the family in the photos.\n\nWhat I do know is the camera in my hands. I look down at it, wondering how I can remember everything there is to know about operating this camera, but I can’t remember how I learned any of those things. I know how to adjust the ISO. I know how to adjust shutter speed to give a waterfall the appearance of a soft stream, or make each individual drop of water stand on its own. This camera has the ability to put the smallest detail in focus, like the curve of Charlie’s hand, or the eyelashes lining her eyes, while everything else about her becomes a blur. I know that I somehow know the ins and outs of this camera better than I know what my own little brother’s voice should sound like.\n\nI wrap the strap around my neck and allow the camera to dangle against my chest as I follow Charlie toward the kitchen. She’s walking with purpose. So far, I’ve concluded that everything she does has a purpose. She wastes nothing. Every step she takes appears to be planned out before she takes it. Every word she says is necessary. Whenever her eyes land on something, she focuses on it with all of her senses, as though her eyes alone could determine how something tastes, smells, sounds and feels. And she only looks at things when there’s a reason for it. Forget the floors, the curtains, the photographs in the hall that don’t have my face in them. She doesn’t waste time on things that aren’t of use to her.\n\nWhich is why I follow her when she walks into the kitchen. I’m not sure what her purpose is right now. It’s either to find out more information from the housekeeper or she’s on the hunt for food.\n\nCharlie claims a seat at the massive bar and pulls out the chair next to her and pats it without looking up at me. I take the seat and set my camera down in front of me. She drops her backpack onto the counter and begins to unzip it. “Ezra, I’m starving. Is there anything to eat?”\n\nMy entire body swivels toward Charlie’s on the stool, but it feels like my stomach is somewhere on the floor beneath me. How does she know her name?\n\nCharlie glances at me with a quick shake of her head. “Calm down,” she hisses. “It’s written right there.” She points at a note—a shopping list—lying in front of us. It’s a pink stationary pad, personalized, with kittens lining the bottom of the page. At the top of the personalized stationary it reads, “Things Ezra needs right meow.”\n\nThe woman closes a cabinet and faces Charlie. “Did you work up an appetite while you were upstairs? Because in case you weren’t aware, they serve lunch at the school you should both be attending right now.”\n\n“You mean right meow,” I say without thinking. Charlie spatters laughter, and then I’m laughing too. And it feels like someone finally let air into the room. Ezra, less amused, rolls her eyes. It makes me wonder if I used to be funny. I also smile, because the fact that she didn’t appear confused by Charlie referring to her as Ezra means Charlie was right.\n\nI reach over and run my hand along the back of Charlie’s neck. She flinches when I touch her, but relaxes almost immediately when she realizes it’s part of our act. We’re in love, Charlie. Remember?\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 7",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\n“Charlie hasn’t been feeling well. I brought her here so she could nap, but she hasn’t eaten today.” I return my attention to Ezra and smile. “Do you have anything to make my girl feel better? Some soup or crackers, maybe?”\n\nEzra’s expression softens when she sees the affection I’m showing Charlie. She grabs a hand towel and tosses it over her shoulder. “I’ll tell you what, Char. How about I make you my grilled cheese specialty? It was your favorite back when you used to visit.”\n\nMy hand stiffens against Charlie’s neck. Back when you used to visit? We both look at each other, more questions clouding our eyes. Charlie nods. “Thank you, Ezra,” she says.\n\nEzra shuts the refrigerator door with her hip and begins dropping items onto the counter. Butter. Mayonnaise. Bread. Cheese. More cheese. Parmesan cheese. She lays a pan on the stove and ignites the flame. “I’ll make you one, too, Silas,” Ezra says. “You must have caught whatever bug Charlie has, because you haven’t spoken to me this much since you hit puberty.” She chuckles after her comment.\n\n“Why don’t I speak to you?”\n\nCharlie nudges my leg and narrows her eyes. I shouldn’t have asked that.\n\nEzra slides the knife into the butter and retrieves a slab of it. She smears it across the bread. “Oh, you know,” she says, shrugging her shoulders. “Little boys grow up. They become men. Housekeepers stop being Aunt Ezra and return to just being housekeepers.” Her voice is sad now.\n\nI grimace, because I don’t like learning about this side of myself. I don’t want Charlie learning about this side of me.\n\nMy eyes fall to the camera in front of me. I power it on. Charlie begins rifling through her backpack, inspecting item after item.\n\n“Uh oh,” she says.\n\nShe’s holding a phone. I lean over her shoulder and look at the screen with her, just as she switches the ringer to the on position. There are seven missed calls and even more texts, all from “Mom.”\n\nShe opens the latest text message, sent just three minutes ago.\n\nYou have three minutes to call me back.\n\nI guess I didn’t think about the ramifications of us ditching school. The ramifications of parents we don’t even remember. “We should go,” I say to her.\n\nWe both stand at the same time. She throws her backpack over her shoulder and I grab my camera.\n\n“Wait,” Ezra says. “The first sandwich is almost done.” She walks to the refrigerator and grabs two cans of Sprite. “This will help with her stomach.” She hands me both sodas and then wraps the grilled cheese in a paper towel. Charlie is already waiting at the front door. Just as I’m about to walk away from Ezra, she squeezes my wrist. I face her again, and her eyes move from Charlie to me. “It’s good to see her back here,” Ezra says softly. “I’ve been worried how everything between both your fathers might have affected the two of you. You’ve loved that girl since before you could walk.”\n\nI stare at her, not sure how to process all the information I just received. “Before I could walk, huh?”\n\nShe smiles like she has one of my secrets. I want it back.\n\n“Silas,” Charlie says.\n\nI shoot a quick smile at Ezra and head for Charlie. As soon as I reach the front door, the shrill ring on her phone startles her and it falls from her hands, straight to the floor. She kneels to pick it up. “It’s her,” she says, standing. “What should I do?”\n\nI open the door and urge her outside by her elbow. Once the door is shut, I face her again. The phone is on its third ring. “You should answer it.”\n\nShe stares at the phone, her fingers gripping tightly around it. She doesn’t answer it, so I reach down and swipe right to answer. She crinkles up her nose and glares at me as she brings it to her ear. “Hello?”\n\nWe begin walking to the car, but I listen quietly at the broken phrases coming through her phone: “You know better,” and “Skip school,” and “How could you?” The words continue to come out of her phone, until we’re both seated in my car with the doors shut. I start the car and the woman’s voice grows quiet for several seconds. Suddenly, the voice is blaring through the speakers of my car. Bluetooth. I remember what Bluetooth is.\n\nI place the drinks and sandwich on the center console and begin to back out of the driveway. Charlie still hasn’t had a chance to respond to her mother, but she rolls her eyes when I look at her.\n\n“Mom,” Charlie says flatly, attempting to interrupt her. “Mom, I’m on my way home. Silas is taking me to my car.”\n\nThere’s a long silence that follows Charlie’s words, and somehow her mother is much more intimidating when words aren’t being yelled through the phone. When she does begin speaking again, her words come out slow and overenunciated. “Please tell me you did not allow that family to buy you a car.”\n\nOur eyes meet and Charlie mouths the word shit. “I…no. No, I meant Silas is bringing me home. Be there in a few minutes.” Charlie fumbles with the phone in her hands, attempting to return to a screen that will allow her to end the call. I press the disconnect button on the steering wheel and end it for her.\n\nShe inhales slowly, turning to face her window. When she exhales, a small circle of fog appears against the window near her mouth. “Silas?” She faces me and arches a brow. “I think my mother may be a bitch.”\n\nI laugh, but offer no reassurance. I agree with her.\n\nWe’re both quiet for several miles. I repeat my brief conversation with Ezra over and over in my head. I’m unable to push the scene out of my head, and she’s not even my parent. I can’t imagine what Charlie must be feeling right now after speaking to her actual mother. I think both of us have had the reassurance in the backs of our minds that once we came in contact with someone as close to us as our own parents, it would trigger our memory. I can tell by Charlie’s reaction that she didn’t recognize a single thing about the woman she spoke to on the phone.\n\n“I don’t have a car,” she says quietly. I look over at her and she’s drawing a cross with her fingertip on the fogged up window. “I’m seventeen. I wonder why I don’t have a car.”\n\nAs soon as she mentions the car, I remember that I’m still driving in the direction of the school, rather than wherever I need to be taking her. “Do you happen to know where you live, Charlie?”\n\nHer eyes swing to mine, and in a split second the confusion on her face is overcome by clarity. It’s fascinating how easily I can read her expressions now in comparison to earlier this morning. Her eyes are like two open books and I suddenly want to devour every page.\n\nShe pulls her wallet from her backpack and reads the address from her driver’s license. “If you pull over we can put it in the GPS,” she says.\n\nI push the navigation button. “These cars are made in London. You don’t have to idle to program an address into the GPS.” I begin to enter her street number and I feel her watching me. I don’t even have to see her eyes to know they’re overflowing with suspicion.\n\nI shake my head before she even asks the question. “No, I don’t know how I knew that.”\n\nOnce the address is entered, I turn the car around and begin to head in the direction of her house. We’re seven miles away. She opens both sodas and tears the sandwich in half, handing me part of it. We drive six miles without speaking. I want to reach over and grab her hand to comfort her. I want to say something reassuring to her. If this were yesterday, I’m sure I would have done that without a second thought. But it’s not yesterday. It’s today, and Charlie and I are complete strangers today.\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 8",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nOn the seventh and final mile, she speaks, but all she says is, “That was a really good grilled cheese. Make sure you tell Ezra I said so.”\n\nI slow down. I drive well below the speed limit until we reach her street, and then I stop as soon as I turn onto the road. She’s staring out her window, taking in each and every house. They’re small. One-story houses, each with a one-car garage. Any one of these houses could fit inside my kitchen and we’d still have room to cook a meal.\n\n“Do you want me to go inside with you?”\n\nShe shakes her head. “You probably shouldn’t. It doesn’t sound like my mother likes you very much.”\n\nShe’s right. I wish I knew what her mother was referring to when she said that family. I wish I knew what Ezra was referring to when she mentioned our fathers.\n\n“I think it’s that one,” she says, pointing to one a few houses down. I let off the gas and roll toward it. It’s by far the nicest one on the street, but only because the yard was recently mowed and the paint on the window frames isn’t peeling off in chunks.\n\nMy car slows and eventually comes to a stop in front of the house. We both stare at it, quietly taking in the vast separation between the lives we live. However, it’s nothing like the separation I feel knowing we’re about to have to split up for the rest of the night. She’s been a good buffer between myself and reality.\n\n“Do me a favor,” I tell her as I put the car in park. “Look for my name in your caller ID. I want to see if I have a phone in here.”\n\nShe nods and begins scrolling through her contacts. She swipes her finger across the screen and brings her phone to her ear, pulling her bottom lip in with her teeth to hide what looks like a smile.\n\nRight when I open my mouth to ask her what just made her smile, a muffled ring comes from the console. I flip it open and reach in until I find the phone. When I look at the screen, I read the contact.\n\nCharlie baby\n\nI guess that answers my question. She must also have a nickname for me. I swipe answer and bring the phone to my ear. “Hey, Charlie baby.”\n\nShe laughs, and it comes at me twice. Once through my phone and again from the seat next to me.\n\n“I’m afraid we might have been a pretty cheesy couple, Silas baby,” she says.\n\n“Seems like it.” I run the pad of my thumb around the steering wheel, waiting for her to speak again. She doesn’t. She’s still staring at the unfamiliar house.\n\n“Call me as soon as you get a chance, okay?”\n\n“I will,” she says.\n\n“You might have kept a journal. Look for anything that could help us.”\n\n“I will,” she says again.\n\nWe’re both still holding our phones to our ears. I’m not sure if she’s hesitating to get out because she’s scared of what she’ll find inside or because she doesn’t want to leave the only other person who understands her situation.\n\n“Do you think you’ll tell anyone?” I ask.\n\nShe pulls the phone from her ear, swiping the end button. “I don’t want anyone to think I’m going crazy.”\n\n“You’re not going crazy,” I say. “Not if it’s happening to both of us.”\n\nHer lips press into a tight, thin line. She gives her head the softest nod, as if it’s made from glass. “Exactly. If I were going through this alone, it would be easy to just say I’m going crazy. But I’m not alone. We’re both experiencing this, which means it’s something else entirely. And that scares me, Silas.”\n\nShe opens the door and steps out. I roll the window down as she closes the door behind her. She folds her arms over the windowsill and forces a smile as she gestures over her shoulder toward the house behind her. “I guess it’s safe to say I won’t have a housekeeper to cook me grilled cheese.”\n\nI force a smile in return. “You know my number. Just call if you need me to come rescue you.”\n\nHer fake smile is swallowed up by a genuine frown. “Like a damsel in distress.” She rolls her eyes. She reaches through the window and grabs her backpack. “Wish me luck, Silas baby.” Her endearment is full of sarcasm, and I kind of hate it.\n\n“Mom?” My voice is weak, a squeak. I clear my throat. “Mom?” I call again.\n\nShe comes careening around the corner and I immediately think of a car without brakes. I retreat two steps until my back is flush against the front door.\n\n“What were you doing with that boy?” she hisses.\n\nI can smell the liquor on her breath.\n\n“I…he brought me home from school.” I wrinkle my nose and breathe through my mouth. She’s all up in my personal space. I reach behind me and grab the doorknob in case I need to make a quick exit. I was hoping to feel something when I saw her. She was my incubating uterus and birthday party thrower for the last seventeen years. I half expected a rush of warmth or memories, some familiarity. I flinch away from the stranger in front of me.\n\n“You skipped school. You were with that boy! Care to explain?”\n\nShe smells like a bar just vomited on her. “I don’t feel like…myself. I asked him to bring me home.” I back up a step. “Why are you drunk in the middle of the day?’\n\nHer eyes splay wide and for a minute I think it’s a real possibility that she might hit me. At the last moment she stumbles back and slides down the wall until she’s sitting on the floor. Tears invade her eyes and I have to look away.\n\nOkay, I wasn’t expecting that.\n\nYelling I can deal with. Crying makes me nervous. Especially when it’s a complete stranger and I don’t know what to say. I creep past her just as she buries her face in her hands and begins to sob hard. I’m not sure if this is normal for her. I hesitate, hovering right where the foyer ends and the living room starts. In the end, I leave her to her tears and decide to find my bedroom. I can’t help her. I don’t even know her.\n\nI want to hide until I figure something out. Like who the hell I am. The house is smaller than I thought. Just past where my mother is crying on the floor, there is a kitchen and a small living room. They sit squat and orderly, filled to the max with furniture that doesn’t look like it belongs. Expensive things in a non-expensive house. There are three doors. The first is open. I peer in and see a plaid bedspread. My parents’ bedroom? I know from the plaid bedspread that it isn’t mine. I like flowers. I open the second of the doors: a bathroom. The third is another bedroom on the left side of the hallway. I step inside. Two beds. I groan. I have a sibling.\n\nI lock the door behind me, and my eyes dart around the shared space. I have a sister. By the looks of her things she is younger than me by at least a few years. I stare at the band posters that adorn her side of the room with distaste. My side is simpler: a twin bed with a dark purple comforter and a framed black and white print that hangs on the wall over the bed. I immediately know it’s something Silas photographed. A broken gate that hangs on its hinges; vines choking their way through the rusted metal prongs—not as dark as the prints in his bedroom, perhaps more suited toward me. There is a stack of books on my nightstand. I reach for one to read the title when my phone pings.\n\nSilas: You okay?\n\nMe: I think my mom is an alcoholic and I have a sister.\n\nHis response comes a few seconds later.\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    },
    {
      "text": "Page 9",
      "content": "PROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nCư dân mạng phát sốt với bản sao đồng hồ Omega giảm 90% 1 ngày\nWatchthuysichinhhang\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nSilas: I don’t know what to say. This is so awkward.\n\nI laugh and set my phone down. I want to dig around, see if I can find anything suspicious. My drawers are neat. I must have OCD. I toss around the socks and underwear to see if I can piss myself off.\n\nThere is nothing in my drawers, nothing in my nightstand. I find a box of condoms stuffed in a purse under my bed. I look for a journal, notes written by friends—there is nothing. I am a sterile human, boring if not for that print above my bed. A print which Silas gave to me, not one I picked out myself.\n\nMy mother is in the kitchen. I can hear her sniffling and making herself something to eat. She’s drunk, I think. Maybe I should ask her some questions and she won’t remember I asked them.\n\n“Hey, er…mom,” I say, coming to stand near her. She pauses in her toast-making to look at me with bleary eyes.\n\n“So, was I being weird last night?”\n\n“Last night?” she repeats.\n\n“Yeah,” I say. “You know…when I came home.”\n\nShe scrapes the knife over the bread until it is smeared with butter.\n\n“You were dirty,” she slurs. “I told you to take a shower.”\n\nI think of the dirt and leaves in Silas’s bed. That means we were probably together.\n\n“What time did I get home? My phone was dead,” I lie.\n\nShe narrows her eyes. “Around ten o’clock.”\n\n“Did I say anything…unusual?”\n\nShe turns away and wanders over to the sink where she bites into her toast and stares down the drain.\n\n“Mom! Pay attention. I need you to answer me.”\n\nWhy does this feel familiar? Me begging, her ignoring.\n\n“No,” she says simply. Then I have a thought: my clothes from last night. Off the kitchen there is a small closet with a stacked washer and dryer inside of it. I open the lid to the washing machine and see a small mound of wet clothes clumped at the bottom. I pull them out. They are definitely my size. I must have thrown them in here last night, tried to wash away the evidence. Evidence of what? I pry the pockets of the jeans open with my fingers and reach inside. There is a wad of paper, clumped in a thick, damp mess. I drop the jeans and carry the wad back to my room. If I try to unfold it, it might fall apart. I decide to set it on the windowsill and wait for it to dry.\n\nI text Silas.\n\nMe: Where are you?\n\nI wait a few minutes and when he doesn’t text back, I try again.\n\nMe: Silas!\n\nI wonder if I always do this; harass him until he answers.\n\nI send five more and then I toss my phone across the room, burying my face in Charlie Wynwood’s pillow to cry. Charlie Wynwood probably never cried. She has no personality from the looks of her bedroom. Her mother is an alcoholic and her sister listens to crappy music. And how do I know that the poster above my sister’s bed compares love to a boom and a clap, but I don’t remember said sister’s name? I wander over to her side of the small bedroom and rummage around in her things.\n\n“Ding, ding, ding!” I say, pulling a pink polka dot journal out from under her pillow.\n\nI settle down on her bed and flip open the cover.\n\nProperty of Janette Elise Wynwood.\n\nDO NOT READ!\n\nI ignore the warning and page to her first entry, titled:\n\nCharlie sucks.\n\nMy sister is the worst person on the planet. I hope she dies.\n\nI close the book and put it back underneath the pillow.\n\n“That went well.”\n\nMy family hates me. What type of human are you when your own family hates you? From across the room my phone tells me that I have a text. I jump up, thinking it’s Silas, suddenly feeling relieved. There are two texts. One is from Amy.\n\nWhere r u?!!\n\nAnd the other is from a guy named Brian.\n\nHey, missed u today. Did you tell him?\n\nHim who? And tell him what?\n\nI set my phone down without answering either of them. I decide to give the journal another try, skipping all the way to Janette’s last entry, which was last night.\n\nTitle: I might need braces but we’re too broke. Charlie had braces.\n\nI run my tongue over my teeth. Yup, they feel pretty straight.\n\nHer teeth are all straight and perfect and I’m going to have a snaggle tooth forever. Mom said she’d see about financing but ever since that thing happened with dad’s company we don’t have money for normal things. I hate taking packed lunch to school. I feel like a kindergartener!\n\nI skip a paragraph in which she details her friend, Payton’s, last period. She’s ranting about her lack of menstruation when her journaling is disturbed by yours truly.\n\nI have to go. Charlie just got home and she’s crying. She hardly ever cries. I hope Silas broke up with her—would serve her right.\n\nSo I was crying when I came home last night? I walk over to the windowsill where the paper from my pocket has somewhat dried. Carefully smoothing it out, I lay it on the desk my sister and I seem to share. Part of the ink has washed away, but it looks like a receipt. I text Silas.\n\nMe: Silas, I need a ride.\n\nI wait again, growing irritated with his delay in response. I am impatient, I think.\n\nMe: There’s a guy named Brian who’s texting me. He’s really flirty. I can ask him for a ride if you’re busy…\n\nMy phone pings a second later.\n\nSilas: Hell no. OMW!\n\nI smile.\n\nIt shouldn’t be a problem slipping out of the house since my mother has passed out on the sofa. I watch her for a moment, studying her sleeping face, trying desperately to remember it. She looks like Charlie, only older. Before I head outside to wait for Silas, I cover her with a blanket and grab a couple of sodas from the barren fridge.\n\n“See ya, Mom,” I say quietly.\n\nI can’t tell if I’m going back to her because I feel protective over her or possessive of her. Either way, I don’t like the idea of her reaching out to someone else. It makes me wonder who this Brian guy is, and why he thinks it’s okay to send her flirty texts when Charlie and I are obviously together.\n\nMy left hand is still clutching my phone when it rings again. There’s no number on the screen. Just the word “Bro.” I slide my finger across it and answer the phone.\n\n“Hello?”\n\n“Where the hell are you?”\n\nIt’s a guy’s voice. A voice that sounds a lot like mine. I look left and right, but nothing is familiar about the intersection I’m passing through. “I’m in my car.”\n\nHe groans. “No shit. You keep missing practice, you’ll be benched.”\n\nYesterday’s Silas probably would have been pissed off about this. Today’s Silas is relieved. “What day is today?”\n\n“Wednesday. Day before tomorrow, day after yesterday. Come get me, practice is over.”\n\nWhy does he not have his own car? I don’t even know this kid and he already feels like an inconvenience. He’s definitely my brother.\n\n“I have to pick up Charlie first,” I tell him.\n\nThere’s a pause. “At her house?”\n\n“Yeah.”\n\nAnother pause. “Do you have a death wish?”\n\nI really hate not knowing what everyone else seems to know. Why would I not be allowed at Charlie’s house?\n\n“Whatever, just hurry up,” he says, right before hanging up.\n\nShe’s standing in the street when I turn the corner. She’s staring at her house. Her hands are resting gently at her sides, and she’s holding two sodas. One in each hand. She’s holding them like weapons, like she wants to throw them at the house in front of her in hopes that they’re actually grenades. I slow the car down and stop several feet from her.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 10",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nShe’s not wearing the same clothes she had on earlier. She’s wearing a long, black skirt that covers her feet. A black scarf is wrapped around her neck, falling over her shoulder. Her shirt is tan and long-sleeved, but she still looks cold. A gust of wind blows and the skirt and scarf move with it, but she remains unaffected. She doesn’t even blink. She’s lost in thought.\n\nI’m lost in her.\n\nWhen I put the car in park, she turns her head, looks at me and then immediately casts her eyes at the ground. She walks toward the passenger door and climbs inside. Her silence seems to be begging for my silence, so I don’t say anything as we head toward the school. After a couple of miles, she relaxes against the seat and props one of her booted feet against the dash. “Where are we going?”\n\n“My brother called. He needs a ride.”\n\nShe nods.\n\n“Apparently I’m in trouble for not showing up to football practice today.” I’m sure she can tell by the lackadaisical tone of my voice that I’m not too concerned about missing practice. Football isn’t really on my list of priorities right now, so being benched is probably the best outcome for everyone.\n\n“You play football,” she says, matter of fact. “I don’t do anything. I’m boring, Silas. My room is boring. I don’t keep a journal. I don’t collect anything. The only thing I have is a picture of a gate, and I didn’t even take the picture. You did. All I have with any personality in my whole room is something you gave me.”\n\n“How do you know the picture is from me?”\n\nShe shrugs and tugs her skirt taut across her knees. “You have a unique style. Kind of like a thumbprint. I could tell it was yours because you only take pictures of things that people are too scared to stare at in real life.”\n\nShe doesn’t like my photographs, I guess.\n\n“So…” I ask, staring straight ahead. “Who’s this Brian guy?”\n\nShe picks up her phone and opens her texts. I’m trying to look over at them, knowing I’m too far away to read them, but I make the effort, anyway. I notice she tilts her phone slightly to the right, shielding it from my view. “I’m not sure,” she says. “I tried to scroll back and see if I could figure out anything from texts, but our messages are confusing. I can’t tell if I was dating him or you.”\n\nMy mouth is dry again. I take one of the drinks she brought with her and pop the top of it. I take a long sip and set it back in the cup holder. “Maybe you were messing around with both of us.” There’s an edge to my voice. I try to soften it. “What do his texts from today say?”\n\nShe locks the phone and turns it face down in her lap, almost as if she’s ashamed to look at it. She doesn’t answer me. I can feel my neck flush, and I recognize the warmth of the jealousy creeping through me like a virus. I don’t like it.\n\n“Text him back,” I say to her. “Tell him you don’t want him to text you anymore and that you want to work it out with me.”\n\nShe cuts her eyes in my direction. “We don’t know our situation,” she says. “What if I didn’t like you? What if we were both ready to break up?”\n\nI look back at the road and grind my teeth together. “I just think it’s better if we stick together until we figure out what happened. You don’t even know who this Brian guy is.”\n\n“I don’t know you, either,” she bites back.\n\nI pull into the parking lot of the school. She’s watching me closely, waiting on my response. I feel like I’m being baited.\n\nI park the car and turn it off. I grip the steering wheel with my right hand and my jaw with my left hand. I squeeze both. “How do we do this?”\n\n“Can you be a little more specific?” she says.\n\nI give my head the slightest shake. I don’t know if she’s even looking at me to notice. “I can’t be specific, because I’m referring to everything. To us, our families, our lives. How do we figure this out, Charlie? And how do we do it without finding things out about each other that are going to piss us off?”\n\nBefore she can answer me, someone exits a gate and begins walking toward us. He looks like me, but younger. Maybe a sophomore. He’s not as big as me yet, but from the looks of him, he’s probably going to pass me in size.\n\n“This should be fun,” she says, watching my little brother approach the car. He walks straight to the back passenger side and swings open the door. He tosses in a backpack, an extra pair of shoes, a gym bag, and finally, himself.\n\nThe door slams.\n\nHe pulls out his phone and begins scrolling through his texts. He’s breathing heavily. His hair is sweaty and matted to his forehead. We have the same hair. When he looks up at me, I see that we also have the same eyes.\n\n“What’s your problem?” he asks.\n\nI don’t respond to him. I turn back around in my seat and glance at Charlie. She has a smirk on her face and she’s texting someone. I almost want to grab her phone and see if she’s texting Brian, but my phone vibrates from her text as soon as she hits send.\n\nCharlie: Do you even know your little brother’s name?\n\nI have absolutely no idea what my own little brother’s name is.\n\n“Shit,” I say.\n\nShe laughs, but her laugh is cut short when she spots something in the parking lot. My gaze follows hers and lands on a guy. He’s stalking toward the car, glaring hard at Charlie.\n\nI recognize him. He’s the guy from the bathroom this morning. The one who tried to provoke me.\n\n“Let me guess,” I say. “Brian?”\n\nHe walks straight to the passenger door and opens it. He steps back and crooks his finger at Charlie. He ignores me completely, but he’s about to get to know me really well if he thinks he can summon Charlie this way.\n\n“We need to talk,” he says, his words clipped.\n\nCharlie puts her hand on the door to pull it shut. “Sorry,” she says. “We were just about to leave. I’ll talk to you tomorrow.”\n\nDisbelief registers on his face, but so does a hefty dose of anger. As soon as I see him grab her by the arm and yank her toward him, I’m out of the vehicle and rounding the front of my car. I’m moving so fast, I slip on the gravel and have to grab the hood of the car to prevent myself from falling. Smooth. I rush around the passenger door, prepared to grab the bastard by his throat, but he’s bent over, groaning. His hand is covering his eye. He straightens up and glares at Charlie through his good eye.\n\n“I told you not to touch me,” Charlie says through clenched teeth. She’s standing next to her door, her hand still clenched in a fist.\n\n“You don’t want me to touch you?” he says with a smirk. “That’s a first.”\n\nJust as I begin to lunge toward him, Charlie shoves a hand against my chest. She shoots me a warning look, giving her head the slightest shake. I force a deep, calming breath and step back.\n\nCharlie focuses her attention back on Brian. “That was yesterday, Brian. Today’s a brand new day and I’m leaving with Silas. Got it?” She turns around and climbs back into the passenger seat. I wait until her door is shut and locked before I begin to walk back to the driver’s side.\n\n“She’s cheating on you,” Brian yells after me.\n\nI stop in my tracks.\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 11",
      "content": "PROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nCư dân mạng phát sốt với bản sao đồng hồ Omega giảm 90% 1 ngày\nWatchthuysichinhhang\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI slowly turn and face him. He’s standing upright now, and from the looks of his posture, he’s expecting me to hit him. When I don’t, he continues to provoke me.\n\n“With me,” he adds. “More than once. It’s been going on for over two months now.”\n\nI stare at him, trying to remain calm on the outside, but internally, my hands are wrapped around his throat, squeezing the last drop of oxygen from his lungs.\n\nI glance at Charlie. She’s begging me with her eyes not to do anything stupid. I turn back to face him and somehow, I smile. “That’s nice, Brian. You want a trophy?”\n\nI wish I could bottle up the expression on his face and release it any time I need a good laugh.\n\nOnce I’m back inside the car, I pull out of the parking lot more dramatically than I probably should. When we’re back on the road, heading toward my house, I finally find it in me to look at Charlie. She’s staring right back at me. We keep our eyes locked for a few seconds, gauging one another’s reaction. Right before I’m forced to look back at the road in front of me, I see her smile.\n\nWe both start laughing. She relaxes against her seat and says, “I can’t believe I was cheating on you with that guy. You must have done something that really pissed me off.”\n\nI smile at her. “Nothing short of murder should have made you cheat on me with that guy.”\n\nA throat clears in the backseat, and I immediately glance in the rearview mirror. I forgot all about my brother. He leans forward until he’s positioned between the front and middle seats. He looks at Charlie, and then at me.\n\n“Let me get this straight,” he says. “You two are laughing about this?”\n\nCharlie glances at me out of the corner of her eye. We both stop laughing and Charlie clears her throat. “How long have we been together now, Silas?” she asks.\n\nI pretend to count on my fingers when my brother speaks up. “Four years,” he interjects. “Jesus, what’s gotten into the two of you?”\n\nCharlie leans forward and locks eyes with me. I know exactly what she’s thinking.\n\n“Four years?” I mutter.\n\n“Wow,” Charlie says. “Long time.”\n\nMy brother shakes his head and falls back against his seat. “The two of you are worse than an episode of Jerry Springer.”\n\nJerry Springer is a talk show host. How do I know this? I wonder if Charlie remembers this.\n\n“You remember Jerry Springer?” I ask her.\n\nHer lips are tight, pressed together in contemplation. She nods and turns toward the passenger window.\n\nNone of this makes sense. How can we remember celebrities? People we’ve never met? How do I know that Kanye West married a Kardashian? How do I know that Robin Williams died?\n\nI can remember everyone I’ve never met, but I can’t remember the girl I’ve been in love with for over four years? Uneasiness takes over inside of me, pumping through my veins until it settles in my heart. I spend the next few miles silently naming off all the names and faces of people I remember. Presidents. Actors. Politicians. Musicians. Reality TV stars.\n\nBut I can’t for the life of me remember the name of my little brother, who is climbing out of the backseat right now. I watch him as he makes his way inside our house. I continue to watch the door, long after it closes behind him. I’m staring at my house just like Charlie was staring at hers.\n\n“Are you okay?” Charlie asks.\n\nIt’s as if the sound of her voice is suction, pulling me out of my head at breakneck speed and shoving me back into the moment. The moment where I picture Charlie and Brian and the words he said that I had to pretend didn’t affect me at all. “She’s cheating on you.”\n\nI close my eyes and lean my head against the headrest. “Why do you think it happened?”\n\n“You really do need to learn how to be more specific, Silas.”\n\n“Okay,” I reply, lifting my head and looking directly at her. “Brian. Why do you think you slept with him?”\n\nShe sighs. “You can’t be mad at me for that.”\n\nI tilt my head and look at her in disbelief. “We were together for four years, Charlie. You can’t blame me for being a little upset.”\n\nShe shakes her head. “They were together for four years. Charlie and Silas. Not the two of us,” she says. “Besides, who’s to say you were an angel? Have you even looked through all your own texts?”\n\nI shake my head. “I’m afraid to now. And don’t do that.”\n\n“Don’t do what?”\n\n“Don’t refer to us in the third person. You are her. And I’m him. Whether we like who we were or not.”\n\nAs soon as I begin to pull out of the driveway, Charlie’s phone rings.\n\n“My sister,” she says right before she answers it with a hello. She listens quietly for several seconds, eyeing me the entire time. “She was drunk when I got home. I’ll be there in a few minutes.” She ends the call. “Back to the school,” she says. “My alcoholic mother was supposed to pick my sister up after her swim practice. Looks like we’re about to meet another sibling.”\n\nI laugh. “I feel like I was a chauffer in my past life.”\n\nCharlie’s expression tightens. “I’ll stop referring to us in the third person if you stop referring to it as a past life. We didn’t die, Silas. We just can’t remember anything.”\n\n“We can remember some things,” I clarify.\n\nI begin to head back in the direction of the school. At least I’ll know my way around with all of this back and forth.\n\n“There was this family in Texas,” she says. “They had a parrot, but he went missing. Four years later, he showed up out of the blue—speaking Spanish.” She laughs. “Why do I remember that pointless story but I can’t remember what I did twelve hours ago?”\n\nI don’t respond, because her question is rhetorical, unlike all the questions in my head.\n\nWhen we pull up to the school again, a spitting image of Charlie is standing by the entrance with her hands crossed tightly over her chest. She climbs into the backseat and sits in the same spot where my brother was just sitting.\n\n“How was your day?” Charlie asks her.\n\n“Shut up,” her sister says.\n\n“Bad, I take it?”\n\n“Shut up,” she says again.\n\nCharlie looks at me wide-eyed, but with a mischievous grin on her face.\n\n“Were you waiting long?”\n\n“Shut up,” her sister says again.\n\nI realize now that Charlie is just instigating her. I smile when she keeps at it.\n\n“Mom was pretty wasted when I got home today.”\n\n“What’s new?” her sister says.\n\nAt least she didn’t say shut up this time.\n\nCharlie fires a couple more questions, but her sister ignores her completely, giving her full attention to the phone in her hands. When we pull into Charlie’s driveway, her sister begins to open her door before the car even comes to a stop.\n\n“Tell mom I’ll be late,” Charlie says as her sister climbs out of the car. “And when do you think Dad will be home?”\n\nHer sister pauses. She stares at Charlie with contempt. “Ten to fifteen, according to the judge.” She slams the door.\n\nI wasn’t expecting that, and apparently neither was Charlie. She slowly turns around in her seat until she’s facing forward again. She inhales a slow breath and carefully releases it. “My sister hates me. I live in a dump. My mom’s an alcoholic. My father is in prison. I cheat on you.” She looks at me. “Why the hell are you even dating me?”\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    },
    {
      "text": "Page 12",
      "content": "PROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\n\"Rũ sạch\" lá gan nhiễm độc do bia rượu bằng phương pháp đơn giản\n\nIf I knew her better, I’d hug her. Hold her hand. Something. I don’t know what to do. There’s no protocol on how to console your girlfriend of four years who you just met this morning.\n\n“Well, according to Ezra, I’ve loved you since before I could walk. I guess that’s hard to let go of.”\n\nShe laughs under her breath. “You must have some fierce loyalty, because I’m even beginning to hate me.”\n\nI want to reach over and touch her cheek. Make her look at me. I don’t, though. I put the car in reverse and keep my hands to myself. “Maybe there’s a lot more to you than just your financial status and who your family is.”\n\n“Yeah,” she says. She glances at me and the disappointment is momentarily replaced by a brief smile. “Maybe.”\n\nI smile with her, but we both glance out our respective windows to hide them. Once we’re on the road again, Charlie reaches for the radio. She scrolls through several stations, settling on one that we both immediately begin singing. As soon as the first line of lyrics comes out of our mouths, we both immediately turn and face one another.\n\n“Lyrics,” she says softly. “We remember song lyrics.”\n\nNothing is adding up. At this point, my mind is so exhausted I don’t even feel like attempting to figure it out at the moment. I just want the respite the music provides. Apparently so does she, because she sits quietly beside me for most of the drive. After several minutes pass, I can feel her look at me.\n\n“I hate that I cheated on you.” She immediately turns up the volume on the radio and settles against her seat. She doesn’t want a response from me, but if she did I would tell her it was okay. That I forgive her. Because the girl sitting next to me right now doesn’t seem like she could be the girl who previously betrayed me.\n\nShe never asks where we’re going. I don’t even know where we’re going. I just drive, because driving seems to be the only time my mind settles down. I have no idea how long we drive, but the sun is finally setting when I decide to turn around and head back. We’re both lost in our heads the entire time, which is ironic for two people who have no memories.\n\n“We need to go through our phones,” I say to her. It’s the first thing spoken between us in over an hour. “Check old text messages, emails, voicemail. We might find something that could explain this.”\n\nShe pulls her phone out. “I tried that earlier, but I don’t have a fancy phone like yours. I only get text messages, but I barely have any.”\n\nI pull the car over at a gas station and park off to the side where it’s darker. I don’t know why I feel like we need privacy to do this. I just don’t want anyone approaching if they recognize us, because chances are, we won’t know them in return.\n\nI turn off the car and we both begin scrolling through our phones. I start with text messages between the two of us first. I scroll through several, but they’re all short and to the point. Schedules, times to meet up. I love you’s and miss you’s. Nothing revealing anything at all about our relationship.\n\nBased on my call log, we talk for at least an hour almost every night. I go through all the calls stored in my phone, which is well over two weeks’ worth.\n\n“We talked on the phone for at least an hour every night,” I tell her.\n\n“Really?” she says, genuinely shocked. “What in the world could we have talked about for an hour every night?”\n\nI grin. “Maybe we don’t actually do a whole lot of talking.”\n\nShe shakes her head with a quiet laugh. “Why do your sex jokes not surprise me, even though I remember absolutely nothing about you?”\n\nHer half-laugh turns into a groan. “Oh, God,” she says, tilting her phone toward me. “Look at this.” She scrolls through her phone’s camera roll with her finger. “Selfies. Nothing but selfies, Silas. I even took bathroom selfies.” She exits out of her camera app. “Kill me now.”\n\nI laugh and open the camera on my own phone. The first picture is of the two of us. We’re standing in front of a lake, taking a selfie, naturally. I show her and she groans even louder, dropping her head dramatically against the headrest. “I’m starting to not like who we are, Silas. You’re a rich kid who’s a dick to your housekeeper. I’m a mean teenager with absolutely no personality who takes selfies to make herself feel important.”\n\n“I’m sure we aren’t as bad as we seem. At least we appear to like each other.”\n\nShe laughs under her breath. “I was cheating on you. Apparently we weren’t that happy.”\n\nI open the email on my phone and find a video file labeled, “Do not delete.” I click on it.\n\n“Check this out.” I lift the armrest and scoot closer to her so she can see the video. I turn the car stereo up so the sound can be heard through Bluetooth. She lifts her armrest and scoots closer to get a better look.\n\nI hit play. My voice comes through the speakers of my car, making it apparent that I’m the one holding the camera in the video. It’s dark, and it looks like I’m outside.\n\n“It’s officially our two year anniversary.” My voice is hushed, like I don’t want to be caught doing whatever it is I’m doing. I turn the camera on myself and the light from the recorder is on, illuminating my face. I look younger, maybe by a year or two. I’m guessing I was sixteen based on the fact that I just said it was our two-year anniversary. I look like I’m sneaking up to a window.\n\n“I’m about to wake you up to tell you happy anniversary, but it’s almost one o’clock in the morning on a school night, so I’m filming this in case your father murders me.”\n\nI turn the camera back around and face it toward a window. The camera goes dark, but we can hear the window being raised and the sound of me struggling to climb inside. Once I’m inside the room, I shine the camera toward Charlie’s bed. There’s a lump under the covers, but she doesn’t move. I move the camera around the rest of the room. The first thing I notice is that the room on the camera doesn’t look like it would be a room in the house Charlie lives in now.\n\n“That’s not my bedroom,” Charlie says, looking closer at the video playing on my phone. “My room now isn’t even half that size. And I share with my little sister.”\n\nThe room on the video definitely doesn’t look like a shared room, but we don’t get a good enough look because the camera points back at the bed. The lump under the covers moves and from the angle of the camera, it looks as though I’m crawling onto the bed.\n\n“Charlie baby,” I whisper to her. She pulls the covers over her head but shields her eyes from the light of the camera.\n\n“Silas?” she whispers. The camera is still pointed at her from an awkward angle, as if I forgot I was even holding it. There are kissing sounds. I must be kissing up her arm or neck.\n\nJust the sound alone of my lips touching her skin is enough reason to turn off the video. I don’t want to make this awkward for Charlie, but she’s focused on my phone with as much intensity as I am. And not because of what’s happening between us on the video, but because we don’t remember it. It’s me…it’s her…it’s us together. But I don’t remember a single thing about this encounter, so it feels like we’re watching two complete strangers share an intimate moment.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 13",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI feel like a voyeur.\n\n“Happy anniversary,” I whisper to her. The camera pulls away and it looks like I move it to the pillow beside her head. The only view we have now is the profile of Charlie’s face as her head rests against her pillow.\n\nIt’s not the best view, but it’s enough to see that she looks exactly the same. Her dark hair is splayed out across the pillow. She’s looking up and I assume I’m hovering over her, but I can’t see myself in the video. I just see her mouth as it curls up into a smile.\n\n“You’re such a rebel,” she whispers. “I can’t believe you snuck in to tell me that.”\n\n“I didn’t sneak in to tell you that,” I whisper quietly. “I snuck in to do this.”\n\nMy face finally appears in the video, and my lips rest softly against hers.\n\nCharlie shifts in her seat next to me. I swallow the lump in my throat. I suddenly wish I were alone right now, watching this. I’d be replaying this kiss over and over and over.\n\nMy nerves are tight, and I realize it’s because I’m jealous of the guy in the video, which makes absolutely no sense. It feels like I’m watching a complete stranger make out with her, even though it’s me. Those are my lips against hers, but it’s pissing me off because I don’t remember what that feels like.\n\nI debate whether or not to stop the video, especially because the kiss that’s happening right now looks like it’s turning into more than just a simple kiss. My hand, which was resting against her cheek, is now out of view. From the sounds coming out of Charlie’s mouth in the video, it seems like she knows exactly where my hand is.\n\nShe pulls her mouth from mine and glances into the camera, just as her hand appears in front of the lens, knocking the camera face down onto the bed. The screen goes black, but the sound is still recording.\n\n“The light was blinding me,” she murmurs.\n\nMy finger is right next to the pause button on my phone. I should press pause, but I can feel the warmth of her breath escaping her mouth, flirting with the skin on my neck. Between that and the sounds coming from my speakers, I never want the video to end.\n\n“Silas,” she whispers.\n\nWe’re both still staring at the screen, even though it’s been pitch black since she knocked the camera over. There’s nothing to see, but we can’t look away. The sounds of our voices are playing all around us, filling the car, filling us.\n\n“Never never, Charlie,” I whisper.\n\nA moan.\n\n“Never never,” she whispers in response.\n\nA gasp.\n\nAnother moan.\n\nRustling.\n\nThe sound of a zipper.\n\n“I love you so much, Charlie.”\n\nSounds of bodies shifting on the bed.\n\nHeavy breaths. Lots of them. They’re coming from the speakers surrounding us and also from our mouths as we sit here and listen to this.\n\n“Oh, God…Silas.”\n\nTwo sharp intakes of breath.\n\nDesperate kissing.\n\nA horn blaring, swallowing up the sounds coming from my speakers.\n\nI fumble with the phone and it falls to the floorboard. Headlights are shining into my car. Fists are suddenly beating on Charlie’s window and before I can retrieve the phone from the floorboard, her door is being jerked open.\n\n“You feel incredible, Charlie,” my voice barrels through the speakers.\n\nLoud bursts of laughter escape the mouth of the girl who is now holding open Charlie’s door. She sat with us at lunch today, but I can’t remember her name.\n\n“Oh, my God!” she says, shoving Charlie in the shoulder. “Are you guys watching a sex tape?” She turns around and yells at the car whose headlights are still shining through the windows. “Char and Si are watching a sex tape!” She’s still laughing when I finally have the phone back in my hands and press pause. I turn the volume down on the car radio. Charlie looks from the girl to me, wide-eyed.\n\n“We were just leaving,” I say to the girl. “Charlie has to get home.”\n\nThe girl laughs with a shake of her head. “Oh, please,” she says, looking at Charlie. “Your mom is probably so drunk she thinks you’re in bed right now. Follow us, we’re headed out to Andrew’s.”\n\nCharlie smiles with a shake of her head. “I can’t, Annika. I’ll see you at school tomorrow, okay?” Annika looks overly offended. She scoffs when Charlie continues to pull the door shut, despite her being in the way. The girl steps aside and Charlie slams her door and locks it.\n\n“Drive,” she says.\n\nI do. Gladly.\n\nWe’re about a mile away from the gas station when Charlie clears her throat. It doesn’t help her voice because it still comes out in a raspy whisper. “You should probably delete that video.”\n\nI don’t like her suggestion. I was already planning on replaying it tonight when I get home. “There could be a clue in it,” I say to her. “I think I should watch it again. Listen to how it ends.”\n\nShe smiles, just as my phone indicates an incoming text. I flip it over and see a notification at the top of the screen from “Father.” I open my text messages.\n\nFather: Come home. Alone, please.\n\nI show the text to Charlie and she just nods. “You can drop me off at home.”\n\nThe rest of the ride is slightly uncomfortable. I feel like the video we just watched together has somehow made us see one another in a different light. Not necessarily a bad one, just a different one. Before, when I looked at her, she was just the girl who was experiencing this weird phenomenon with me. Now when I look at her, she’s the girl I supposedly make love to. The girl I’ve apparently made love to for a while. The girl I apparently still love. I just wish I could remember what it’s supposed to feel like.\n\nAfter seeing the obvious connection we once had, it only further confuses me that she was involved with that Brian guy. Thinking about him now fills me with a whole lot more anger and jealousy than it did before seeing us together in that video.\n\nWhen we pull into her driveway and stop, she doesn’t immediately get out. She stares up at the dark house in front of us. There’s a faint light on in a front window, but no sign of movement anywhere inside the house.\n\n“I’ll try to talk to my sister tonight. Maybe get more of an idea about what happened last night when I came home.”\n\n“That’s probably a good idea,” I tell her. “I’ll do the same with my brother. Maybe figure out what his name is while I’m at it.”\n\nShe laughs.\n\n“Want me to pick you up for school tomorrow?”\n\nShe nods. “If you don’t mind.”\n\n“I don’t.”\n\nIt’s quiet again. The silence reminds me of the soft sounds that were escaping her in the video that’s still on my phone, thank God. I’ll be hearing her voice in my head all night. I’m kind of looking forward to it, actually.\n\n“You know,” she says, tapping the door with her fingers. “We could wake up tomorrow and be perfectly fine. We might even forget today happened and everything will be back to normal.”\n\nWe can hope for it, but my instincts lead me to believe that won’t happen. We’re going to wake up tomorrow just as confused as we are right now.\n\n“I’d bet against it,” I say. “I’ll go through the rest of my emails and messages tonight. You should do the same.”\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    },
    {
      "text": "Page 14",
      "content": "PROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nCư dân mạng phát sốt với bản sao đồng hồ Omega giảm 90% 1 ngày\nWatchthuysichinhhang\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nShe nods again, finally turning her head to make direct eye contact with me. “Goodnight, Silas.”\n\n“Goodnight, Charlie. Call me if you…”\n\n“I’ll be fine,” she says quickly, cutting me off. “See you in the morning.” She exits the car and begins walking toward her house. I want to yell after her, tell her to wait. I want to know if she’s wondering the same thing I’m wondering: What does Never Never mean?\n\nI think if you cheat, it should be with someone worthy of your sin. I’m not sure if this is old Charlie’s thoughts or new Charlie’s thoughts. Or maybe, because I’m observing Charlie Wynwood’s life as an outsider, I’m able to think of her cheating with detachment rather than judgment. All I know is if you’re going to cheat on Silas Nash it had better be with Ryan Gosling.\n\nI turn back to look at him before he drives away and catch a glimpse of his profile, the dim streetlamp behind the car illuminating his face. The bridge of his nose isn’t smooth. At school, the other boys had pretty noses, or noses that were still too big for their faces. Or worse, noses pocked with acne. Silas has a grown-up nose. It makes you take him more seriously.\n\nI turn back to the house. My stomach feels oily. No one is around when I open the door and peer inside. I feel like I’m an intruder breaking into somebody’s house.\n\n“Hello?” I say. “Anyone here?” I close the door quietly behind me and tiptoe into the living room.\n\nI jump.\n\nCharlie’s mother is on the couch watching Seinfeld on mute, and eating pinto beans straight from the can. I’m suddenly reminded that all I’ve eaten today is the grilled cheese I split with Silas.\n\n“Are you hungry?” I ask her tentatively. I don’t know if she’s still mad at me or if she’s going to cry again. “Do you want me to make us something to eat?”\n\nShe leans forward without looking at me and slides her beans onto the coffee table. I take a step toward her and force out the word, “Mom?”\n\n“She’s not going to answer you.”\n\nI spin around to see Janette stroll into the kitchen, a bag of Doritos in her hand.\n\n“Is that what you ate for dinner?”\n\nShe shrugs.\n\n“What are you, like fourteen?”\n\n“What are you, like brain-dead?” she shoots back. And then, “Yes, I’m fourteen.”\n\nI grab the Doritos from her hand and carry them over to where drunken mommy is staring at the TV screen. “Fourteen-year-old girls can’t eat chips for dinner,” I say, dropping the bag on her lap. “Sober up and be a mom.”\n\nNo response.\n\nI stalk over to the fridge, but all that’s inside it is a dozen cans of Diet Coke and a jar of pickles. “Get your jacket, Janette,” I say, glaring at the mother. “Let’s get you some dinner.”\n\nJanette looks at me like I’m speaking Mandarin. I figure I need to throw something mean in there just to keep up appearances. “Hurry up, you little turd!”\n\nShe scampers back to our room while I search the house for car keys. What type of life was I living? And who was that creature on the couch? Surely she hadn’t always been that way. I glance at the back of her head and feel a spurt of sympathy. Her husband—my father—is in prison. Prison! That’s a big deal. Where are we even getting money to live?\n\nSpeaking of money, I check my wallet. The twenty-eight dollars is still there. That should be enough to buy us something other than Doritos.\n\nJanette comes out of the bedroom wearing a green jacket just as I find the keys. Green is a good color on her—makes her look less angsty teen.\n\n“Ready?” I ask.\n\nShe rolls her eyes.\n\n“Okay then, mommy dearest. Going to get some grub!” I call out before I close the door—mostly to see if she’ll try to stop me. I let Janette lead the way into the garage, anticipating what kind of car we drive. It isn’t going to be a Land Rover, that’s for sure.\n\n“Oh, boy,” I say. “Does this thing work?” She ignores me, popping her earbuds in as I eye the car. It’s a really old Oldsmobile. Older than me. It smells of cigarette smoke and old people. Janette climbs into the passenger side wordlessly and stares out the window. “Okay then, Chatty Cathy,” I say. “Let’s see how many blocks we can go before this thing breaks down.”\n\nI have a plan. The receipt I found is dated last Friday and is from The Electric Crush Diner in the French Quarter. Except this piece of crap car doesn’t have GPS. I’ll have to find it on my own.\n\nJanette is quiet as we pull out of the driveway. She traces patterns on the window with her fingertip, fogging and re-fogging the glass with her breath. I watch her out of the corner of my eye; poor kid. Her mom’s an alcoholic and her dad is in prison—kind of sad. She also hates me. That pretty much leaves her alone in the world. I realize with surprise that Charlie is in the same situation. Except maybe she has Silas—or did have Silas before she cheated on him with Brian. Ugh. I shake my shoulders to get rid of all my feels. I hate these people. They’re so annoying. Except I kind of like Silas.\n\nKind of.\n\nThe Electric Crush Diner is on North Rampart Street. I find a parking spot on a crowded corner and have to parallel park between a truck and a MINI Cooper. Charlie is an excellent parallel parker, I think proudly. Janette climbs out after me and stands on the sidewalk, looking lost. The diner is across the street. I try to peer in through the windows, but they’re mostly blacked out. The Electric Crush flashes in pink neon over the front door.\n\n“Come on,” I say. I hold out my hand to her and she draws back. “Janette! Let’s go!” I march up to her in what can only be an aggressive Charlie move, and grab her hand. She tries to pull away from me, but I hold on tight, dragging her across the street. “Let. Me. Go!”\n\nAs soon as we reach the other side, I spin around to face her. “What’s your problem? Stop acting like a…,” fourteen-year-old, I finish in my head.\n\n“What?” she says. “And why do you even care what I act like?” Her bottom lip is puffing out like she’s about to cry. I suddenly feel very sorry for being so rough with her. She’s just a little kid with tiny boobs and a hormone-addled brain.\n\n“You’re my sister,” I say gently. “It’s time we stick together, don’t you think?” For a minute, I think she’s going to say something—maybe something soft and nice and sisterly—but then she stomps toward the diner ahead of me and flings open the door. Damn. She’s a tough cookie. I follow her in—a little sheepishly—and stop dead in my tracks.\n\nIt’s not what I thought it was going to be. It’s not really a diner—more like a club with booths lining the walls. In the middle of the room is what looks like a dance floor. Janette is standing near the bar, looking around in bewilderment.\n\n“You come here often?” she asks me.\n\nI look from the black leather booths to the black marble floors. Everything is black aside from the bright pink signs on the walls. It’s morbid and bubblegum.\n\n“Help you?” A man steps out from a door at the far end of the bar, carrying an armful of boxes. He’s young—maybe early twenties. I like him on sight because he’s wearing a black vest over a pink t-shirt. Charlie must like pink.\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 15",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\n“We’re hungry,” I blurt.\n\nHe half smiles and nods over to a booth. “Kitchen doesn’t usually open for another hour, but I’ll see what he can whip up for you if you’d like to sit.”\n\nI nod and beeline over to the booth, pulling Janette along with me.\n\n“I was here,” I tell her. “Last weekend.”\n\n“Oh,” is all she says before studying her fingernails.\n\nA few minutes later, the pink t-shirt guy comes out of the back, whistling. He walks over and places two hands on the table.\n\n“Charlie, right?” he asks. I nod dumbly. How does he…? How many times have I…?\n\n“The kitchen was making me a roast chicken. What do you say I share it with you guys? We won’t get busy for a couple more hours, anyway.”\n\nI nod again.\n\n“Good.” He hits the table with his palm and Janette jumps. He points to her. “Coke? Sprite? Shirley Temple?”\n\nShe rolls her eyes. “Diet Coke,” she says.\n\n“And you, Charlie?”\n\nI don’t like the way he says my name. It’s too…familiar. “Coke,” I say quickly. When he leaves, Janette leans forward, her eyebrows drawn together. “You always get diet,” she says accusatorily.\n\n“Yeah? Well I’m not quite feeling like myself.”\n\nShe makes a little noise in the back of her throat. “No kidding,” she says. I ignore her and try to get a good look around. What were Silas and I doing here? Is it a place we came often? I lick my lips.\n\n“Janette,” I say. “Have I ever told you about this place?”\n\nShe looks surprised. “You mean all the times we have heart-to-hearts when we put the lights out at night?”\n\n“Okay, okay, I get it. I’m a really crappy sister. Geez. Get over it already. I’m extending the olive branch here.”\n\nJanette scrunches up her nose. “What’s that mean?”\n\nI sigh. “I’m trying to make it up to you. Start fresh.”\n\nJust then the pink t-shirt dude brings us our drinks. He brought Janette a Shirley Temple even though she asked for a diet coke. Her face registers disappointment.\n\n“She wanted a diet coke,” I say.\n\n“She’ll like that,” he says. “When I was a kid…”\n\n“Just get her a diet coke.”\n\nHe holds up his hands in surrender. “Sure thing, princess.”\n\nJanette glances at me from under her eyelashes. “Thanks,” she says.\n\n“No problem,” I say. “You can’t trust a guy who wears a pink shirt.” She sort of smirks and I feel triumphant. I can’t believe I thought I liked that guy. I can’t believe I liked Brian. What the hell was wrong with me?\n\nI pick up my phone and see that Silas has texted me multiple times. Silas. I like Silas. Something about his soothing voice and good boy manners. And his nose—he has a wicked cool nose.\n\nSilas: My dad…\n\nSilas: Where are you?\n\nSilas: Hello?\n\nThe guy comes back with the chicken and a plate of mashed potatoes. It’s a lot of food.\n\n“What’s your name again?” I ask.\n\n“You’re such a bitch, Charlie,” He says, laying a plate down in front of me. He glances at Janette. “Sorry,” he says.\n\nShe shrugs. “What is your name?” she asks through a mouthful of food.\n\n“Dover. That’s what my friends call me.”\n\nI nod. Dover.\n\n“So last weekend…,” I say.\n\nDover bites. “Yeah, that was crazy. I didn’t expect to see you back here this soon.”\n\n“Why not?” I ask. I’m trying to be casual, but my insides are jumping around like they’re being shocked.\n\n“Well, your man was pretty pissed. I thought he was going to blow his shit before he got kicked out.”\n\n“Blow his shit…?” I change my tone so it’s not so much a question. “Blow his shit. Yeah. That was…”\n\n“You looked pretty pissed,” Dover says. “I can’t blame you. You might have liked it here if Silas hadn’t ruined it for you.”\n\nI sit back, the chicken suddenly unappealing. “Yeah,” I say, glancing at Janette, who is watching us both curiously.\n\n“You finished, brat?” I ask her. She nods, wiping her greasy fingers on a napkin. I pull a twenty out of my purse and drop it on the table.\n\n“No need,” Dover says, waving it away.\n\nI lean down till we are eye to eye. “Only my boyfriend gets to buy me dinner,” I say, leaving the money on the table. I walk to the door, Janette trailing behind me.\n\n“Yeah, well,” Dover calls, “you live by that rule, you can eat for free seven days a week!”\n\nI don’t stop until I reach the car. Something happened in there. Something that made Silas almost lose his shit. I start the car and Janette lets out a loud burp. We both start laughing at the same time.\n\n“No more Doritos for dinner,” I tell her. “We can learn to cook.”\n\n“Sure,” she shrugs.\n\nEveryone breaks their promises to Janette. She’s got that bitter air about her. We don’t speak for the rest of the ride home, and when I pull into the garage, she jumps out before I’ve turned off the engine.\n\n“Nice spending time with you, too,” I call after her. I imagine that when I walk in, Charlie’s mother will be waiting for her—perhaps to chew her out for taking the car—but when I step into the house, everything is dark except for the light underneath the door to Janette’s and my bedroom. Mother has gone to sleep. Mother doesn’t care. It’s perfect for the situation I’m in. I get to snoop around and try to figure out what happened to me without the questions and rules, but I can’t help thinking about Janette—about how she’s just a little kid who needs her parents. Everything is so screwed up.\n\nJanette is listening to music when I open the door.\n\n“Hey,” I say. I suddenly have an idea. “Have you seen my iPod?” Music tells a lot about a person. I don’t have to have a memory to know that.\n\n“I don’t know,” she shrugs. “Maybe it’s with all your other crap in the attic.”\n\nMy other crap?\n\nThe attic?\n\nI suddenly feel excited.\n\nMaybe there’s more to me than a bland bedspread and a stack of bad novels. I want to ask her what kind of crap, and why my crap is in the attic instead of in our shared bedroom, but Janette has stuck the buds back in her ears and is working hard to ignore me.\n\nI decide the best route would be to go up to the attic to check things out for myself. Now, where is the attic?\n\nThe front door to my house opens as I’m putting my car in park, and Ezra walks outside, wringing her hands together nervously. I get out of the car and walk to where she’s standing, wide-eyed.\n\n“Silas,” she says, her voice quivering. “I thought he knew. I wouldn’t have mentioned Charlie was here, but you didn’t seem to be hiding it, so I thought things had changed and she was allowed over here...”\n\nI hold up my hand to stop her from more unnecessary apologies. “It’s fine, Ezra. Really.”\n\nShe sighs and runs her hand across the apron she’s still wearing. I don’t understand her nervousness, or why she anticipated I would be angry with her. I shove more reassurance into my smile than is probably necessary, but she looks as if she needs it.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 16",
      "content": "PROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nCư dân mạng phát sốt với bản sao đồng hồ Omega giảm 90% 1 ngày\nWatchthuysichinhhang\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nShe nods and follows me inside the house. I pause in the foyer, not quite familiar enough with the house to know where my father would be at the moment. Ezra passes me, muttering a “goodnight,” and heads up the stairs. She must live here.\n\n“Silas.”\n\nIt sounds like my voice, but more worn. I turn and am suddenly face to face with the man in all the family photos lining the walls. He’s missing the brilliantly fake smile, though.\n\nHe eyes me up and down, as if the mere sight of his son disappoints him.\n\nHe turns and walks through a door leading out of the foyer. His silence and the assurance in his steps demand I follow him, so I do. We walk into his study, and he slowly edges around his desk and takes a seat. He leans forward and folds his arms over the mahogany wood. “Care to explain?”\n\nI’m tempted to explain. I really am. I want to tell him that I have no idea who he is, no idea why he’s angry, no idea who I am.\n\nI should probably be nervous or intimidated by him. I’m sure yesterday’s Silas would have been, but it’s hard to feel intimidated by someone I don’t know at all. As far as I’m concerned, he has no power over me, and power is the primary ingredient of intimidation.\n\n“Care to explain what?” I ask.\n\nMy eyes move to a shelf of books on the wall behind him. They look like classics. Collectibles. I wonder if he’s read any of the books or if they’re just more ingredients for his intimidation.\n\n“Silas!” His voice is so deep and sharp; it feels like the tip of a knife piercing my ears. I press my hand against the side of my neck and squeeze before looking at him again. He eyes the chair across from him, silently commanding me to sit down.\n\nI get the feeling yesterday’s Silas would be saying, “Yes, sir,” right about now.\n\nToday’s Silas smiles and walks slowly to his seat.\n\n“Why was she inside this house today?”\n\nHe’s referring to Charlie like she’s poison. He’s referring to her the same way her mother referred to me. I look down at the arm of the chair and pick at a piece of worn leather. “She wasn’t feeling well at school. She needed a ride home, and we took a quick detour.”\n\nThis man…my father…leans back in his chair. He brings a hand up to his jaw and rubs it.\n\nFive seconds pass.\n\nTen seconds pass.\n\nFifteen.\n\nHe finally leans forward again. “You seeing her again?”\n\nIs this a trick question? Because it feels like one.\n\nIf I say yes, it’ll obviously piss him off. If I say no, it feels like I’ll be letting him win. I don’t know why, but I really don’t want this man to win. He seems like he’s accustomed to winning.\n\n“What if I am?”\n\nHis hand is no longer rubbing his jaw because it’s now moving across the desk, fisting into the collar of my shirt. He yanks me toward him just as my hands grip the edges of the desk for resistance. We’re eye to eye now, and I expect he’s about to hit me. I wonder if this type of interaction with him is common?\n\nInstead of hitting me like I know he wants to, he pushes his fist against my chest and releases me. I fall back into my seat, but only for a second. I push out of my chair and take a few steps back.\n\nI probably should have hit the asshole, but I don’t hate him enough to do that yet. I also don’t like him enough to be affected by his reaction. It does confuse me, though.\n\nHe picks up a paperweight and hurls it across the room, luckily not in my direction. It smashes against a wooden shelf and knocks the contents to the floor. A few books. A picture frame. A rock.\n\nI stand still and watch him pace back and forth, beads of sweat dripping from his forehead. I don’t understand why he could possibly be this upset over the fact that Charlie was here today. Especially since Ezra said we grew up together.\n\nHis palms are now flat against the desk. He’s breathing heavily, nostrils flaring like a raging bull. I expect him to start kicking up dust with his foot any second now. “We had an understanding, Silas. Me and you. I wasn’t going to push you to testify if you swore to me you wouldn’t see that man’s daughter again.” One of his hands flail toward a locked cabinet while his other hand runs through what’s left of his thinning hair. “I know you don’t think she took those files from this office, but I know she did! And the only reason I haven’t pursued it further is because you swore to me we wouldn’t have to deal with that family again. And here you are…” He shudders. Literally shudders. “Here you are bringing her to this house like the last twelve months never even happened!” More frustrated hand flailing, twisted facial expressions. “That girl’s father almost ruined this family, Silas! Does that not mean a damn thing to you?”\n\nNot really, I want to say.\n\nI make a mental note to never get this angry. It’s not an attractive look on a Nash.\n\nI search for some sort of emotion that conveys remorse, so that he can see it on my face. It’s hard though, when the only thing I’m experiencing is curiosity.\n\nThe door to the office opens and we both move our attention to whomever is entering.\n\n“Landon, this doesn’t concern you,” my father says, his voice soft. I briefly face my father again, just to make sure the words actually fell from his mouth and not someone else’s. It almost sounds like the voice of a caring father, rather than the monster I just witnessed.\n\nLandon—nice to finally know my little brother’s name—looks at me. “Coach is on the phone for you, Silas.”\n\nI glance back at my father, who now has his back turned to me. I assume that means our conversation is over. I walk toward the door and gladly exit the room, followed closely by Landon.\n\n“Where’s the phone?” I ask him when I reach the stairs. Valid question, though. How am I supposed to know if he called on a cell phone or a landline?\n\nLandon laughs and moves past me. “There’s no phone call. I was just getting you out of there.”\n\nHe continues up the stairs and I watch as he reaches the top and then turns left, disappearing down the hall. He’s a good brother, I think. I make my way to what I assume is his room, and I knock lightly on the door. It’s slightly ajar, so I push it open. “Landon?” I open the door all the way and he’s seated at a desk. He looks over his shoulder briefly and then returns his attention to his computer. “Thanks,” I say, stepping into the room. Do brothers thank each other? Probably not. I should have said something along the lines of, “Took you long enough, asshole.”\n\nLandon turns in his chair and tilts his head. A combination of confusion and admiration plays out in his smile. “I’m not sure what your deal is. You aren’t showing up for practice, and that’s never happened. You act like you don’t give a shit that Charlie has been screwing Brian Finley. And then you have the balls to bring her here? After all the shit Dad and Brett went through?” He shakes his head. “I’m surprised you escaped his office without a bloodbath.”\n\nHe spins back around and leaves me to process everything. I turn and rush toward my bedroom.\n\nBrett Wynwood, Brett Wynwood, Brett Wynwood.\n\nI repeat his name in my head so I’ll know exactly what to search when I get to my computer. Surely I have a computer.\n\nWhen I reach my room, the first thing I do is walk to my dresser. I pick up the pen Charlie handed me earlier today and read the imprint again.\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    },
    {
      "text": "Page 17",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nWYNWOOD-NASH FINANCIAL GROUP.\n\nI search the room until I finally find a laptop stuffed in the drawer of my bedside table. I power it on and enter the password.\n\nI remember the password? Add that to the list of shit that makes no sense.\n\nI type Wynwood-Nash Financial Group into the search engine. I click on the first result and am taken to a page that reads, “Nash Finance,” with the Wynwood noticeably absent. I scroll quickly through the page and discover nothing that helps. Just a bunch of useless company contact information.\n\nI back out of the page and scroll through the rest of the results, reading each of the leading headlines and the articles that follow:\n\nFinance gurus, Clark Nash and Brett Wynwood, co-founders of Wynwood-Nash Financial Group, have been charged with four counts of conspiracy, fraud and illegal trading.\n\nPartners for over twenty years, the two business moguls are now placing the blame on each other, both claiming to have no knowledge of the illegal practices uncovered during a recent investigation.\n\nI read another.\n\nClark Nash cleared of charges. Company co-chair, Brett Wynwood, sentenced to fifteen years for fraud and embezzlement.\n\nI make it to the second page of search results when the battery light begins to flash on the laptop. I open the drawer, but there’s no charger. I look everywhere. Under the bed, in the closet, in my dresser drawers.\n\nThe laptop dies during my search. I begin to use my phone to research, but it’s about to die, too, and the only phone charger I can find plugs into a laptop. I keep looking because I need to know exactly what happened to make these two families hate each other so much.\n\nI lift the mattress, thinking maybe the charger could be stuck behind the bed somehow. I don’t find the charger, but I do find what looks like a notebook. I slide it out from under the mattress and then take a seat on top of the bed. Right when I open it up to the first page, my phone vibrates with an incoming text.\n\nCharlie: How are things with your father?\n\nI want to learn more before deciding what I want to share with her. I ignore the text and open the notebook to find stacks of papers stuffed into a folder. Across the top, the papers all read “Wynwood-Nash Financial Group,” but I don’t understand any of them. I also don’t understand why these were hidden beneath my mattress.\n\nClark Nash’s words from downstairs repeat in my head—I know you don’t think she took those files from this office, Silas, but I know she did.\n\nLooks like he was wrong, but why would I have taken them? What would I have needed with them?\n\nWho was I trying to protect?\n\nMy phone buzzes again with another text.\n\nCharlie: There’s this really neat feature on your phone called, “read receipts.” If you’re going to ignore texts, you should probably turn that off. ;)\n\nAt least she put a winky face.\n\nMe: Not ignoring you. Just tired. We have a lot to figure out tomorrow.\n\nCharlie: Yeah\n\nThat’s all she says. I’m not sure if I should respond to her effortless reply, but I don’t want her to be irritated if I don’t respond.\n\nMe: Goodnight, Charlie baby. ;)\n\nAs soon as I hit send, I want to retract it. I don’t know what I was going for with that reply. Not sarcasm, but definitely not flirtation, either.\n\nI decide to regret it tomorrow. Right now I just need sleep so I can make sure I’m awake enough in the morning to deal with all of this.\n\nI shove the notebook back under the mattress and see a wall charger, so I plug it into my phone. I’m too exhausted to keep searching tonight, so I kick off my shoes. It isn’t until I lie down that I notice Ezra changed my sheets.\n\nAs soon as I turn the lamp off and close my eyes, my phone vibrates.\n\nCharlie: Goodnight, Silas.\n\nHer lack of endearment doesn’t go unnoticed, but for some inexplicable reason, the text still makes me smile. Typical Charlie.\n\nI think.\n\nIt is not a good night.\n\nThe trapdoor to the attic is in the closet I share with my sister. After I text Silas goodnight, I climb the three shelves—which are bursting with fabric—and push upward with my fingertips until it shifts left. I glance back over my shoulder and see that Janette hasn’t looked up from her phone. This must be normal—me climbing into the attic, leaving her behind. I want to ask if she’ll come with me, but it was exhausting just to get her to come to dinner. Another time, I think. I’ll figure out how to fix things between us.\n\nI don’t know why, but as I hoist myself through the hole and into an even smaller space, I picture Silas’s face; the tan, smooth skin. His full lips. How many times had I tasted his mouth and yet I can’t remember a single kiss.\n\nThe air is warm and stuffy. I crawl on my knees to a pile of pillows and press my back to them, straightening my legs out in front of me. There’s a flashlight standing atop a pile of books. I click it on, examining their spines; stories I know, but don’t remember reading. How odd to be made of flesh, balanced on bone, and filled with a soul you’ve never met.\n\nI pick up her books one by one and read the first page of each. I want to know who she is—who I am. When I’ve exhausted the pile, I find a larger book at the bottom, bound in creased red leather. My immediate thought is that I’ve found a journal. My hands shake as I fold open the pages.\n\nNot a journal. A scrapbook. Letters from Silas.\n\nI know this because he signs each one with a sharp S that almost looks like a lightening bolt. And I know I like his handwriting, direct and distinct. Paper-clipped to the top of each note is a photo—presumably one that Silas has taken. I read one note after another, pouring over words. Love letters. Silas is in love.\n\nIt’s beautiful.\n\nHe likes to imagine a life with me. In one letter, written on the back of a brown paper sack, he details the way we will spend Christmas when we have our own place: spiked apple cider by the Christmas tree, raw cookie dough that we eat before we get the chance to bake it. He tells me he wants to make love to me with only candles lighting the room so that he can see my body glow in the candle light. The photo paper clipped to the note is of a tiny Christmas tree that looks like it’s in his bedroom. We must have set it up together.\n\nI find another written on the back of a receipt in which he details what it feels like to be inside of me. My face grows warm as I read the note over and over, reveling in his lust. The photo paper clipped to this one is of my bare shoulder. His photos pack a punch—just like his words. They take my breath, and I’m not sure if the part of me I can’t remember is in love with him. I feel only curiosity toward the dark-haired boy who looks at me so earnestly.\n\nI set the note aside, feeling like I’m snooping on someone else’s life, and close the book. This belonged to Charlie. I’m not her. I fall asleep surrounded by Silas’s words, the sprinkling of letters and sentences swirling around in my head until…\n\nA girl drops to her knees in front of me. “Listen to me,” she whispers. “We don’t have much time…”\n\nBut I don’t listen to her. I push her away and then she’s gone. I am standing outside. There is a fire burning from an old metal trash can. I rub my hands together to get warm. From somewhere behind me I can hear a saxophone playing, but the sound morphs into a scream. That’s when I run. I run through the fire that was in the trash can, but now it is everywhere, licking the buildings along the street.. I run, choking on smoke until I see one pink-faced storefront that is free of flame and smoke, though everything around it burns. It is a shop of curiosities. I open the door without thought because it is the only place safe from the flames. Silas is there waiting for me. He leads me past bones and books and bottles and takes me to a back room. A woman sits on a throne made of broken mirror, staring down at me with a thin smile on her lips. The pieces of mirror reflect slices of light across the walls where they jiggle and dance. I turn to look at Silas, to ask him where we are, but he’s gone. “Hurry!”\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 18",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI wake with a start.\n\nJanette is leaning through the slat of space in the closet roof, shaking my foot. “You have to get up,” she says. “You don’t have any more skip days left.”\n\nI am still in the dank attic space. I wipe the sleep from my eyes and follow her down the three shelves to our room. I’m touched she knows I’m out of skip days, and that she cared enough to wake me up. I’m shaking when I reach the bathroom and turn on the shower. I haven’t shaken the dream. I can still see my reflection in the broken shards of her throne.\n\nThe fire swims in and out of my vision, waiting behind my eyelids every time I blink. If I concentrate, I can smell the ash above the body wash I’m using, above the sickeningly sweet shampoo I pour into my hand. I close my eyes and try to remember Silas’s words…You are warm and wet, and your body grips me like it doesn’t want me to leave.\n\nJanette pounds on the door. “Late!” she yells.\n\nI hurry to dress and we’re tumbling out the front door before I realize I don’t even know how Janette expects we’re getting to school today. I told Silas to pick me up yesterday.\n\n“Amy should be here already,” Janette says. She folds her arms across her chest and peers down the street. It’s like she can’t even stand to look at me. I pull out my phone and text Silas to let him know not to pick me up. I also check to see if this Amy has texted me, right as a little silver Mercedes whips around the corner.\n\n“Amy,” I say. I wonder if she’s one of the girls I sat with at lunch yesterday. I hardly noticed names and faces. The car pulls to the curb and we walk forward. Janette climbs into the backseat without a word, and after a few seconds of deliberation I open the front door. Amy is black. I stare at her in surprise for a minute before I climb in the car.\n\n“Hey,” she says, without looking over. I’m grateful for her distraction because I have a moment to study her.\n\n“Hi.”\n\nShe’s pretty; her hair, which is lighter than her skin, is braided to her waist. She seems at ease with me—not to mention she’s giving my sour sister and me a ride to school. We must be good friends, I decide.\n\n“Glad to see you’re feeling better. Did you figure out what you’re going to do about Silas?” she asks me.\n\n“I…I…er…Silas?”\n\n“Uh huh,” she says. “That’s what I thought. You still don’t know. It’s a shame, too, because you guys can be really good together when you try.”\n\nI sit in silence until we’ve almost reached the school, wondering what she means. “Amy,” I say. “How would you describe my relationship with Silas to someone who has never met us?”\n\n“See, this is your problem,” she says. “You always want to play games.” She pulls up to the front of the school and Janette climbs out. It’s all like clockwork.\n\n“Bye,” I call as the door closes.\n\n“She’s so mean,” I say, facing forward again.\n\nAmy pulls a face. “And you’re queen of nice? Seriously, I don’t know what’s come over you. You’re even more out of it than normal. ”\n\nI chew on my lips as we pull into the high school parking lot. I open the door before the car has even stopped.\n\n“What the hell, Charlie?”\n\nI don’t wait to hear what else she has to say. I run for the school, my arms wrapped tightly around my torso. Did everyone hate me? I duck my head as I push through the doors. I need to find Silas. People are looking at me as I walk the hallway. I don’t look left or right, but I can feel their eyes. When I reach for my phone to text Silas, it’s gone. I ball up my fists. I had my phone when I texted and told him I didn’t need a ride. I must have left it in Amy’s car.\n\nI’m on my way back toward the parking lot when someone calls my name.\n\nBrian.\n\nI glance around to see who’s watching us as he jogs toward me. His eye still looks a little bruised from where I punched him. I like that.\n\n“What?” I say.\n\n“You hit me.” He stops a few feet away like he’s afraid I’m going to do it again. I suddenly feel guilty. I shouldn’t have done that. Whatever game I’d been playing with him before all of this happened wasn’t his fault.\n\n“I’m sorry,” I say. “I haven’t been myself lately. I shouldn’t have done that.”\n\nIt looks like I’ve told him exactly what he wants to hear. His face relaxes and he runs a hand along the back of his neck as he looks at me.\n\n“Can we go somewhere more private to talk?”\n\nI look around at the crowded hallway and shake my head. “No.”\n\n“All right,” he says. “Then we can do this here.” I shift from one foot to another and look over my shoulder. Depending on how long he takes, I can still catch Amy and get the keys to her car and…\n\n“It’s Silas or me.”\n\nMy head jerks back to look at him. “What?”\n\n“I love you, Charlie.”\n\nOh, God. I feel itchy all over. I take a step back, looking around for someone to help me get out of this. “Now is a really bad time for me, Brian. I need to find Amy and—”\n\n“I know you guys have history, but you’ve been unhappy for a long time. That guy’s a dick, Charlie. You saw what happened with the shrimp. I’m surprised—”\n\n“What are you talking about?”\n\nHe looks put out that I’ve interrupted his speech.\n\n“I’m talking about Silas and—”\n\n“No, the shrimp thing.” People are stopping to watch us now. Clusters of nosiness form at lockers; eyes, eyes, eyes on my face. I’m so uncomfortable with this. I hate it.\n\n“Her,” Brian jerks his head left just as a girl pushes through the doors and makes her way past us. When she sees me looking, her face turns a bright pink color, like a shrimp. I recognize her from my class yesterday. She was the one on the floor, picking up the books. She’s tiny. Her hair is an ugly shade of greenish brown, like she tried to dye it herself and it went terribly wrong. But even if she hadn’t dyed it, it looks…sad. Jagged, uneven bangs, oily and lank. She has a smattering of pimples across her forehead and a nose that’s pugged. My first thought is ugly. But it’s more of a fact than a judgment. She skitters away before I can blink, disappearing into a crowd of onlookers. I have a feeling she hasn’t left. She’s waiting right behind their backs—she wants to hear. I felt something…when I saw her face I felt something.\n\nMy head is swimming when Brian reaches for me. I let him grab me by the elbow and pull me toward his chest.\n\n“It’s me or Silas,” he says again. He’s being bold since I already punched him for touching me. But I’m not thinking about him. I’m thinking about the girl, the shrimp, wondering if she’s back there, hiding behind everyone else. “I need an answer, Charlie.” He has me so close that when I look into his face I can see the freckles in his eyes. “Then my answer is Silas,” I say softly.\n\nHe freezes. I can feel the stiffening of his body.\n\n“You gonna show up for practice today?” Landon asks. He’s already standing outside my door and I don’t even remember pulling into the parking lot of the school, much less turning off the car. I nod, but fail to make eye contact with him. I’d been so lost inside my own thoughts during the drive over, I didn’t even think to prod him for information.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 19",
      "content": "PROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nCư dân mạng phát sốt với bản sao đồng hồ Omega giảm 90% 1 ngày\nWatchthuysichinhhang\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI’ve been hung up on the fact that I didn’t wake up with memories. I was hoping Charlie was right—that we would wake up and everything would be back to normal. But we didn’t and it’s not.\n\nOr at least I didn’t wake up with memories. I haven’t spoken to Charlie since last night, and her text this morning revealed nothing.\n\nI didn’t even open the text. It flashed on my lock screen and I read enough of the first sentence to know I didn’t like how it made me feel. My thoughts immediately wandered to who might be picking her up and if she was okay with it.\n\nMy protective instincts kick in whenever it comes to her, and I don’t know if it’s always been that way or if it’s because she’s the only one I can relate to right now.\n\nI get out of the car, determined to find her. Make sure she’s okay, even though I know she more than likely is. I don’t have to know any more about her to know that she doesn’t really need me to take care of her. She’s fiercely independent.\n\nThat doesn’t mean I won’t still try.\n\nWhen I enter the school, it occurs to me that I don’t know where to begin searching for her. Neither of us can remember which lockers are ours, and considering this happened to us both during fourth period yesterday, we have no idea where our first, second or third period classes are.\n\nI decide to walk to the administration office and see about getting a new copy of my schedule. Hopefully Charlie thought to do the same, because I doubt they’ll give me hers.\n\nThe secretary is unfamiliar, but she smiles knowingly at me. “Here to see Ms. Ashley, Silas?”\n\nMs. Ashley.\n\nI start to shake my head no, but she’s already pointing me in the direction of an open office door. Whoever Ms. Ashley is, I must visit her enough that my presence in the office isn’t unusual.\n\nBefore I make it to the open office door, a woman steps out. She’s tall, attractive and appears extremely young to be an employee. Whatever she does here, she hasn’t been doing it long. She barely looks old enough to be out of college.\n\n“Mr. Nash,” she says with a vague smile, flicking her blonde hair back over her shoulder. “Do you have an appointment?”\n\nI pause and stop my advancement toward her. I glance back at the secretary right when Ms. Ashley waves it off. “It’s fine, I have a few minutes. Come inside.”\n\nI move gingerly past her, taking in the nameplate on the door as I enter her office.\n\nAVRIL ASHLEY, GUIDANCE COUNSELOR.\n\nShe closes the door behind me and I look around the office, which is decorated in motivational quotes and typical posters portraying positive messages. I suddenly feel uncomfortable. Trapped. I should have said I didn’t need to see her, but I’m hoping this counselor—one I apparently visited regularly—will know a few things about my past that may be of help to Charlie and me.\n\nI turn, just as Ms. Ashley’s hand slides down the door and reaches the lock. She turns it and then begins to saunter toward me. Her hands meet my chest and right before her mouth connects with mine, I stumble backward and catch myself on a filing cabinet.\n\nWhoa.\n\nWhat the hell?\n\nShe looks offended that I just shook off her advance. This must not be unusual behavior with us.\n\nI’m sleeping with the guidance counselor?\n\nI immediately think of Charlie and, based on our obvious non-commitment to one another, I question what kind of relationship we had. Why were we even together?\n\n“Is something wrong?” Ms. Ashley says.\n\nI turn slightly and take a few steps away from her, toward the window. “Not feeling very well today.” I look her in the eyes and force a smile. “Don’t want to get you sick.”\n\nMy words put her at ease and she closes the space between us again, this time leaning in and pressing her lips against my neck. “Poor thing,” she purrs. “Want me to make you feel better?”\n\nMy eyes are wide, darting around the room, mapping out my escape route. My attention falls to the computer on her desk, and then a printer behind her chair. “Ms. Ashley,” I say, gently pushing her away from my neck.\n\nThis is wrong on so many levels.\n\nShe laughs. “You never call me that when we’re alone. It’s weird.”\n\nShe’s too comfortable with me. I need to get out of here.\n\n“Avril,” I say, smiling at her again. “I need a favor. Can you print a copy of mine and Charlie’s schedules?”\n\nShe immediately straightens up, her smile whisked away at the mention of Charlie’s name. Point of contention, apparently.\n\n“I’m thinking about switching a couple of my classes so I won’t have to be around her as much.” Couldn’t be further from the truth.\n\nMs. Ashley—Avril—slides her fingers down my chest, the smile reappearing on her face. “Well, it’s about time. Finally decided to take the counselor’s advice, I see.”\n\nHer voice drips with sex. I can see how things must have started up with her, but it makes me feel shallow. It makes me hate who I was.\n\nI shift on my feet as she works her way to her seat and begins clicking at her keyboard.\n\nShe pulls freshly printed pages from the printer and walks them over to me. I attempt to take the schedules from her hand, but she pulls them away with a grin. “Uh-uh,” she says, shaking her head slowly. “These are gonna cost you.” She leans against her desk and lays the sheets of paper beside her, face down. She brings her eyes back to mine and I can see I’m not leaving without appeasing her, which is the last thing I want to do right now.\n\nI take two slow steps toward her and rest my hands on either side of her. I lean in to her neck and can hear her gasp when I begin to speak. “Avril, I only have five minutes left before I have to be in class. There’s no way I can do all the things I want to do to you in just five minutes.”\n\nI slip my hand to the schedules lying on her desk and I back away with them. She’s tugging on her bottom lip, staring up at me with heated eyes. “Come back during lunch,” she whispers. “Will an hour be sufficient, Mr. Nash?”\n\nI wink at her. “I guess it’ll have to do,” I say as I head out the door. I don’t pause until I’m down the hallway and around the corner, out of her line of sight.\n\nThe eighteen-year-old irresponsible side of me wants to high five myself for having apparently snagged the school counselor, but the reasonable side of me wants to punch myself for doing something like that to Charlie.\n\nCharlie is obviously the better choice, and I hate knowing that I was putting that relationship at risk.\n\nBut then again, so was Charlie.\n\nLuckily, the schedules list our locker numbers and combinations. Hers is 543 and mine is 544. I’m guessing that was intentional.\n\nI open my locker first, and find three textbooks stacked inside. There’s a half empty coffee in front of the books and an empty Cinnamon roll wrapper. There are two pictures taped to the inside of the locker: one of Charlie and me, the other just of Charlie.\n\nI pull the picture of her down and stare at it. Why, if we weren’t happy together, do I have pictures of her in my locker? Especially this one. I obviously took it, as it’s similar in style to the pictures hanging around my room.\n\nShe’s sitting cross-legged on a couch. Her head is tilted slightly and she’s staring directly at the camera.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 20",
      "content": "PROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\n\"Rũ sạch\" lá gan nhiễm độc do bia rượu bằng phương pháp đơn giản\n\nHer eyes are intense—looking into the camera as if she’s looking into me. She’s both confident and comfortable, and although she isn’t smiling or laughing in the photo, I can tell she’s happy. Whenever this was taken, it was a good day for her. For us. Her eyes are screaming a thousand things in this photo, but the loudest is, “I love you, Silas!”\n\nI stare at it a while longer and then place the photo back inside the locker. I check my phone to see if she’s texted. She hasn’t. I look around, just as Landon approaches from down the hall. He tosses words over his shoulder as he passes me. “Looks like Brian isn’t quite out of the picture yet, brother.”\n\nThe bell rings.\n\nI look in the direction Landon came from and see a heavier crowd of students at that end of the hallway. People seem to be stalling, glancing over their shoulders. Some are looking at me, some are fixated on whatever is at the end of the hallway. I begin to walk in that direction and everyone’s attention falls on me as I pass.\n\nA break in the crowd begins to shape and that’s when I see her. She’s standing against a row of lockers, hugging herself with her arms. Brian is leaning against one of the lockers, looking at her intently. He looks deep in conversation, whereas she just appears guarded. He spots me almost immediately and his posture stiffens along with his expression. Charlie follows his gaze until her eyes land on mine.\n\nAs much as I can assume she doesn’t need rescuing, relief falls over her as soon as we lock eyes. A smile tugs at her lips, and I want nothing more than to get him away from her. I spend two seconds deliberating. Should I threaten him? Should I hit him like I wanted so badly to hit him yesterday in the parking lot? Neither of these actions feels as though they’ll make the point I want to make.\n\n“You should get to class,” I hear her say to him. Her words are quick, a warning, as if she’s afraid I’ve decided to punch him. She doesn’t have to worry. What I’m about to do will hurt Brian Finley a hell of a lot more than if I were to just hit him.\n\nThe second bell rings. No one moves. There are no students rushing to class to avoid being late. No one around me shuffles down the hall at the sound of the bell.\n\nThey’re all waiting. Watching. Expecting me to start a fight. I wonder if that’s what the old Silas would do? I wonder if that’s what the new Silas should do?\n\nI ignore everyone but Charlie and walk confidently toward her, keeping my eyes trained on her the entire time. As soon as Brian sees me approaching, he takes two steps away from her. I look directly at him while I stretch out my hand toward her, giving her the choice to take it and go with me or remain where she is.\n\nI feel her fingers slide between mine and she grips my hand tightly. I pull her away from the lockers, away from Brian, away from the crowd of students. As soon as we round the corner, she drops my hand and stops walking.\n\n“That was a little dramatic, don’t you think?” she says.\n\nI turn to face her. Her eyes are narrowed, but her mouth could pass for smiling. I can’t tell if she’s amused or angry.\n\n“They expected a certain reaction from me. What’d you want me to do, tap him on the shoulder and ask politely if I could cut in?”\n\nShe folds her arms over her chest. “What makes you think I needed you to do anything?”\n\nI don’t understand her hostility. It seemed like we left on good terms last night, so I’m confused as to why she seems so angry with me.\n\nShe rubs her hands up and down her arms and then her eyes fall to the floor. “Sorry,” she mutters. “I just…” She looks up at the ceiling and groans. “I was just prodding him for information. That’s the only reason I was with him in the hallway just now. I wasn’t flirting.”\n\nHer response catches me off guard. I don’t like the look of guilt in her expression. That’s not why I pulled her away from him, but I realize now that she thinks I really am upset with her for being with him. I could tell she didn’t want to be there, but maybe she doesn’t realize how well I’ve learned to read her.\n\nI take a step toward her. When she lifts her eyes to meet mine, I smile. “Would it make you feel better to know I was cheating on you with the guidance counselor?”\n\nShe sucks in a quick rush of air and shock registers on her face.\n\n“You weren’t the only one who wasn’t committed to us, Charlie. Apparently we both had issues we needed to work out, so don’t be so hard on yourself.”\n\nRelief probably isn’t the reaction a girl should have to finding out her boyfriend has been cheating on her, but it’s definitely what Charlie feels right now. I can see it in her eyes and I can hear it in the pent up breath she releases.\n\n“Wow…,” she says, her hands falling to her hips. “So technically, we’re tied?”\n\nTied? I shake my head. “This isn’t a game I want to win, Charlie. If anything, I’d say we both lost.”\n\nHer lips spread into a ghostly grin, and then she looks over her shoulder. “We should figure out where our classes are.”\n\nI remember the schedules and pull hers out of my back pocket. “We’re not together until fourth period History. You have English first. It’s back in the other hallway,” I say, motioning toward her first period classroom.\n\nShe nods appreciatively and unfolds the schedule. “Smart thinking,” she says, glancing it over. She looks back up at me with a wicked smile. “I guess you got these from your guidance counselor mistress?”\n\nHer words make me wince, even though I shouldn’t really feel remorse for whatever happened before yesterday.\n\n“Ex-guidance counselor mistress,” I clarify with a grin. She laughs, and it’s a laugh of solidarity. As screwed up as our situation is, and as confusing as the new information about our relationship is, the fact that we can laugh about it proves that we at least share in the absurdity of it all. And the only thought I have as I walk away from her is how much I wish Brian Finley could choke on her laugh.\n\nThe first three classes of the day felt foreign. No one in them and nothing discussed seemed familiar to me. I felt like an imposter, out of place.\n\nBut the instant I walked into fourth period and took a seat next to Charlie, my mood changed. She’s familiar. My only familiar thing in a world of inconsistency and confusion.\n\nWe stole a few glances at each other, but we never spoke during class. We aren’t even speaking now as we enter the cafeteria together. I glance at our table and everyone from yesterday is already seated, save our two empty seats.\n\nI nudge my head toward the lunch line. “Let’s get our food first.”\n\nShe glances up at me, briefly, before looking back at the table. “I’m not really hungry,” she says. “I’ll just wait for you at the table.” She heads in the direction of our group and I head toward the cafeteria line.\n\nAfter grabbing my tray and a Pepsi, I walk over to the table and take a seat. Charlie is looking down at her phone, excluding herself from the surrounding conversation.\n\nThe guy to my right—Andrew, I think—elbows me. “Silas,” he says, jabbing me repeatedly. “Tell him how much I benched Monday.”\n\nI look up at the guy sitting across from us. He rolls his eyes and downs the rest of his soda before slamming it on the table. “Come on, Andrew. You think I’m stupid enough to believe your best friend wouldn’t lie for you?”\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 21",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nBest friend.\n\nAndrew is my best friend, yet I wasn’t even sure of his name thirty seconds ago.\n\nMy attention moves from the two of them to the food in front of me. I open my soda and take a sip, just as Charlie clenches her waist. It’s loud in the cafeteria, but I still hear the rumble of her stomach. She’s hungry.\n\nIf she’s hungry, why isn’t she eating?\n\n“Charlie?” I lean in close to her. “Why aren’t you eating?” She dismisses my question with a shrug. I lower my voice even more. “Do you have money?”\n\nHer eyes dart up to mine as if I just revealed a huge secret to the entire room. She swallows and then looks away, embarrassed. “No,” she says quietly. “I gave my last few dollars to Janette this morning. I’ll be fine until I get home.”\n\nI set my drink down on the table and push my tray in front of her. “Here. I’ll go get another one.”\n\nI stand and go back to the line and get another tray. When I return to the table, she’s taken a few bites of the food. She doesn’t tell me thank you, and I feel relieved. Making sure she has food to eat isn’t a favor I want to be thanked for. It’s something I hope she would expect from me.\n\n“Do you want a ride home today?” I ask her, just as we’re finishing up our meal.\n\n“Dude, you can’t miss practice again,” Andrew shoots in my direction. “Coach won’t let you play tomorrow night if you do.”\n\nI rub a palm down my face, and then I reach in my pocket and retrieve my keys. “Here,” I tell her, placing them in her hand. “Drive your sister home after school. Pick me up when practice is over.”\n\nShe tries to hand the keys back to me, but I won’t take them. “Keep them,” I tell her. “You might need a car today and I won’t be using it.”\n\nAndrew interrupts. “You’re letting her drive your car? Are you kidding me? You’ve never even let me sit behind the damn wheel!”\n\nI look over at Andrew and shrug. “You aren’t the one I’m in love with.”\n\nCharlie spits out her drink with a burst of laughter. I glance over at her, and her smile is huge. It lights up her entire face, somehow even making the brown of her eyes seem less dark. I may not remember anything about her, but I would bet her smile was my favorite part of her.\n\nThis day has been exhausting. It feels like I’ve been on a stage for hours, acting out scenes I have no script for. The only thing that appeals to me right now is either being in my bed or being with Charlie. Or maybe a combination of both.\n\nHowever, Charlie and I both still have a goal, and that’s to figure out what the hell happened to us yesterday. Despite the fact that neither of us really wanted to bother with school today, we knew school could lead to an answer. After all, this did happen in the middle of the school day yesterday, so the answer could be related somehow.\n\nFootball practice may be of some help. I’ll be around people I haven’t spent much time with in the last twenty-four hours. I might learn something about myself or about Charlie that I didn’t know before. Something that could shed some light on our situation.\n\nI’m relieved to find all the lockers have names on them, so it isn’t hard to locate my gear. What is hard is trying to figure out how to put it on. I struggle with the pants, all the while trying to look like I know what I’m doing. The locker room slowly empties out as all the guys make their way to the field until I’m the only one left.\n\nWhen I think I’ve got everything situated, I grab my jersey off the top shelf of the locker to pull it on over my head. A box catches my eye, located in the back of the top shelf of my locker. I pull it toward me and take a seat on the bench. It’s a red box, much larger than a box that would just contain a piece of jewelry. I pull the lid off and find a few pictures at the very top.\n\nThere aren’t any people in the pictures. They seem to be of places. I flip through them and come to a picture of a swing set. It’s raining, and the ground beneath the swing is covered in water. I flip it over, and written on the back, it says, Our first kiss.\n\nThe next picture is of a backseat, but the view is from the floorboard, looking up. I flip it over. Our first fight.\n\nThird is a picture of what looks like a church, but it’s only the picture of the doors. Where we met.\n\nI flip through all the pictures until finally I get to a letter, folded at the bottom of the box. I pick it up and unfold it. It’s a short letter in my handwriting, addressed to Charlie. I begin to read it, but my phone buzzes, so I reach over and unlock it.\n\nCharlie: What time is your practice over?\n\nMe: Not sure. I found a box of stuff in the locker room. Don’t know if it’ll help, but there’s a letter in it.\n\nCharlie: What does it say?\n\n“Silas!” someone yells from behind me. I spin around and drop two of the pictures in my hands. There’s a man standing at the door with an angry look on his face. “Get on the field!”\n\nI nod and he continues on down the hall. I put the pictures back in the box and set it back inside my locker. I take a deep, calming breath and make my way out to the practice field.\n\nTwo lines are formed on the field, both rows of guys hunched forward and staring at the guy in front of them. There’s an obvious opening, so I jog toward the empty spot and copy what the other players are doing.\n\n“For shit’s sake, Nash! Why are you not wearing your shoulder pads?” Someone yells.\n\nShoulder pads. Crap.\n\nI skip out of line and run back to the locker room. This is going to be the longest hour of my life. It’s odd I can’t remember the rules of football. Can’t be that hard, though. Just run back and forth a few times and practice will be over.\n\nI locate pads behind the row of lockers. Luckily, they’re easy to put on. I rush back out onto the field and everyone is scattering, running around like ants. I hesitate before walking onto the field. When a whistle blows, someone shoves me from behind. “Go!” he yells, frustrated.\n\nThe lines, the numbers, the goal posts. They mean nothing to me as I stand on the field amongst the other guys. One of the coaches shouts an order and before I know it, the ball is being thrown in my direction. I catch it.\n\nWhat now?\n\nRun. I should probably run.\n\nI make it three feet before my face meets the astroturf. A whistle blows. A man yells.\n\nI stand up, just as one of the coaches stalks in my direction. “What the hell was that? Get your damn head in the play!”\n\nI look around me, the sweat beginning to trickle down my forehead. Landon’s voice rings out behind me. “Dude. What the hell is wrong with you?”\n\nI turn and look at him, just as everyone huddles around me. I follow their motions and lay my arms over the backs of the guys to my left and right. No one speaks for several seconds, and then I realize they’re all looking at me. Waiting. I think they want me to say something? I get the feeling it’s not a prayer circle.\n\n“You gonna call a play or what?” The guy to my left says.\n\n“Uh…,” I stutter. “You…,” I point to Landon. “Do that…thing.” Before they can question me, I pull apart and the huddle breaks.\n\n“Coach is gonna bench him,” I hear someone mumble behind me. A whistle blows and before the sound even leaves my ears, a freight train crashes into my chest.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 22",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nOr at least it feels that way.\n\nThe sky is above me, my ears are ringing, I can’t pull in a breath.\n\nLandon is hovering over me. He grabs my helmet and shakes it. “What the hell is wrong with you?” He looks around and then back down at me. His eyes narrow. “Stay on the ground. Act sick.”\n\nI do what he says and he jumps up to a stand. “I told him not to come to practice, Coach,” Landon says. “He’s had strep all week. I think he’s dehydrated.”\n\nI close my eyes, relieved for my brother. I kind of like this kid.\n\n“What the hell are you even doing here, Nash?” The coach is kneeling now. “Go to the locker room and get hydrated. We’ve got a game tomorrow night.” He stands and motions for one of the assistant coaches. “Get him a Z-pack and make sure he’s ready for the field tomorrow.”\n\nLandon pulls me up. My ears are still ringing, but I’m able to breathe now. I make my way toward the locker rooms, relieved to be off the field. I should have never walked on in the first place. Not smart, Silas.\n\nI make it back to the locker room and change out of my gear. As soon as I get my shoes on, I hear footsteps nearing the locker room from down the hall. I glance around and spot an exit on the far wall, so I rush to it and push it open. Luckily, it leads right out to the parking lot.\n\nI’m immediately relieved to see my car. I rush over to it just as Charlie climbs out of the driver side, hopping onto her feet as I approach. I’m so relieved to see her—to just have someone to relate to—that I don’t even think about what I do next.\n\nI grab her wrist and pull her to me, wrapping my arms around her in a tight hug. My face is buried in her hair and I let out a sigh. She feels familiar. Safe. Makes me forget that I can’t even remember…\n\n“What are you doing?”\n\nShe’s stiff against me. Her cold reaction reminds me that we don’t do things like this. Silas and Charlie did things like this.\n\nShit.\n\nI clear my throat and release her, taking a quick step back. “Sorry,” I mutter. “Force of habit.”\n\n“We have no habits.” She pushes past me and walks around my car.\n\n“Do you think you’ve always been this mean to me?” I ask her.\n\nShe looks at me from over the hood and nods. “My money’s on yes. You’re probably a glutton for punishment.”\n\n“More like a masochist,” I mutter.\n\nWe both climb into my car, and I have two places I plan on going tonight. The first being my house to shower, but I’m sure if I asked her if she wanted to come along, she’d say no just to spite me. Instead, I head in the direction of my house and don’t give her a choice.\n\n“Why are you smiling?” she asks, three miles into our drive.\n\nI didn’t realize I was. I shrug. “Just thinking.”\n\n“About what?”\n\nI glance at her and she’s waiting for my answer with an impatient frown.\n\n“I was wondering how the old Silas ever broke through your hard exterior.”\n\nShe laughs. “What makes you think he did?”\n\nI would smile again, but I don’t think I’ve stopped. “You saw the video, Charlie. You loved him.” I pause for a second, then rephrase. “Me. You loved me.”\n\n“She loved you,” Charlie says, and then smiles. “I’m not even sure if I like you yet.”\n\nI shake my head with a soft laugh. “I don’t know myself very well, but I must have been extremely competitive. Because I just took that as a challenge.”\n\n“Took what as a challenge? You think you can make me like you again?”\n\nI look over at her and give my head the slightest shake. “No. I’m gonna make you fall in love with me again.”\n\nI can see the gentle roll of her throat as she swallows, but just as fast as she let her guard down, it flies back up. “Good luck with that,” she says, facing forward again. “I’m pretty sure you’ll be the first guy to ever compete with himself over the affection of a girl.”\n\n“Maybe so,” I say as we pull into my driveway. “But my money’s on me.”\n\nI turn the car off and get out. She doesn’t unbuckle. “You coming? I need to take a quick shower.”\n\nShe doesn’t even look at me. “I’ll wait in the car.”\n\nI don’t argue. I close the door and head inside to shower, thinking about the small smile I could swear was playing in the corner of her mouth.\n\nAnd while winning her over again isn’t my main priority, it’s definitely the new back-up plan in case neither of us can figure out how to revert back to who we were before yesterday. Because even through all the bullshit—her cheating on me with Brian, me cheating on her with the counselor, our families in turmoil—we still obviously tried to make it work. There had to be something there, something deeper than attraction or a simple childhood bond, that made me fight to keep her.\n\nI want to feel that again. I want to remember what it feels like to love someone like that. And not just anyone. I want to know what it feels like to love Charlie.\n\nI’m standing on the edge of the lawn, looking down his street when he walks up behind me. I don’t hear him approach, but I smell him. I don’t know how, since he smells just like the outdoors.\n\n“What are you looking at?” he asks.\n\nI stare at the houses, each of them immaculate and manicured to the point of irritation. It makes me want to shoot a gun into the air, just to see all the quiet people inside scramble out. This neighborhood needs a little life breathed into it. “It’s strange how money seems to silence a neighborhood,” I say quietly. “On my street, where no one has money, it’s so loud. Sirens blaring, people shouting, car doors slamming, stereos thumping. There’s always someone, somewhere, making noise.” I turn and look up at him, not expecting the reaction I have to seeing his damp hair and smooth jaw. I focus on his eyes, but that isn’t much better. I clear my throat and look away. “I think I prefer the noise.”\n\nHe takes a step until we’re shoulder to shoulder, both staring at the taciturn street. “No you don’t. You don’t prefer either.” He says this like he knows me and I want to remind him he doesn’t know me at all, but he puts his hand on my elbow. “Let’s get out of here,” he says. “Go do something that doesn’t belong to Charlie and Silas. Something that’s ours.”\n\n“You’re talking about us like we’re body invaders.”\n\nSilas closes his eyes and tilts his head back. “You have no idea how many times a day I think about invading your body.”\n\nI don’t intend to laugh as hard as I do, but I trip over my own feet and Silas reaches down to catch me. We’re both laughing as he rights me on my feet and rubs his hands up and down my arms.\n\nI look away. I’m tired of liking him. I only have a day and a half worth of memories, but they’re all filled with me not hating Silas. And now he’s made it his personal mission to make me love him again. It’s annoying that I like it.\n\n“Go away,” I say.\n\nHe raises his hands in surrender and takes a step back. “This far?”\n\n“Farther.”\n\nAnother step. “Better?”\n\n“Yes,” I smart.\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 23",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nSilas grins. “I don’t know myself well, but I can tell I have a lot of game.”\n\n“Oh, please,” I say. “If you were a game, Silas, you’d be Monopoly. You just go on and on and everyone ends up cheating just to be over with it.”\n\nHe’s quiet for a minute. I feel bad for saying something so awkward even if it was a joke.\n\n“You’re probably right,” he laughs. “That’s why you cheated on me with that asshat, Brian. Lucky for you, I’m not Monopoly Silas anymore. I’m Tetris Silas. All my pieces and parts are going to fit into all of your pieces and parts.”\n\nI snort. “And the guidance counselor’s, apparently.”\n\n“Low blow, Charlie,” he says, shaking his head.\n\nI wait a few seconds, chewing on my lip. Then I say, “I don’t think I want you to call me that.”\n\nSilas turns to look at me. “Charlie?”\n\n“Yeah,” I look over at him. “Is that weird? I don’t feel like I’m her. I don’t even know her. It just doesn’t feel like my name.”\n\nHe nods as we walk toward his car. “So, I get to rename you?”\n\n“Until we figure all this out…yeah.”\n\n“Poppy,” he says.\n\n“No.”\n\n“Lucy.”\n\n“Hell no, what’s wrong with you?”\n\nHe opens the passenger side door to his Rover and I climb in.\n\n“Okay…okay. I can see you don’t like traditionally cute names. We can try for something tougher.” He walks around to the driver side and climbs in. “Xena…”\n\n“No.”\n\n“Rogue.”\n\n“Ugh. No.”\n\nWe go back and forth like this until Silas’s GPS tells us that we’ve arrived. I look around, surprised that I was too engaged with him to notice the drive here. When I look down at my phone I see that Brian has texted me six times. I don’t want to deal with him right now. I shove my phone and wallet under the seat, out of view.\n\n“Where are we?”\n\n“Bourbon Street,” he says. “Most happening place in New Orleans.”\n\n“How do you know that?” I ask suspiciously.\n\n“I Googled it.” We stare at each other over the hood, and then both shut our doors at the same time.\n\n“How did you know what Google was?”\n\n“I thought that’s what we’re supposed to be figuring out together.” We meet at the front of the car.\n\n“I think we’re aliens,” I say. “That’s why we don’t have any of Charlie and Silas’s memories. But we remember things like Google and Tetris because of the computer chips in our brains.”\n\n“So, can I rename you Alien?”\n\nBefore I can think about what I’m doing, I send the back of my hand into his chest. “Focus, Silas!”\n\nHe uumphs, and then I’m pointing straight ahead. “What’s that?” I walk ahead of him.\n\nIt’s a building, castle-like in structure, and white. There are three spires jutting up toward the sky.\n\n“Looks like a church,” he says, taking out his phone.\n\n“What are you doing?”\n\n“Taking a picture…in case we forget again. I figure we should document what’s happening and where we go.”\n\nI’m quiet as I think about what he said. It’s a really good idea. “That’s where we should go, right? Churches help people…,” my voice trails off.\n\n“Yes,” says Silas. “They help people, not aliens. And since we’re—”\n\nI hit him again. I wish he would take this seriously. “What if we’re angels and we’re supposed to help someone, and we were given these bodies to fulfill our mission?”\n\nHe sighs. “Are you listening to yourself?”\n\nWe’ve reached the doors to the church, which are ironically locked. “Okay,” I say, spinning around. “What’s your suggestion for what’s happened to us? Did we boink our heads together and lose our memories? Or maybe we ate something that really messed us up!”I storm down the stairs.\n\n“Hey! Hey!” he calls. “You’re not allowed to get mad at me. This is not my fault.” He runs down the stairs after me.\n\n“How do we know that? We don’t know anything, Silas! This could be all your fault!”\n\nWe’re standing at the bottom of the stairs now, staring at each other. “Maybe it is,” he says. “But whatever I did, you did it too. Because in case you haven’t noticed, we’re in the same boat.”\n\nI clench and unclench my fists, take deep breaths, concentrate on staring at the church until my eyes water.\n\n“Look,” Silas says, stepping closer. “I’m sorry for turning this into a joke. I want to figure it out as much as you do. What are some of your other ideas?”\n\nI close my eyes. “Fairy tales,” I say, looking back up at him. “Someone is always cursed. To break the spell they have to figure something out about themselves…then…”\n\n“Then what?”\n\nI can tell he’s trying to take me seriously, but this somehow makes me angrier. “There’s a kiss...”\n\nHe grins. “A kiss, huh? I’ve never kissed anyone before.”\n\n“Silas!”\n\n“What? If I can’t remember, it doesn’t count!”\n\nI fold my arms across my chest and watch a street musician pick up his violin. He remembers the first time he picked up a violin, the first notes he played, who gave it to him. I envy his memories.\n\n“I’ll be serious, Charlie. I’m sorry.”\n\nI look at Silas out of the corner of my eye. He looks genuinely sorry—hands shoved into his pockets, neck dropping like it’s suddenly too heavy.\n\n“So, what do you think we need to do? Kiss?”\n\nI shrug. “It’s worth a try, right?”\n\n“You said in fairy tales they have to figure something out first…”\n\n“Yeah. Like, Sleeping Beauty needed someone brave to kiss her and wake her from the sleeping curse. Snow White needed true love’s kiss to bring her back to life. Ariel needed to get Eric to kiss her to break the spell the sea witch put on her.”\n\nHe perks up. “Those are movies,” he says. “Do you remember watching them?”\n\n“I don’t remember watching them, I just know I’ve seen them. Mr. Deetson spoke about fairy tales in English today. That’s where I got the idea.”\n\nWe start walking toward the street musician who is playing something slow and mournful.\n\n“Sounds like the breaking of the curse is mostly up to the guy,” Silas says. “He needs to mean something to her.”\n\n“Yeah…” My voice drops off as we stop to listen. I wish I knew the song he was playing. It sounds like something I’ve heard, but I have no name for it.\n\n“There’s a girl,” I say softly. “I want to talk to her…I think maybe she knows something. A few people have referred to her as The Shrimp.”\n\nSilas’s eyebrows draw together. “What do you mean? Who is she?”\n\n“I don’t know. She’s in a couple of my classes. It’s just a feeling.”\n\nWe stand among a group of onlookers, and Silas reaches for my hand. For the first time, I don’t pull away from him. I let his warm fingers intertwine with mine. With his free hand, he takes a picture of the violinist, then he looks down at me. “So I can remember the first time I held your hand.”\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 24",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nWe’ve walked two blocks and she hasn’t let go of my hand yet. I don’t know if it’s because she likes holding it, or if it’s because Bourbon Street is…well...\n\n“Oh, God,” she says, turning toward me. She fists my shirt in her hand and presses her forehead against my arm. “That guy just flashed me,” she says, laughing into the sleeve of my shirt. “Silas, I just saw my first penis!”\n\nI laugh as I continue steering her through the inebriated crowd of Bourbon Street. After walking a ways, she peeks up again. We’re now approaching an even larger group of belligerent men, all without shirts. In the place of shirts are mounds of beads draped around their necks. They’re all laughing and screaming at the people perched on the balconies above us. She squeezes my hand tighter until we’ve successfully navigated through them. She relaxes and puts more space between us.\n\n“What’s with the beads?” she asks. “Why would anyone spend money on such tacky jewelry?”\n\n“It’s part of the Mardi Gras tradition,” I tell her. “I read about it when I was researching Bourbon Street. It started as a celebration for the last Tuesday before Lent, but I guess it’s turned into a year-round thing.” I pull her against my side and point down to the sidewalk in front of her. She sidesteps around what looks like puke.\n\n“I’m hungry,” she says.\n\nI laugh. “Stepping over vomit made you hungry?”\n\n“No, vomit made me think of food and food made my stomach growl. Feed me.” She points to a restaurant up the street. The sign is flashing in red neon. “Let’s go there.”\n\nShe steps ahead of me, still gripping my hand. I glance down at my phone and follow her lead. I have three missed calls. One from “Coach,” one from my brother, and one from “Mom.”\n\nIt’s the first time I’ve thought about my mother. I wonder what she’s like. I wonder why I haven’t met her yet.\n\nMy whole body crashes into the back of Charlie’s after she stops short to let a vehicle pass. Her hand flies up to the back of her head where my chin smashed against it. “Ouch,” she says, rubbing her head.\n\nI rub my chin and watch from behind her as she pushes her hair forward, over her shoulder. My eyes fall to the tip of what appears to be a tattoo peeking out from the back of her shirt.\n\nShe begins walking again, but I grab her shoulder. “Wait,” I tell her. My fingers trail to the collar of her shirt and I pull it down a couple of inches. Right below the nape of her neck is a small silhouette of trees in black ink. I run my fingers over their outline. “You have a tattoo.”\n\nHer hand flies to the spot I’m touching. “What?!” she shrieks. She spins around and looks up at me. “I do not.”\n\n“You do.” I turn her back around and pull the shirt down again. “Here,” I say as I trace the trees again. This time I notice as chills break out on her neck. I follow the line of tiny bumps with my eyes, running over her shoulder and hiding beneath her shirt. I look back at the tattoo again, because her fingers are now attempting to feel what I’m feeling. I take two of them and press them against her skin. “A silhouette of trees,” I tell her. “Right here.”\n\n“Trees?” she says, cocking her head to the side. “Why would I have trees?” She turns around. “I want to see it. Take a picture with your phone.”\n\nI pull her shirt down enough so that she can see the entire tattoo, even though it’s no more than three inches wide. I brush her hair over her shoulder again, not for the sake of the picture, but because I’ve really been wanting to do that. I also reposition her hand so that it’s coming across the front of her body, draping over her shoulder.\n\n“Silas,” she grumbles. “Just take the damn picture. This isn’t art class.”\n\nI grin and wonder if I’m always like this—if I refuse to take a simple picture, knowing it only takes a little bit more effort to make it exceptional. I bring the phone up and snap the picture, then look at the screen, admiring how good the tattoo looks on her. She spins around and takes the phone from my hands.\n\nShe looks down at the picture and gasps. “Oh my God.”\n\n“It’s a very nice tattoo,” I tell her. She hands me back my phone and rolls her eyes, walking again in the direction of the restaurant.\n\nShe can roll her eyes all she wants. It doesn’t change how she reacted to my fingers trailing across the back of her neck.\n\nI watch her walk toward the restaurant, and realize that I have her figured out already. The more she likes me, the more closed off she becomes. The more sarcasm she inflicts on me. Vulnerability makes her feel weak, so she’s pretending to be tougher than she really is. I think the old Silas knew this about her, too. Which is why he loved her, because apparently he liked the game they played.\n\nApparently I do too, because once again, I’m following her.\n\nWe walk through the door of the restaurant and Charlie says, “Two people, booth please,” before the hostess even has a chance to ask. At least she said please.\n\n“Right this way,” the woman says.\n\nThe restaurant is quiet and dark, a stark contrast to the noise and neon lights of Bourbon Street. We both breathe a collective sigh of relief once we’re seated. The waitress hands us our menus and takes our drink order. Every now and then, Charlie lifts a hand to the back of her neck as if she can feel the outline of the tattoo.\n\n“What do you think it means?” she says, still staring at the menu in front of her.\n\nI shrug. “I don’t know. Maybe you liked forests?” I glance up at her. “These fairy tales you talked about. Did they all take place in forests? Maybe the man who needs to break your spell with a kiss is a strapping lumberjack, living in the woods.”\n\nHer eyes meet mine and I can tell my jokes are aggravating her. Or maybe she’s aggravated because she thinks I’m funny. “Stop making fun of me,” she says. “We woke up without our memories at the exact same time, Silas. Nothing is more absurd than that. Even fairy tales with lumberjacks.”\n\nI smile innocently and look down at my hand. “I have callouses,” I tell her, lifting my hand and pointing at the rough skin of my palm. “I could be your lumberjack.”\n\nShe rolls her eyes again, but laughs this time. “You probably have callouses from jerking off too much.”\n\nI hold up my right hand. “But they’re on both hands, not just my left.”\n\n“Ambidextrous,” she deadpans.\n\nWe both grin as our drinks are placed in front of us. “Ready to order?” the waitress asks.\n\nCharlie quickly scans the menu and says, “I hate that we can’t remember what we like.” She looks up at the waitress. “I’ll take a grilled cheese,” she says. “It’s safe.”\n\n“Burger and fries, no mayo,” I tell her. We hand her back our menus and I refocus on Charlie. “You aren’t eighteen yet. How could you get a tattoo?”\n\n“Bourbon Street doesn’t seem to be a stickler for the rules,” she says. “I probably have a fake ID hidden somewhere.”\n\nI open the search engine on my phone. “I’ll try to figure out what it means. I’ve gotten pretty good at this Google thing.” I spend the next few minutes searching every possible meaning of trees and forests and clusters of trees. Just when I think I’m on to something, she pulls my phone away and sets it on the table.\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    },
    {
      "text": "Page 25",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\n“Get up,” she says as she stands. “We’re going to the bathroom.” She grabs my hand and pulls me out of the booth.\n\n“Together?”\n\nShe nods. “Yep.”\n\nI look at the back of her head as she walks away from me, then back at the empty booth. What the…\n\n“Come on,” she says over her shoulder.\n\nI follow her to the hallway that leads to the restrooms. She pushes open the women’s and peeks inside, then pulls her head out. “It’s a single stall. It’s empty,” she says, holding the door open for me.\n\nI pause and look at the men’s restroom, which looks perfectly fine, so I don’t know why she’s—\n\n“Silas!” She grabs my arm and pulls me inside the restroom. Once we’re inside, I half expect her to wrap her arms around my neck and kiss me because…why else would we be in here together?\n\n“Take off your shirt.”\n\nI look down at my shirt.\n\nI look back up at her. “Are we…are we about to make out? Because I didn’t picture it going down like this.”\n\nShe groans and reaches forward, pulling at the hem of my shirt. I help her pull it over my head when she says, “I want to see if you have any tattoos, dumbass.”\n\nI deflate.\n\nI feel like an eighteen-year-old who’s just been blue-balled. I guess I kind of am…\n\nShe turns me around and, when I face the mirror, she gasps. Her eyes are fixated on my back. My muscles tense beneath her touch as her fingertips meet my right shoulder blade. She traces a circle, spanning a radius of several inches. I squeeze my eyes shut and try to control my pulse. I suddenly feel drunker than everyone on Bourbon Street combined. I’m gripping the counter in front of me because her fingers…my skin.\n\n“Jesus,” I groan, dropping my head between my shoulders. Focus, Silas.\n\n“What’s wrong?” she asks, pausing her inspection of my tattoo. “It doesn’t hurt does it?”\n\nI release a laugh, because her hands on me are the opposite of pain. “No, Charlie. It doesn’t hurt.”\n\nMy eyes meet hers in the mirror and she stares at me for several seconds. When what she’s doing to me finally registers, she glances away and pulls her hand from my back. Her cheeks flush.\n\n“Put your shirt on and go wait for our food,” she demands. “I have to pee.”\n\nI release my grip on the counter and inhale deeply as I pull my shirt back over my head. On my walk back to our table, I realize I never even asked her what the tattoo was.\n\n“A strand of pearls,” she says as she slides into the booth. “Black pearls. It’s about six inches in diameter.”\n\n“Pearls?”\n\nShe nods.\n\n“Like a…necklace?”\n\nShe nods again and takes a sip of her drink. “You have a tattoo of a woman’s necklace on your back, Silas.” She’s smiling now. “Very lumberjack-esque.”\n\nShe’s enjoying this. “Yeah, well. You have trees on your back. Not much to brag about. You’ll probably get termites.”\n\nShe laughs out loud and it makes me laugh, too. She moves the straw around in her drink and looks down at her glass. “Knowing me…,” she pauses. “Knowing Charlie, she wouldn’t have gotten a tattoo unless it really meant something to her. It had to be something she knew she would never grow tired of. Never stop loving.”\n\nTwo familiar words stick out in her sentence. “Never never,” I whisper.\n\nShe looks up at me, recognizing the phrase we repeated to each other in the video. She tilts her head to the side. “You think it had something to do with you? With Silas?” She shakes her head, silently disagreeing with my suggestion, but I begin scrolling through my phone. “Charlie wouldn’t be that stupid,” she adds. “She wouldn’t ink something into her skin that was related to a guy. Besides, what would trees have to do with you?”\n\nI find exactly what I’m looking for and, as much as I’m trying to keep a straight face, I can’t stop the smile. I know it’s a smug smile and I probably should not be looking at her like this, but I can’t help it. I hand her the phone and she looks down at the screen and reads out loud.\n\n“From a Greek name meaning forests or woods.” She looks up at me. “So it’s the meaning of a name?”\n\nI nod. Still smug. “Scroll up.”\n\nShe scrolls up the screen with a swipe of her finger and her lips part with a gasp. “Derived from the Greek term—Silas.” Her mouth clamps shut and her jaw hardens. She hands me back the phone and closes her eyes. Her head moves slowly back and forth. “She got a tattoo of the meaning of your name?”\n\nAs expected, she’s pretending to be disappointed in herself.\n\nAs expected, I feel triumphant.\n\n“You got a tattoo,” I tell her, pointing my finger in her direction. “It’s on you. Your skin. My name.” I can’t stop with the stupid smile plastered across my face. She rolls her eyes again, just as our food is laid in front of us.\n\nI push mine aside and search the meaning for the name Charlie. I don’t pull anything up that could mean pearls. After a few minutes, she finally sighs and says, “Try Margaret. My middle name.”\n\nI search the name Margaret and read the results out loud.\n\n“Margaret, from the Greek term meaning pearl.”\n\nI set my phone down. I don’t know why it seems like I’ve just won a bet, but I feel victorious.\n\n“It’s a good thing you’re giving me a new name,” she says, matter of fact.\n\nA new name my ass.\n\nI pull my plate in front of me and pick up a french fry. I point it at her and wink. “We’re branded. You and me. We are so in love, Charlie. You feeling it yet? Do I make your heart go pitter patter?”\n\n“These aren’t our tattoos,” she says.\n\nI shake my head. “Branded,” I repeat. I raise my index finger as if I’m gesturing over her shoulder. “Right there. Permanently. Forever.”\n\n“God,” she groans. “Shut up and eat your damn burger.”\n\nI eat it. I eat the entire thing with a shit-eating grin.\n\n“What now?” I ask, leaning back in my seat. She’s barely touched her food and I’m pretty sure I just broke a record with how fast I ate mine.\n\nShe looks up at me and I can see by the trepidation in her expression that she already knows what she wants to do next, she just doesn’t want to bring it up.\n\n“What is it?”\n\nHer eyes narrow. “I don’t want you to make a smart-ass comment in response to what I’m about to suggest.”\n\n“No, Charlie,” I say immediately. “We aren’t eloping tonight. The tattoos are enough commitment for now.”\n\nShe doesn’t roll her eyes at my joke this time. She sighs, defeated, and leans back in her seat.\n\nI hate her reaction. I like it a whole lot more when she rolls her eyes at me.\n\nI reach across the table and cover her hand with mine, rubbing my thumb over hers. “I’m sorry,” I say. “Sarcasm just makes this whole thing feel a little less frightening.” I remove my hand from hers. “What did you want to say? I’m listening. Promise. Lumberjack’s honor.”\n\nShe laughs with a small roll of her eyes and I’m relieved. She glances up at me and shifts in her seat, then begins playing with her straw again. “We passed a few…tarot shops. I think maybe we should get a reading.”\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 26",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI don’t even start at her comment. I just nod and pull my wallet out of my pocket. I lay enough money on the table to cover our bill and then I stand up. “I agree,” I tell her, reaching out for her hand.\n\nI actually don’t agree, but I feel bad. These last two days have been exhausting and I know she’s tired. The least I can do is make this easier for her, despite knowing this hocus pocus bullshit isn’t going to enlighten us in any way.\n\nWe pass a few tarot shops during our search, but Charlie shakes her head each time I point one out. I’m not sure what she’s looking for, but I actually like walking the streets with her, so I’m not complaining. She’s holding my hand, and sometimes I put my arm around her and pull her against me when the paths become too narrow. I don’t know if she’s noticed, but I’ve been leading us through a lot of these narrow paths unnecessarily. Any time I see a big crowd, I aim for it. After all, she’s still my back-up plan.\n\nAfter about half an hour longer of walking, it looks like we’re reaching the end of the French quarter. The crowds are dwindling, giving me fewer excuses to pull her to me. Some of the shops we’re passing have already closed. We make it to St. Philip Street when she pauses in front of an art gallery window.\n\nI stand next to her and stare at the displays illuminated inside the building. There are plastic body parts suspended from the ceiling, and giant, metal sea life clinging to the walls. The main display, which is directly in front of us, just happens to be a small corpse—wearing a strand of pearls.\n\nShe taps her finger against the glass, pointing at the corpse. “Look,” she says. “It’s me.” She laughs and moves her attention to somewhere else inside the store.\n\nI’m not looking at the corpse anymore. I’m not looking inside the store anymore.\n\nI’m looking at her.\n\nThe lights from inside the gallery are illuminating her skin, giving her a glow that really does make her look like an angel. I want to run my hand across her back and feel for actual wings.\n\nHer eyes move from one object to another as she studies everything beyond the window. She’s looking at each piece with bewilderment. I make a mental note to bring her back here when they’re actually open. I can’t imagine what she’d look like actually being able to touch one of the pieces.\n\nShe stares into the window a few minutes longer and I continue to stare at her, only now I’ve taken two steps and I’m standing directly behind her. I want to see her tattoo again, now that I know what it means. I wrap my hand around her hair and brush it forward, over her shoulder. I half expect her to reach behind her and slap my hand away, but instead, she sucks in a quick rush of air and looks down at her feet.\n\nI smile, remembering what it felt like when she ran her fingers over my tattoo. I don’t know if I make her feel the same, but she’s standing still, allowing my fingers to slip inside the collar of her shirt again.\n\nI swallow what feels like three entire heartbeats. I wonder if she’s always had this effect on me.\n\nI pull her shirt down, revealing her tattoo. A pang shoots through my stomach, because I hate that we don’t have this memory. I want to remember the discussion we had when we decided to make such a permanent decision. I want to remember who brought the idea up first. I want to remember what she looked like as the needle pierced her skin for the first time. I want to remember how we felt when it was over.\n\nI run my thumb over the silhouette of trees while curving the rest of my hand over her shoulder—over skin covered in chills again. She tilts her head to the side and the tiniest of whimpers escapes her throat.\n\nI squeeze my eyes shut. “Charlie?” My voice is like sandpaper. I clear my throat to smooth it out. “I changed my mind,” I say quietly. “I don’t want to give you a new name. I kind of love your old one now.”\n\nI wait.\n\nI wait for her snarky response. For her laughter.\n\nI wait for her to push my hand away from the nape of her neck.\n\nI get no reaction from her. Nothing. Which means I get everything.\n\nI keep my hand on her back as I slowly step around her. I’m standing between her and the window now, but she keeps her eyes focused on the ground. She doesn’t look up at me, because I know she doesn’t like to feel weak. And right now, I’m making her weak. I bring my free hand to her chin and graze my fingers up her jaw, tilting her face to mine.\n\nWhen we lock eyes, I feel like I’m meeting a brand new side of her. A side of her without resolve. A vulnerable side. A side that’s allowing herself to feel something. I want to grin and ask her how it feels to be in love, but I know teasing her in this moment would piss her off and she’d walk away and I can’t let that happen. Not right now. Not when I finally get to catalog an actual memory with all the numerous fantasies I’ve had about her mouth.\n\nHer tongue slides across her bottom lip, causing jealousy to flutter through me, because I really wanted to be the one to do that to her lip.\n\nIn fact…I think I will.\n\nI begin to dip my head, just as she presses her hands against my forearms. “Look,” she says, pointing at the building next door. The flickering light has stolen her attention and I want to curse the universe for the simple fact that a light bulb just interfered with what was about to become my absolute favorite of very few memories.\n\nI follow her gaze to a sign that doesn’t look any different from all of the other Tarot signs we’ve passed. The only thing different about this one is it just completely ruined my moment. And dammit, it was a good moment. A great one. One I know Charlie was also feeling, and I don’t know how long it’ll take me to get back to that.\n\nShe’s walking in the direction of the shop now. I follow behind her like a lovesick puppy.\n\nThe building is unmarked and it makes me wonder what it was about the unreliable, asshole-lighting that drew her away from my mouth. The only words indicating this is even a store are the “No Cameras” signs plastered on every blackened window.\n\nCharlie puts her hands on the door and pushes it open. I follow her inside and we’re soon standing in what looks like the center of a touristy voodoo gift shop. There’s a man standing behind a register and a few people browsing the aisles.\n\nI try to take everything in as I follow Charlie through the store. She fingers everything, touching the stones, the bones, the jars of miniature voodoo dolls. We silently make our way down each aisle until we reach the back wall. Charlie stops short, grabs my hand and points at a picture on the wall. “That gate,” she says. “You took a picture of that gate. It’s the one hanging on my wall.”\n\n“Can I help you?”\n\nWe both spin around and a large—really large—man with gauged ears and a lip ring is staring down at us.\n\nI kind of want to apologize to him and leave as fast as we can, but Charlie has other plans. “Do you know what this gate is guarding? The one in the picture?” Charlie asks him, pointing over her shoulder. The man’s eyes lift to the picture frame. He shrugs.\n\n“Must be new,” he says. “I’ve never noticed it before.” He looks at me, arching an eyebrow adorned with multiple piercings. One being a small…bone? Is that a bone sticking through his eyebrow? “You two looking for anything in particular?”\n\nI shake my head and begin to respond, but my words are cut off by someone else’s.\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    },
    {
      "text": "Page 27",
      "content": "PROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\n\"Rũ sạch\" lá gan nhiễm độc do bia rượu bằng phương pháp đơn giản\n\n“They’re here to see me.” A hand reaches through a beaded curtain to our right. A woman steps out, and Charlie immediately sidles against me. I wrap my arm around her. I don’t know why she’s allowing this place to freak her out. She doesn’t seem like the type to believe in this sort of thing, but I’m not complaining. A frightened Charlie means a very lucky Silas.\n\n“This way,” the woman says, motioning for us to follow her. I start to object, but then remind myself that places like this…they’re all about theatrics. It’s Halloween 365 days a year. She’s just playing a part. She’s no different than Charlie and me, pretending to be two people we aren’t.\n\nCharlie glances up at me, silently asking for permission to follow her. I nod and we follow the woman through the curtain of—I touch one of the beads and take a closer look—plastic skulls. Nice touch.\n\nThe room is small and every wall is covered with thick, velvet black curtains. There are candles lit around the room, flickers of light licking the walls, the floor, us. The woman takes a seat at a small table in the center of the room for us to sit in the two chairs across from her. I keep Charlie’s hand wrapped tightly in mine as we both sit.\n\nThe woman begins to slowly shuffle a deck of tarot cards. “A joint reading, I assume?” she asks.\n\nWe both nod. She hands Charlie the deck and asks her to hold them. Charlie takes them from her and clasps her hands around them. The woman nudges her head toward me. “Both of you. Hold them.”\n\nI want to roll my eyes, but instead I reach my hand across Charlie and place it on the deck with her.\n\n“You need to want the same thing out of this reading. Multiple readings can sometimes overlap when there isn’t cohesiveness. It’s important your goal is the same.”\n\nCharlie nods. “They are. It is.”\n\nI hate the desperation in her voice, like we’re actually going to get an answer. Surely she doesn’t believe this.\n\nThe woman reaches across to take the cards from our hands. Her fingers brush mine and they’re ice cold. I pull my hand back and grab Charlie’s, moving it onto my lap.\n\nShe begins laying cards out on the table, one by one. They’re all facedown. When she’s finished, she asks me to pull a card from the deck. When I hand her the card, she sets it apart from the others. She points at it. “This card will give you your answer, but the other cards explain the path to your question.”\n\nShe puts her fingers on the card in the middle. “This position represents your current situation.” She flips it over.\n\n“Death?” Charlie whispers. Her hand tightens around mine.\n\nThe woman looks at Charlie and tilts her head. “It isn’t necessarily a bad thing,” she says. “The death card represents a major change. A reformation. The two of you have experienced a loss of sorts.”\n\nShe touches another card. “This position represents the immediate past.” She flips it over and before I look down at the card, I can see the woman’s eyes narrow. My eyes fall to the card. The Devil.\n\n“This indicates something or someone was enslaving you in the past. It could represent a number of things close to you. Parental influence. An unhealthy relationship.” Her eyes meet mine. “Inverted cards reflect a negative influence, and although it represents the past, it can also signify something you’re currently transitioning through.”\n\nHer fingers fall to another card. “This card represents your immediate future.” She slides the card toward her and flips it over. A quiet gasp falls from her mouth and I feel Charlie flinch. I glance down at her and she’s staring intently at the woman, waiting for an explanation. She looks terrified.\n\nI don’t know what kind of game this woman is playing, but it’s beginning to piss me off…\n\n“The Tower card?” Charlie says. “What does it mean?”\n\nThe woman flips the card back over as if it’s the worst card in the deck. She closes her eyes and blows out a long breath. Her eyes pop open again and she’s staring right at Charlie. “It means…destruction.”\n\nI roll my eyes and push back from the table. “Charlie, let’s get out of here.”\n\nCharlie looks at me pleadingly. “We’re almost finished,” she says.\n\nI relent and scoot back toward the table.\n\nThe woman flips over two more cards, explaining them to Charlie, but I don’t hear a single word she says. My eyes wander around the room as I try to remain patient and let her finish, but I feel like we’re wasting time.\n\nCharlie’s hand begins squeezing the life out of mine, so I return my attention to the reading. The woman’s eyes are closed tight and her lips are moving. She’s mumbling words I can’t decipher.\n\nCharlie scoots closer to me, and I instinctively wrap my arm around her. “Charlie,” I whisper, making her look up at me. “It’s theatrics. She gets paid to do this. Don’t be scared.”\n\nMy voice must have broken the woman out of her conveniently timed trance. She’s tapping the table, trying to get our attention as if she wasn’t off in la-la land for the last minute and a half.\n\nHer fingers fall to the card I pulled out of the deck. Her eyes meet mine, and then they move to Charlie’s. “This card,” she says slowly. “Is your outcome card. Combined with the other cards in the reading, this gives you the answer to why you are here.” She flips the card over.\n\nThe woman doesn’t move. Her eyes are locked on the card beneath her fingertips. The rooms grows eerily quiet, and as if on cue, one of the candles loses its flame. Another nice touch, I think.\n\nI look down at the outcome card. There aren’t any words on it. No title. No picture.\n\nThe card is blank.\n\nI can feel Charlie stiffen in my arms as she stares at the blank card on the table. I shove back from the table and pull Charlie up. “This is ridiculous,” I say loudly, accidentally knocking my chair over.\n\nI’m not pissed that the woman is trying to scare us. It’s her job. I’m pissed because she’s actually scaring Charlie, yet she’s keeping up this ridiculous façade.\n\nI take Charlie’s face in my hands and look her in the eyes. “She planted that card to scare you, Charlie. This is all bullshit.” I take both her hands and begin to turn her toward the exit.\n\n“There are no blank cards in my tarot deck,” the woman says.\n\nI pause in my tracks and turn around to face her. Not because of what she said, but because of the way she said it. She sounded scared.\n\nScared for us?\n\nI close my eyes and exhale. She’s an actress, Silas. Calm your shit.\n\nI push open the door and pull Charlie outside. I don’t stop walking until we’re around the building and on another street. When we’re away from the store and away from the damn flickering of the sign, I stop walking and pull her against me. She wraps her arms around my waist and buries her head against my chest.\n\n“Forget all of that,” I say, rubbing my hand in reassuring circles over her back. “Fortune-telling, tarot readings…it’s ridiculous, Charlie.”\n\nShe pulls her face from my shirt and looks up at me. “Yeah. Ridiculous like the both of us waking up at school with no memory of who we are?”\n\nI close my eyes and pull away from her. I run my hands through my hair, the frustration from the day catching up to me. I can make light of it all with my jokes. I can dismiss her theories—from tarot readings to fairy tales—simply because it doesn’t make sense to me. But she’s right. None of this makes sense. And the more we try to uncover the mystery, the more I feel like we’re wasting our damn time.\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 28",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nHis lips fold in and he shakes his head. He wants out of here. I can feel his edginess.\n\n“Maybe we should go back and ask her more detailed questions,” I suggest.\n\n“No way,” he says. “I’m not entertaining that again.” He starts to walk away, and I consider going back in there myself. I’m just about to take my first step toward the shop when the “Open” sign in the window turns off. The shop is in sudden darkness. I chew on the inside of my cheek. I could come back when Silas isn’t around. Maybe she’d talk to me more.\n\n“Charlie!” he calls.\n\nI run after him until we’re walking side by side again. We can see our breath as we walk. When did it get this cold? I rub my hands together.\n\n“I’m hungry,” I say.\n\n“You’re always hungry. I’ve never seen someone so small eat so much.”\n\nHe doesn’t offer to feed me this time, so I continue to walk beside him. “What just happened back there?” I ask. I’m trying to make a joke of it, but my stomach feels funny.\n\n“Someone tried to scare us. That’s it.”\n\nI look up at Silas. Mostly everything together except those shoulders, which are tense. “But what if she’s right? What if there weren’t any blank cards in her tarot deck?”\n\n“No,” he says. “Just no.”\n\nI bite my lip and sidestep a man dancing backward down the sidewalk.\n\n“I don’t understand how you can dismiss something so easily, considering our circumstances,” I say from between my teeth. “Don’t you think—”\n\n“Why don’t we talk about something else,” Silas says.\n\n“Right, like what we’re going to do next weekend? Or how about we talk about what we did last weekend? Or maybe we talk about…” I smack my hand against my forehead. “The Electric Crush Diner.” How could I forget about that?\n\n“What?” Silas asks. “What’s that?”\n\n“We were there. You and me, last weekend. I found a receipt in my jeans pocket.” Silas is watching me recount all of this with a look of mild annoyance on his face. “I took Janette there for dinner last night. A server recognized me.”\n\n“Hey!” he yells over my shoulder. “If you touch her with that I’ll break you in half!”\n\nI glance behind me and see a man pointing a foam finger at my butt. He backs off when he sees the look on Silas’s face.\n\n“Why didn’t you tell me that?” Silas says under his breath, directing his attention back to me. “That’s not like tarot readers, that’s something important.”\n\n“I really don’t know. I meant to…”\n\nHe grabs my hand, but this time it’s not for the pleasure of our palms pressing together. He drags me down the street with one hand while typing something into his phone with the other. I’m both impressed and mildly annoyed at being spoken to like that. We may have been something in our other life, but in this life I don’t even know his middle name.\n\n“It’s on North Rampart Street,” I say, helpfully.\n\n“Yeah.”\n\nHe’s pissed. I kind of like the emo-ness of it. We pass through a park with a fountain. Street vendors have set up their artwork along the fence; they stare at us as we pass by. Silas is taking one step to my three. I trot to keep up. We walk so far until my feet hurt and finally I yank my hand free of his.\n\nHe stops and turns around.\n\nI don’t know what to say, or what I’m mad at, so I place my hands on my hips and glare at him.\n\n“What’s wrong with you?” he says.\n\n“I don’t know!” I shout. “But you can’t just drag me around the city! I can’t walk as fast as you and my feet hurt.”\n\nThis feels familiar. Why does this feel familiar?\n\nHe looks away and I can see the muscles working in his jaw. He turns back to me and everything happens quickly. He takes two steps and scoops me off my feet. Then he resumes his pace with my bouncing ever so slightly in his arms. After my initial squeal, I settle down and clasp my arms around his neck. I like it up here where I can smell his cologne and touch his skin. I don’t recall seeing perfume among Charlie’s things, and I doubt I would have thought to put any on. What does that say about Silas? That in the midst of all of this, he thought to pick up a bottle and spray cologne on his neck before he left the house this morning. Was he always the type of person who cared about the little things—like smelling good?\n\nAs I think these thoughts, Silas stops to ask a woman who has fallen in the street if she’s all right. She’s drunk and sloppy. When she tries to stand up, she steps on the hem of her dress and falls back down. Silas sets me down on the sidewalk and goes to help her.\n\n“Are you bleeding? Did you hurt yourself?” he asks. He helps her stand, leads her back to where I’m waiting. She slurs her words and pats him on the cheek, and I wonder if he knew when he went to help her that she was homeless. I wouldn’t touch her. She smells. I step away from both of them, and watch him watch her. He’s concerned. He keeps his eyes on her until she’s stumbled off down the next street, and then he swings his head around to find me.\n\nIn this moment—right now—it’s so clear to me who Charlie is. She’s not as good as Silas. She loves him because he’s so different from her. Maybe that’s why she went to Brian, because she couldn’t live up to Silas.\n\nLike I can’t.\n\nHe half smiles at me, and I think he’s embarrassed to be caught caring. “Ready?”\n\nI want to tell him that what he did was nice, but nice is such a silly word for kindness. Anyone could pretend to be nice. What Silas did was innate. Boldfaced kindness. I haven’t had any thoughts like that. I think about the girl in class the first morning who dropped her books at my feet. She’d looked at me with fear. She expected me not to help. And more. What else?\n\nSilas and I walk in silence. He checks his phone every few minutes to make sure we’re headed in the right direction and I check his face. I wonder if this is what a crush feels like. If watching a man help a woman is supposed to illicit these types of feelings. And then we’re here. He points across the street and I nod.\n\n“Yeah, that’s it.”\n\nBut it’s almost not. The diner has transformed since I was here with Janette. It’s loud and pumping. There are men lined up on the sidewalk smoking; they part for us as we walk by. I can feel the bass in my ankles as we stand outside the doors. They open for us as a group leaves. A girl walks past me laughing, her pink fur jacket brushing against my face. Inside, people are defending their space with widened elbows and jutted hips. People glare at us as we walk by. This is my space, back off. I’m waiting for the rest of my group—keep moving. We bypass the few empty seats in favor of walking deeper into the building. We press through the crowd, walking sideways, and flinching when raucous laughter erupts next to us. A drink spills on my shoes, someone says sorry. I don’t even know who, because it’s so dark. And then someone calls our names.\n\n“Silas! Charlie! Over here!”\n\nA boy and…who was that girl who picked me up this morning? Annie…Amy?\n\n“Hey,” she says, as we draw close. “I can’t believe you actually came back here after last weekend.”\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 29",
      "content": "PROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\n\"Rũ sạch\" lá gan nhiễm độc do bia rượu bằng phương pháp đơn giản\n\n“Why wouldn’t we?” Silas asks.\n\nI take the seat I am offered and stare up at the three of them.\n\n“You punch a guy, throw over a couple of tables and wonder why you shouldn’t come back?” the boy says, along with a laugh. I think he’s Annie/Amy’s boyfriend by the way he looks at her—like they’re in on something together. Life, maybe.\n\nIt’s how Silas and I look at each other. Except we really are in on something together.\n\n“You acted like an ass,” she says.\n\n“Amy,” the spare boy says. “Don’t.”\n\nAmy!\n\nI want to know more about this person Silas punched.\n\n“He deserved it,” I say. Amy raises her eyebrows and shakes her head. Whatever she’s thinking, she’s too afraid to say it, because she turns away. I try her boyfriend next. “Don’t you think so?” I ask innocent-like. He shrugs. Goes to sit next to Amy. They’re all scared of me, I think, but why?\n\nI order a Coke. Amy’s head snaps around to look at me when she hears.\n\n“Regular Coke? Not Diet?”\n\n“Do I look like I need to drink diet?” I snap. She shrinks back. I don’t know where that came from—honest to god. I don’t even know how much I weigh. I decide to shut up and let Silas do the detective work before I offend someone again. He drops down next to Amy’s boyfriend and they begin to talk. The music makes it impossible to eavesdrop, and Amy is doing her best not to look at me, so I people-watch. People…they all have memories…know who they are. I’m jealous.\n\n“Let’s go, Charlie.” Silas is standing above me, waiting. Amy and her boyfriend are watching us from across the table. It’s a big table, I wonder who else is coming to join them and how many of those people hate me.\n\nOut of the restaurant and back onto the street. Silas clears his throat.\n\n“I got into a fight.”\n\n“I heard,” I say. “Did they tell you who it was?”\n\n“Yeah.”\n\nI wait and, when he doesn’t offer the information, I say, “Well…?”\n\n“I punched the owner in the face. Brian’s father.”\n\nMy head snaps around. “What the hell?”\n\n“Yeah,” he says. He rubs the scruff on his chin thoughtfully. “Because he said something about you…”\n\n“Me?” I get a sick feeling in my stomach. I know what’s coming, but I don’t know what’s coming.\n\n“He told me he was giving you a job as a waitress…”\n\nOkay, that’s not so bad. We need the money.\n\n“Because you were Brian’s girl. So I punched him, I guess.”\n\n“Damn.”\n\n“Yeah. That kid—Eller—told me we needed to leave before Brian’s dad called the cops.”\n\n“The cops?” I echo.\n\n“I guess Brian’s dad and my dad have worked together on some stuff. He agreed not to press charges last week because of it, but I’m not supposed to go back there. Also, Landon has been calling around, looking for me. Apparently my dad is wondering why I left practice. Everyone’s pretty pissed about that.”\n\n“Oops,” I say.\n\n“Yeah, oops.” He says it like he doesn’t care.\n\nWe go back the way we came, both of us quiet. We pass a few street artists I didn’t notice before. Two of them look like a couple. The man is playing the bagpipes while the woman draws pictures in colored chalk on the sidewalk. We step over the drawings, both of our heads down, examining. Silas takes out his camera and snaps a few pictures while I watch her turn a few lines into a couple kissing.\n\nA couple kissing. That reminds me.\n\n“We need to kiss,” I say to him.\n\nHe almost drops his phone. His eyes are big when he looks at me.\n\n“To see if something happens…like in the fairy tales we talked about.”\n\n“Oh,” he says. “Yeah, sure. Okay. Where? Now?”\n\nI roll my eyes and walk away from him, toward a fountain near a church. Silas follows behind. I want to see his face, but I don’t look. This is all business. I can’t make it into something else. It’s an experiment. That’s it.\n\nWhen we reach the fountain, we both sit down on the rim of it. I don’t want to do it this way, so I stand up and face him.\n\n“Okay,” I say, coming to stand in front of him. “Close your eyes.”\n\nHe does, but there’s a grin on his face.\n\n“Keep them closed,” I instruct. I don’t want him to see me. I barely know what I look like; I don’t know if my face contorts under pressure.\n\nHis head is tilted up, and mine is tilted down. I put my hands on his shoulders and feel his hands lift to my waist as he pulls me closer, between his knees. His hands slide up without warning, his thumbs grazing my stomach and then making a quick swipe along the underside of my bra. My stomach clenches.\n\n“Sorry,” he says. “I can’t see what I’m doing.”\n\nI smirk this time and I’m glad he can’t see my reaction right now. “Put your hands back on my waist,” I command.\n\nHe puts them too low and now his palms are on my ass. He squeezes a little, and I smack his arm.\n\n“What?” He laughs. “I can’t see!”\n\n“Up,” I say. He slides them a little higher, but slowly. I tingle down to my toes. “Higher,” I say, again.\n\nHe takes them up a quarter of an inch. “Is this—”\n\nBefore he can finish his sentence, I lean my face down and kiss him. He’s smiling at first, still in the middle of his little game, but when he feels my lips, his smile dissolves.\n\nHis mouth is soft. I lift my hands to his face and cup it as he pulls me tighter, wrapping his arms around my backside. I’m kissing down and he’s kissing up. At first, I expect to just give him a peck. That’s all they ever show in the fairy tales—a quick peck and the curse is broken. We’d have gotten our memories back by now if this were going to work. The experiment should be over, but neither of us stops.\n\nHe kisses with soft lips and a firm tongue. It’s not sloppy or wet, it moves in and out of my mouth sensually as his lips suck softly on mine. I run my fingers up the back of his neck and into his hair, and that’s when he stands, forcing me to take a step back and change position. I do a good job of hiding my gasp.\n\nNow I’m kissing up and he’s kissing down. Except he’s holding me to him, his arm wrapped around my waist, his free hand curled around the back of my neck. I cling to his shirt, dizzy. Soft lips, dragging…tongue between my lips…pressure on my back…something pressing between us that makes me feel a riot of heat. I push away, gasping.\n\nI stand there looking at him, and he looking at me.\n\nSomething has happened. It’s not our memories that have awoken, but something else that makes us feel drunk.\n\nAnd it occurs to me as I stand here, wanting him to kiss me again, that this is exactly what doesn’t need to happen. We’re going to want more of the new us and we’ll lose focus.\n\nHe slides a hand down his face as if to sober himself up. He smiles. “I don’t care what our real first kiss was,” he says. “That’s the one I want to remember.”\n\nI stare at his smile long enough to remember it, and then I turn and walk away.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 30",
      "content": "PROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\n\"Rũ sạch\" lá gan nhiễm độc do bia rượu bằng phương pháp đơn giản\n\n“Charlie!” he yells.\n\nI ignore him and keep walking. That was stupid. What was I thinking? A kiss isn’t going to bring our memories back. This isn’t a fairy tale.\n\nHe grabs my arm. “Hey. Slow down.” And then, “What are you thinking?”\n\nI keep walking in the direction I’m certain we came from. “I’m thinking I need to get home. I have to make sure Janette has eaten dinner…and…”\n\n“About us, Charlie.”\n\nI can feel him staring at me. “There is no us,” I say. I bring my eyes back to his. “Haven’t you heard? We were obviously broken up and I was dating Brian. His dad was giving me a job. I…”\n\n“We were an us, Charlie. And holy shit, I can see why.”\n\nI shake my head. We can’t lose focus. “That was your first kiss,” I say. “It could feel like that with anyone.”\n\n“So it felt that way for you too?” he asks, running around to stand in front of me.\n\nI consider telling him the truth. That if I were dead like Snow White and he kissed me like that, surely my heart would kick back to life. That I’d be the one to slay dragons for that kiss.\n\nBut we don’t have time to kiss like that. We need to find out what’s happened and how to reverse it.\n\n“I didn’t feel anything,” I say. “It was just a kiss and it didn’t work.” A lie that burns my insides it’s so foul. “I have to go.”\n\n“Charlie…”\n\n“I’ll see you tomorrow.” I lift a hand over my head and wave because I don’t want to turn around and look at him. I’m afraid. I want to be with him, but it’s not a good idea. Not until we figure more of this out. I think he’s going to follow me, so I wave over a cab. I open the door and look back at Silas to show him that I’m fine. He nods, and then lifts his phone to snap a picture of me. The first time she left me, he’s probably thinking. He then buries his hands in his pockets and turns in the direction of his car.\n\nI wait until he’s past the fountain before I lean down to speak to the driver. “Sorry, I changed my mind.” I slam the door and step back to the curb. I don’t have money for a cab anyway. I’ll go back to the diner and ask Amy for a ride.\n\nThe cabbie peels off and I duck down a different street so Silas won’t see me. I need to be alone. I need to think.\n\nAnother night of shitty sleep. Only this time, my lack of sleep wasn’t because I was worried about myself, or even worried about what made Charlie and me lose our memories. My lack of sleep was strictly because I had two things on my mind: our kiss, and Charlie’s reaction to our kiss.\n\nI don’t know why she walked away, or why she preferred to take a cab over riding with me. I could tell by the way she responded during the kiss that she felt what I was feeling. Of course it wasn’t like the kisses in fairy tales that could end a curse, but I don’t think either of us really expected it to. I’m not sure we really had any expectations for the kiss at all—just a little bit of hope.\n\nWhat I certainly didn’t expect was for everything else to take a backseat once her lips pressed against mine, but that’s exactly what happened. I stopped thinking about the reason we were kissing and everything we had been through all day. All I could think about was how she was clenching my shirt in her fists, pulling me closer, wanting more. I could hear the small gasps of air she was sucking in between kisses, because as soon as our mouths met, we were both breathless. And even though she stopped the kiss and stepped away, I could still see the dazed look on her face and the way her eyes lingered on my mouth.\n\nDespite all of it, though, she still turned and walked away. But if I’ve learned anything about Charlie in these last two days, it’s that there’s a reason for every move she makes. And it’s usually a good reason, which is why I didn’t try to stop her.\n\nMy phone receives a text, and I almost fall as I scramble out of the shower to get to it. I haven’t heard from her since we parted ways last night, and I’d be lying if I said I wasn’t beginning to worry.\n\nMy hope bleeds out of me when I see the text isn’t from Charlie. It’s from the kid I talked to at the diner last night, Eller.\n\nEller: Amy wants to know if Charlie rode with you to school. She’s not at home.\n\nI turn off the water, despite not even having rinsed off yet. I grab a towel with one hand and respond to his text with the other.\n\nMe: No, I haven’t even left my house yet. Has she tried her cell?\n\nAs soon as I send the text, I dial Charlie’s number and hit speaker, then set the phone down on the counter. I’m dressed by the time her voicemail picks up.\n\n“Shit,” I mutter as I end the call. I open the door and stop by my bedroom long enough to get into my shoes and grab my keys. I make it downstairs, but freeze before I reach the front door.\n\nThere’s a woman in the kitchen, and she isn’t Ezra.\n\n“Mom?”\n\nThe word comes out of my mouth before I realize I’m even speaking. She spins around, and even though I only recognize her from the pictures on the wall, I think I might feel something. I don’t know what it is. It’s not love or recognition. I’m just overcome with a sense of calmness.\n\nNo…it’s comfort. That’s what I feel.\n\n“Hey, sweetie,” she says with a bright smile that reaches the corners of her eyes. She’s preparing breakfast—or maybe she’s cleaning after just finishing up breakfast. “Did you see the mail I put on your dresser yesterday? And how are you feeling?”\n\nLandon looks more like her than I do. His jaw is soft, like hers. Mine is harsh, like my father’s. Landon carries himself like she does, too. Like life has been good to them.\n\nShe tilts her head and then closes the distance between us. “Silas, are you okay?”\n\nI take a step back when she tries to touch her hand to my forehead. “I’m fine.”\n\nShe tucks her hand to her chest like it offends her that I backed away. “Oh,” she says. “Okay. Well, good. You already missed school this week and you have a game tonight.” She walks back into the kitchen. “You shouldn’t stay out so late when you’re sick.”\n\nI stare at the back of her head, wondering why she would say that. This is the first time I’ve even seen her since all of this started. Ezra or my father must have told her about Charlie being here.\n\nI wonder if Charlie being here upset her. I wonder if she and my father share the same opinion of Charlie.\n\n“I feel fine now,” I reply. “I was with Charlie last night, that’s why I was home late.”\n\nShe doesn’t react to my baited comment. She doesn’t even look at me. I wait a few more seconds to see if she’s going to respond. When she doesn’t, I turn and head for the front door.\n\nLandon is in the front seat already when I reach the car. I open the back door and throw my backpack inside. When I open the front, he reaches his hand out to me. “This was ringing. Found it under your seat.”\n\nI take the phone from him. It’s Charlie’s.\n\n“She left her phone in my car?”\n\nLandon shrugs. I stare at the screen and there are several missed calls and texts. I see Brian’s name, along with Amy’s. I try to open them, but I’m prompted for a password.\n\nPROMOTED CONTENT\n7 phút mỗi ngày! Lấy lại mái tóc óng ả đầy mơ ước\nOrganic Spirulina Powder\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 31",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\n“Get in the damn car, we’re already late!”\n\nI climb inside and set Charlie’s phone on the console while I back out. When I pick it back up again to try and figure out the password, Landon snatches it out of my hands.\n\n“Did you not learn anything from your fender bender last year?” He slaps the phone back down on the console.\n\nI’m uneasy. I don’t like that Charlie doesn’t have her phone with her. I don’t like that she didn’t ride to school with Amy. If she already left her house before Amy got there, who did she ride to school with? I’m not sure how I’ll react if I find out she caught a ride with Brian.\n\n“I mean this in the nicest way possible,” Landon says. I glance over at him—at the cautious look on his face. “But…is Charlie pregnant?”\n\nI slam on my breaks. Luckily there’s a light in front of us that turns red, so my reaction appears intentional.\n\n“Pregnant? Why? Why would you ask that? Did you hear that from someone?”\n\nLandon shakes his head. “No, it’s just…I don’t know. I’m trying to figure out what the hell is going on with you and that seemed like the only justifiable answer.”\n\n“I miss practice yesterday so you assume it’s because Charlie is pregnant?”\n\nLandon laughs under his breath. “It’s more than just that, Silas. It’s everything. You fighting with Brian, the practices you’ve missed all week, you ditching school half a day Monday, all day Tuesday, half a day Wednesday. It’s not like you.”\n\nI ditched school this week?\n\n“Also, you and Charlie have been acting strange when you’re together. Not like your usual selves. You forgot to pick me up after school, you stayed out past curfew on a school night. You’ve been really off this week, and I don’t know if you want to tell me what the hell is going on, but it’s really starting to worry me.”\n\nI watch as the disappointment fills his eyes.\n\nWe were close. He’s definitely a good brother, I can tell. He’s used to knowing all my secrets—all my thoughts. I wonder if these rides to and from school are when we normally share them. I wonder if I were to tell him what I’m really thinking—if he would even believe me.\n\n“The light’s green,” he says, facing forward.\n\nI begin driving again, but I don’t share any secrets with him. I don’t know what to say or how to even begin telling him the truth. I just know I don’t want to lie to him because that doesn’t seem like something the old Silas would do.\n\nWhen I pull into a parking spot, he opens his door and gets out.\n\n“Landon,” I say before he shuts the door. He leans down and looks at me. “I’m sorry. I’m just having an off week.”\n\nHe nods thoughtfully and turns his attention toward the school. He works his jaw back and forth and then locks eyes with me again. “Hopefully your week is back on before the game tonight,” he says. “You have a lot of pissed off teammates right now.”\n\nHe slams the door and begins walking in the direction of the school. I grab Charlie’s phone and head inside.\n\nI couldn’t find her in the halls, so I went to my first two classes. I’m headed to my third now, still with no word from her. I’m sure she just slept late and I’ll see her when we have class together fourth period. But still—something doesn’t feel right. Everything feels off.\n\nShe could just be avoiding me, but that doesn’t seem like something she would do. She wouldn’t go out of her way to let me know she doesn’t want to speak to me. She’d throw it in my face.\n\nI go to my locker to find my third period math book. I would check her locker to see if any of her textbooks are missing, but I don’t know the combination to her lock. It was written on her schedule, but I gave that to her yesterday.\n\n“Silas!”\n\nI turn around to see Andrew fighting his way through the crowded hallway like a fish swimming upstream. He finally gives up and yells, “Janette wants you to call her!” He turns and heads in the opposite direction again.\n\nJanette…Janette…Janette…\n\nCharlie’s sister!\n\nI find her name in the contacts in my phone. She answers on the first ring.\n\n“Silas?” she says.\n\n“Yeah, it’s me.”\n\n“Is Charlie with you?”\n\nI close my eyes, feeling the panic begin to settle in the pit of my stomach. “No,” I reply. “She didn’t come home last night?”\n\n“No,” Janette says. “I normally wouldn’t be worried, but she usually tells me if she’s not coming home. She never called and now she’s not responding to my texts.”\n\n“I have her phone.”\n\n“Why do you have her phone?”\n\n“She left it in my car,” I say. I close my locker and begin to head toward the exit. “We got into an argument last night and she got in a cab. I thought she was going straight home.”\n\nI stop walking when it hits me. She didn’t have lunch money yesterday—which means she wouldn’t have had cab fair last night.\n\n“I’m leaving school,” I tell Janette. “I’ll find her.”\n\nI hang up before I even give her a chance to respond. I sprint down the hallway toward the door that leads to the parking lot, but as soon as I round the corner, I stop short.\n\nAvril.\n\nShit. Now is not the time for this. I try to duck my head and walk past her, but she grabs the sleeve of my shirt. I stop walking and face her.\n\n“Avril, I can’t right now.” I point to the exit. “I need to leave. Kind of an emergency.”\n\nShe releases my shirt and folds her arms over her chest. “You never showed up during lunch yesterday. I thought maybe you were running late, but when I checked the cafeteria, you were there. With her.”\n\nChrist, I don’t have time for this. In fact, I think I’ll save myself any future trouble and just end it now.\n\nI sigh and run a hand through my hair. “Yeah,” I say. “Charlie and I…we decided to work things out.”\n\nAvril tilts her head and shoots me an incredulous look. “No, Silas. That isn’t what you want, and it’s definitely not going to work for me.”\n\nI look left, down the hall, and then right. When I see no one’s around, I take a step toward her. “Listen, Ms. Ashley,” I say, taking care to address her professionally. I look her directly in the eyes. “I don’t think you’re in any position to tell me how things are going to be between the two of us.”\n\nHer eyes immediately narrow. She stands silently for several seconds as though she’s waiting for me to laugh and tell her I’m only kidding. When I don’t falter, she huffs and shoves her hands against my chest, pushing me out of the way. The click of her heels begins to fade the further I sprint away from her—toward the exit.\n\nI’m knocking for a third time on Charlie’s front door when it finally flies open. Her mother is standing in front of me. Wild hair, wilder eyes. It’s as if hatred spews from her soul the moment she realizes I’m standing here.\n\n“What do you want?” she spits.\n\nI try to glance past her to get a look inside the house. She moves to block my view, so I point over her shoulder. “I need to talk to Charlie. Is she here?”\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    },
    {
      "text": "Page 32",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nHer mother takes a step outside and pulls the door shut behind her so that I can’t see inside at all. “That’s none of your business,” she hisses. “Get the hell off my property!”\n\n“Is she here or not?”\n\nShe folds her arms over her chest. “If you aren’t out of my driveway in five seconds, I’m calling the police.”\n\nI throw my hands up in defeat and groan. “I’m worried about your daughter, so can you please put your anger aside for one minute and tell me if she’s inside?”\n\nShe takes two quick steps toward me and pokes a finger into my chest. “Don’t you dare raise your voice at me!”\n\nJesus Christ.\n\nI push past her and kick open the door. The first thing I’m hit with is the smell. The air is stale. A fog of thick cigarette smoke fills the air and assaults my lungs. I hold my breath as I make my way through the living room. There’s a bottle of whiskey open on the bar, sitting next to an empty glass. Mail is scattered across the table—what looks like several days’ worth. It’s like this woman doesn’t even care enough to open any of it. The envelope on the top of the stack is addressed to Charlie.\n\nI move to pick it up, but hear the woman stalking into the house behind me. I make my way down the hall and see two doors to my right and one on the left. I push open the door to my left, just as Charlie’s mother begins screaming from behind me. I ignore her and make my way into the bedroom.\n\n“Charlie!” I yell. I glance around the room, knowing she isn’t here, but still hoping I’m wrong. If she isn’t here, I don’t know where else to look. I don’t remember any of the places we used to hang out.\n\nBut neither would Charlie, I guess.\n\n“Silas!” her mother yells from the doorway to the bedroom. “Get out! I’m calling the police!” She disappears from the doorway, probably to retrieve a phone. I continue my search for…I don’t even know. Charlie obviously isn’t here, but I keep looking around anyway, hoping to find something that could help.\n\nI know which side of the room is Charlie’s because of the picture of the gate above her bed. The one she said I took.\n\nI look around for clues, but find nothing. I remember her mentioning something about an attic in her closet, so I check the closet. There’s a small hole at the top of it. It looks like she uses her shelves as steps. “Charlie!” I call out.\n\nNothing.\n\n“Charlie, are you up there?”\n\nJust as I check the sturdiness of the bottom shelf with my foot, something slams against the side of my head. I turn, but immediately duck again when I see a plate fly out of the woman’s hand. It crashes against the wall next to my head. “Get out!” she screams. She’s looking for more things to throw, so I put my hands up in surrender.\n\n“I’m leaving,” I tell her. “I’ll leave!”\n\nShe moves out of the doorway to let me pass. She’s still yelling as I make my way down the hall. As I walk toward the front door, I swipe the letter off the bar that was addressed to Charlie. I don’t even bother telling Charlie’s mother to have her call me if she makes it home.\n\nI get in my car and pull back onto the street.\n\nWhere the hell is she?\n\nI wait until I’m a few miles away and then I pull over to check her phone again. Landon mentioned he heard it ringing under the seat, so I lean over and reach my hand beneath the seat. I pull out an empty soda can, a shoe and then finally—her wallet. I open it and sift through it, but find nothing I don’t already know.\n\nShe’s somewhere out there, without her phone or her wallet. She doesn’t have anyone’s numbers memorized. If she didn’t come home, where would she have gone?\n\nI punch the steering wheel. “Dammit, Silas!”\n\nI should have never let her leave by herself.\n\nThis is all my fault.\n\nMy phone receives an incoming text. The text is from Landon, wondering why I left school.\n\nI drop the phone back onto the seat and notice the letter I stole from Charlie’s house. There’s no return address. The date stamp in the top corner is from Tuesday—the day before all of this happened.\n\nI open the envelope and find several pages inside, folded together. Across the front, it reads, “Open immediately.”\n\nI unfold the pages and my eyes instantly fall to the two names written at the top of the page.\n\nCharlie and Silas,\n\nIt’s addressed to both of us? I keep reading.\n\nIf you don’t know why you’re reading this, then you’ve forgotten everything. You recognize no one, not even yourselves.\n\nPlease don’t panic, and read this letter in its entirety. We will share everything we know, which right now isn’t much.\n\nWhat the hell? My hands begin to shake as I continue reading.\n\nWe aren’t sure what happened, but we’re afraid if we don’t write it down, it might happen again. At least with everything written down and left in more than one place, we’ll be more prepared if it does happen again.\n\nOn the following pages, you’ll find all the information we know. Maybe it will help in some way.\n\n~Charlie and Silas.\n\nI stare at the names at the bottom of the page until my vision is blurry.\n\nI look at the names at the top of the page again. Charlie and Silas.\n\nI look at the names at the bottom. Charlie and Silas.\n\nWe wrote ourselves a letter?\n\nIt makes no sense. If we wrote ourselves a letter…\n\nI immediately flip to the pages that follow. The first two pages are things I already know. Our addresses, our phone numbers. Where we go to school, what our classes are, our siblings’ names, our parents’ names. I read through it all as fast as I possibly can.\n\nMy hands are shaking so badly by the third page, I can hardly read the handwriting. I set the page in my lap to finish. It’s more personal information—a list of things we’ve figured out about one another already, our relationship, how long we’ve been together. The letter mentions Brian’s name as someone who keeps texting Charlie. I skip over all the familiar information until I get close to the end of the third page.\n\nThe first memories either of us can recall are from Saturday, October 4th, around 11am. Today is Sunday, October 5th. We’re going to make a copy of this letter for ourselves, but will also mail copies in the morning, just to be safe.\n\nI flip to the fourth page and it’s dated Tuesday, October 7th.\n\nIt happened again. This time, it happened during history class on Monday, October 6th. It appears to have happened at the same time of day, 48 hours later. We don’t have anything new to add to the letter. We both did our best to stay away from friends and family the past day, faking illnesses. We’ve been calling one another with any information we know, but so far it seems this has happened twice. The first time being Saturday, the second being Monday. Wish we had more information, but we’re still kind of freaked out that this is happening and aren’t sure what to do about it. We’ll do what we did last time and mail copies of this letter to ourselves. Also, there will be a copy in the glove box of Silas’ car. That’s the first place we looked this time, so there’s a good chance you’ll look there again.\n\nI never checked the glove box.\n\nWe’ll keep the original letters somewhere safe so no one will find them. We’re afraid if anyone sees the letters, or if anyone suspects anything, they’ll think we’re going crazy. Everything will be in a box on the back of the third shelf of Silas’ bedroom closet. If this pattern continues, there’s a chance it could happen again on Wednesday at the same time. In case it does, this letter should arrive to both of you that day.\n\nPROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang"
    },
    {
      "text": "Page 33",
      "content": "PROMOTED CONTENT\nCô gái hóa thiên nga sau khi giảm 20kg! Học ngay cách!\nSleepatnightandslim\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi\nTấp nập người mua chiếc đồng hồ bản sao Omega này khi nó giảm 90%\nWatchthuysichinhhang\nCách tăng khả năng đàn ông mạnh mẽ cho chồng chỉ bằng một mẹo nhỏ\n\nI look at the time stamp on the envelope again. It was mailed first thing Tuesday morning. And Wednesday at 11am is exactly when this happened to us.\n\nIf you find anything out that will help, add it to the next page and keep this going until we figure out what started it. And how to stop it.\n\nI flip to the last page, but it’s blank.\n\nI look at the clock. It’s 10:57am. It’s Friday. This happened to us almost 48 hours ago.\n\nMy chest is heaving.\n\nThis can’t be happening.\n\n48 hours will be up in less than three minutes.\n\nI flip open my console and search for a pen. I don’t find one, so I yank open the glove box. Right on top is a copy of the same letter with mine and Charlie’s names on it. I lift it up and there are several pens, so I grab one and flatten the paper out against the steering wheel.\n\nIt happened again, I write. My hands are shaking so bad, I drop the pen. I pick it up again and keep writing.\n\nAt 11am, Wednesday, October 8th, Charlie and I both lost our memories for what appears to be the third time in a row. Things we’ve learned in the last 48 hours:\n\n-Our fathers used to work together.\n\n-Charlie’s father is in prison.\n\nI’m writing as fast as I can, trying to figure out which points I need to write down first—which are the most important, because I’m almost out of time.\n\n-We visited a tarot reader on St. Philip Street. That might be worth checking out again.\n\n-Charlie mentioned a girl at school—called her The Shrimp. Said she wanted to talk to her.\n\n-Charlie has an attic in her bedroom closet. She spends a lot of time in there.\n\nI feel like I’m wasting time. I feel like I’m not adding anything of importance to this damn list. If this is true and it’s about to happen again, I won’t have time to mail a letter, much less make copies. Hopefully if I have it in my hands, I’ll be smart enough to read it and not just toss it aside.\n\nI bite the tip of the pen, attempting to focus on what to write next.\n\n-We grew up together, but now our families hate each other. They don’t want us together.\n\n-Silas was sleeping with the guidance counselor, Charlie with Brian Finley. We broke it off with both of them.\n\n-Landon is a good brother, you can probably trust him if you have to.\n\nI continue to write. I write about our tattoos, the Electric Crush Diner, Ezra and anything and everything I can recall from the last 48 hours.\n\nI look at the clock. 10:59.\n\nCharlie doesn’t know about this letter. If everything in this letter so far is accurate and this really has been happening to us since last Saturday, that means she’s about to forget everything she’s learned in the past 48 hours. And I have no idea how to find her. How to warn her.\n\nI press the pen to the paper again and write one last thing.\n\n-Charlie got into a cab on Bourbon Street last night and no one has seen her since. She doesn’t know about this letter. Find her. The first thing you need to do is find her. Please.\n\nPROMOTED CONTENT\nMen gan cao chính là vì đã mắc virus viêm gan B! Triệt tiêu ngay\nBí mật detox gan và tế bào hóa ra lại cực kì đơn giản và tiện lợi"
    }
  ],
  "type": "novel"
}